[ {
  "url" : "https://hh.ru/vacancy/105276206?query=java",
  "companyName" : "ООО ГК Иннотех | разработка ИТ-решений (Иннотех)",
  "textContent" : "Обязанности: разрабатывать приложения на базе микро-сервисной архитектуры, поддерживать и дорабатывать теĸущие; уметь самостоятельно решать сложные технические задачи; делиться технической экспертизой с менее опытным коллегам; уметь работать с техническим заданием; уметь взаимодействовать с членами команды, а также с другими командами; обеспечивать полный цикл разработки – от анализа требований и проектирования до внедрения; оптимизировать и рефакторить существующие подсистемы; участвовать в ĸод ревью; участвовать в принятии техничесĸих и архитеĸтурных решениях; участвовать в планировании спринтов, оценĸе и деĸомпозиции задач. Требования к кандидату: понимание принципов построения микросервисной архитектуры, разработки высоконагруженных, масштабируемых и отказоустойчивых приложений; понимание принципов stateless-архитектуры; большой опыт создания Rest API на нагруженном проекте (для web, mobile) уверенные знания Java 11+; опыт коммерческой разработки на java от 5 лет; понимание SOLID; опыт работы с Spring Framework (Core, Boot, Security, Web, Data JPA); опыт работы и проектирования реляционных БД (Postgresql, Oracle); знание фреймворков тестирования: Junit, TestNG, Mockito; опыт работы с брокером сообщений Kafka; опыт работы с Redis; понимание CI/CD; понимание принципов работы сред контейнеризации и оркестрации (Docker, K8s, Openshift); уверенные знания Swagger; опыт работы с Git; опыт работы по Scrum.",
  "keywords" : [ ]
}, {
  "url" : "https://hh.ru/vacancy/106859874?query=java",
  "companyName" : "LATOKEN",
  "textContent" : "Вакансия: Продакт Разработчик React/Node.js Full stack LATOKEN, одна из ведущих криптобирж мира, ищет Продакт Разработчика Full stack React/Node.js для работы над платформой запуска комаркетинговых активностей. О компании: LATOKEN входит в ТОП 20 криптобирж мира, является крупнейшей Веб3 компанией из СНГ и входит в Forbes ТОП 30 компаний для удаленной работы в 2022 году. Наша платформа - это супермаркет криптоактивов с более чем 3,000 наименований. Нашей миссией является упрощение процесса узнавания и обмена любого актива с помощью AI, открывая каждому возможность узнать о новых технологиях, рынках и стать участником будущего. React/Node.js Full stack разработчик играет критическую роль в: Разработке платформы запуска комаркетинговых активностей (airdrops & trading competitions). Автоматизации процесса листинга новых токенов на бирже. Ваши обязанности как продакт разработчика: Ответственность за доставку проектов в продакшн и решение кросс-командных проблем Груминг и планирование беклога Понимание клиентских метрик и вашего влияния на них Требования: 2+ года опыта в Node.js и React Увлечение передовыми технологиями в мире веб разработк и AI Трудолюбие и способность работать под давлением 50-60 часов в неделю, стремление вырасти в лида и CTO Опыт написания телеграм ботов на Python, а также опыт работы с Java - большой плюс! Преимущества: Возможность быстрого роста в культуре спортивных достижений Работа с передовыми технологиями AI и Web3 Крупнейшая компания в области Web3 из СНГ Удаленная работа Оплата в твердой валюте Опционы Работа в LATOKEN - это уникальная возможность попасть на передовую технологий, развиться и создать будущее. Мы приглашаем энтузиастов технологий с духом спортивных достижений. Откликнитесь на эту вакансию, если чувствуете, что у нас есть лучшая работа для роста вашего потенциала изменить мир.",
  "salary" : "от 2 500 до 3 200 $ на руки",
  "keywords" : [ "TypeScript", "PostgreSQL", "JavaScript", "Node.js", "React" ]
}, {
  "url" : "https://hh.ru/vacancy/107877858?query=java",
  "companyName" : "Т-Банк",
  "textContent" : "Ищем QA-инженеров, которые будут тестировать backend. У нас много проектов и интересных задач — вам понравится. В Т-Банк мы создаем и развиваем десятки высоконагруженных сервисов. А QA-команда делает так, чтобы все работало без сбоев 24/7. Каждый день мы проводим сотни тестов и проверяем десятки гипотез, чтобы создавать продукты, которые нравятся клиентам. Мы ищем QA-backend-инженеров, которые разделяют наши главные ценности: высокое качество и безопасность продуктов. Среди проектов — внутренние и внешние платформы, обеспечивающие работу сервисов. Мы тестируем приложения в связке с брокерами сообщений: Kafka, MQ, а также с базами данных: Oracle, PostgreSQL, Ignite. А еще тестируем API продуктов и сервисов, используя Postman, Swagger и автотесты. Что нужно будет делать: Проводить функциональное и автоматизированное тестирование. В том числе анализировать и тестировать требования; Работать в продуктовой команде; Разрабатывать тестовую документацию и приемочные критерии, готовить тестовые данные; Сопровождать релизы. Что мы ждем от нашего кандидата: Знаете теорию тестирования, есть опыт работы в тестировании от 2 лет; Знаете тест-дизайн: умеете применять основные техники, составлять чек-листы и тест-планы под задачи; Знаете один из языков программирования: Java, Kotlin или Go; Знаете SQL (джойны, группировки); Умеете работать с API (rest/soap); Умеете работать с системами логирования: отчетами, алертами и дашбордами; Разбираетесь в Gitlab, работаете с пайплайнами и логами. Мы предлагаем: Возможность работы в аккредитованной ИТ-компании; Комфортную для тебя заработную плату (обсудим ее на собеседовании); Полис ДМС со стоматологией и страховка от несчастных случаев для тебя, а также льготные условия страхования для близких; Компенсация спорта и фитнеса по системе AllSports (золотая карта); Компенсация питания и такси; Мощную технику на выбор (MAC/WIN); Профессиональное развитие. Проводим митапы, тренинги и мастер-классы, дадим доступ к огромной технической библиотеке; Оплата конференций, курсов и много чего еще.",
  "keywords" : [ ],
  "address" : "Минск, проспект Победителей, 110"
}, {
  "url" : "https://hh.ru/vacancy/107877890?query=java",
  "companyName" : "Т-Банк",
  "textContent" : "Ищем тимлидов для развития проектов: — мобильный банк для физлиц, бизнеса и инвестиций; — нефинансовые сервисы внутри банка с помощью кросс-платформенных решений; — машинное обучение в продуктах и внутренние процессы компании, вкладываемся в долгосрочные исследования. Развиваем сервис телефонного ассистента Олега для защиты от спамеров и мошенников; — высоконагруженная и отказоустойчивая система Т-Инвестиций, которая управляет активами пользователей, принимает запросы на операции с активами, обрабатывает информацию от биржи; — развитие ИТ в России: делимся опытом и приглашаем выступать экспертов из других компаний; — масштабируем существующие и создаем новые продукты на международном рынке. Вам предстоит: управление командой разработки (аналитики, разработчики, QA-инженеры), участие и принятие решений в найме определение стека разработки для новых сервисов найм сотрудников обсуждение требований и участие в планировании развития продукта проектирование архитектуры решений проработка архитектуры со смежными подразделениями Что ждем от кандидата: опыт работы в роли TeamLead команды разработки > 1 года опыт управления полноценной командой (аналитика-разработка-тестирование-delivery от аналитики до production) хорошее знание используемого стека разработки (нужно пройти собеседования по соответствующим секциям найма : .NET, Java, Python, Go, Frontend) опыт построения решений в микросервисной архитектуре опыт в проектировании систем (хорошая оценка в секции Дизайна) Мы предлагаем: Работу в офисе в Минске. График работы — гибридный Оформление по ТК РБ Платформу обучения и развития «Т‑Банк Апгрейд». Курсы, тренинги, вебинары и базы знаний. Поддержку менторов и наставников, помощь в поиске точек роста и карьерном развитии Заботу о здоровье. Оформим полис ДМС со стоматологией и страховку от несчастных случаев. Компенсацию обедов и транспорта После окончания испытательного срока — частичную компенсацию затрат на спорт и 5 sick days в год 31 календарный день отпуска в год Программу лояльности для сотрудников от партнеров Достойную зарплату — обсудим ее на собеседовании",
  "keywords" : [ "Разработка", "Teamleading" ]
}, {
  "url" : "https://hh.ru/vacancy/108616209?query=java",
  "companyName" : "ООО ГК Иннотех | разработка ИТ-решений (Иннотех)",
  "textContent" : "Вместе с нами ты будешь: -участвовать в качестве разработчика в создании открытого API Банка и развитии Интернет-Банка Среднего и Малого Бизнеса; -разрабатывать на Java - на современном стеке технологий. Какие знания и навыки для нас важны: -отличные знания Java SE 8+; -знание принципов ООП, шаблонов проектирования; -понимание микросервисной архитектуры; -опыт enterprise разработки/разработки высоко-нагруженных сервисов; -отличные знания Spring; -знание JUnit/TestNG; -знание Maven/Gradle; -опыт работы с gRPC (желательно); -опыт работы с Kafka, Zuul (желательно); -знакомство с Netty, протоколом WebSocket (желательно). Технологический стек проекта: -Микросервисная архитектура: OpenShift/Spring Cloud, Docker. -Back-end: Java 11/ Kotlin, Spring Cloud (Netflix Oss), Tarantool. -Front-end:typescript, React, Redux Важно! В Офис в г. Минск, трудоустройство по ТК РБ",
  "keywords" : [ "Java", "Git", "Spring Framework", "Gradle", "React" ]
}, {
  "url" : "https://hh.ru/vacancy/109228550?query=java",
  "companyName" : "Т-Банк",
  "textContent" : "Мы расширяем команды и ищем разработчиков для развития нескольких сервисов: Т-Инвестиции. Мы — лидер среди брокеров по количеству активных клиентов. Делаем инвестиции удобными, технологичными и понятными; Т-Бизнес. Меняем подход к ведению бухгалтерии, обмену документами между организациями и работе с архивами — переводим все и вся в цифру; Т-Страхование. Развиваем платформу прямых продаж. Наша цель — предсказуемый, удобный процесс для бизнеса и клиента; Платежные технологии и процессинг. Занимаемся разработкой и поддержкой платежного шлюза банка. Задачи шлюза — определять тип платежей, наполнять их данными из других систем банка и проверять разрешенность операций. У нас много интересных и разнообразных задач, опытная команда и отличные возможности для роста. Откликайтесь на вакансию, чтобы узнать о проектах и выбрать подходящий для вас. Что нужно будет делать: Разрабатывать внешние и внутренние продукты Прорабатывать и реализовать интеграционные решения Что мы ждем от нашего кандидата: Опыт разработки на Java/Kotlin от 3 лет Опыт коммерческой разработки на Java 11+ или Kotlin Опыт коммерческой разработки с любым из фреймворков: Spring Boot, Quarkus, Micronaut или Vert.x Опыт коммерческой разработки с одним из контейнеризаторов: Kubernetes, Docker или OpenShift Опыт коммерческой разработки с одним из брокеров: Kafka, Rabbit MQ или Active MQ Опыт коммерческой разработки с PostgreSQL, MySQL или Oracle будет плюсом Опыт работы с системой контроля версий Мы предлагаем: Гибридный формат работы (офис находится в Минске, Беларусь) по ТК РБ 31 календарный день отпуска и до 5 sick days в году Медицинское страхование (со стоматологией и медикаментами) и страховку от несчастных случаев (+ льготное страхование для ваших близких) Золотую карту AllSports или частичную компенсацию затрат на спорт от стоимости абонемента Профессиональное развитие в университете Т-Апгрейд, возможность участвовать в митапах, тренингах и МК от Т-Банк, частичную компенсацию внешних обучающих программ / сертификаций Компенсацию такси или питания до 12 рублей в день Мощную технику на выбор (Windows / MacBook) Программу лояльности для сотрудников Т-Банк в Беларуси от партнеров (benefits.by) Достойную зарплату (с привязкой к USD) и годовой бонус Ежегодный пересмотр зарплаты",
  "keywords" : [ "RabbitMQ", "Java", "Docker", "PostgreSQL", "Spring Framework", "Spring Boot", "Kubernetes", "Kotlin" ],
  "address" : "Минск, проспект Победителей, 110"
}, {
  "url" : "https://hh.ru/vacancy/109334233?query=java",
  "companyName" : "Secreate",
  "textContent" : "Привет! Мы Secreate - ИТ-компания с подходом 360° - закрываем цифровые задачи бизнеса, от аналитики и разработки любой сложности до проектного консалтинга и поддержки готового решения. Среди наших клиентов такие компании как: Suzuki, Росгосстрах, Ростелеком, LG, Skyeng, OZON, Kaspersky, ИТМО, МИСИС и другие. Мы открыты новому, и даем свободу действовать, меняться и строить свой профессиональный путь. Среди наших принципов: Отсутствие бессмысленной бюрократии и излишнего формализма; Безграничные возможности развития (60% ТОПов выросли в компании); Гибкость к изменениям. А еще у нас полная удаленка, программа бенефитов для команды и ламповая атмосфера. У нас огромные амбиции в росте компании, потому усиливаем ключевой отдел - отдел Рекрутинга :) Чем предстоит заниматься: Активный поиск ИТ-специалистов для аутсорсинга и аутстаффинга (разработчики, тестировщики, аналитики, бэк-офис и т.д.) с использованием различных источников: HeadHunter, LinkedIn, GitHub, Telegram, Habr и других специализированных платформ. Формирование и развитие базы кандидатов, обеспечение качественного потока резюме в воронку. Проведение первичного скрининга кандидатов и оценка их соответствия требованиям позиций. Взаимодействие с рекрутерами и аккаунт-менеджерами для уточнения требований по вакансиям и согласования профилей кандидатов. Анализ рынка труда и разработка рекомендаций по поиску редких специалистов. Поддержание связи с потенциальными кандидатами, создание и поддержка базы пассивных кандидатов. Обеспечение своевременного и точного учета данных в системе отслеживания кандидатов (CRM/ATS). Требования: Опыт сорсинга IT-специалистов от 1 года в аутсорсинговых или аутстаффинговых компаниях. Знание современных инструментов и техник сорсинга: Boolean Search, X-Ray, LinkedIn Recruiter, Habr, GitHub. Опыт поиска кандидатов на сложные позиции (Senior/Lead, редкие стеки технологий). Понимание основных технологий, популярных стеков и их применений (Java, Python, QA и др.). Ключевая особенность: Для нас критически (!!) важен фокус на качественном сервисе для кандидата, разговоре на одном языке со специалистом и желании строить долгосрочные отношения. Сорсеры-спамеры и сорсеры-игнорщики - мимо. Условия: Оформление по ТК/ГПХ; 28 дней оплачиваемого отпуска, 4 sick-days в год; Полная удаленка; Заинтересован(-а) - ждем твой отклик. Если человеческий подход в найме это про тебя - мы 100% сконнектимся :)",
  "keywords" : [ ]
}, {
  "url" : "https://hh.ru/vacancy/109749085?query=java",
  "companyName" : "Т-Банк",
  "textContent" : "Т-Банк — это амбициозные ИТ-проекты и высоконагруженные системы: от мобильного банка и облачного колл-центра до инвестиционных площадок и ML-продуктов. Наша пользовательская аудитория — более 36 млн человек. Важная часть команды — SRE-инженеры, которые отвечают за надежность и отказоустойчивость приложений и инфраструктуры. Мы ищем специалистов от уровня миддл до лидов. Вам у нас понравится, если вы: Понимаете важность стабильной работы приложений Любите анализировать причины сбоев в работе софта и инфраструктуры Разделяете принцип проактивности: лучше предотвратить сбой, чем потом его устранять Хотите автоматизировать рутину, чтобы заниматься более интересными задачами Обязанности Разрабатывать инструменты для повышения надежности информационных систем Участвовать в устранении сбоев и расследовании их причин Повышать Observability приложений Проектировать, внедрять и поддерживать метрики для мониторинга Поддерживать бесперебойную работу сервисов Автоматизировать рутинную работу Проектировать и внедрять отказоустойчивую архитектуру приложений Договариваться с коллегами и находить лучшие решения для проекта Требования Умеете работать с Linux на уровне системного администратора Уверенно владеете одним из языков программирования: Go, C#, Python, Java и другие Понимаете принципы построения CI/CD-пайплайнов и IaC-подхода Ориентируетесь в ИТ: сетях, работе с данными, протоколах интернета, RPC и другом Работали с системами контроля версий Git Работали с системами мониторинга Prometheus и Grafana, агрегаторами логов Splunk, ELK и Graylog Работали с системами контейнеризации и оркестрации Docker и k8s Можете быстро принимать решения во время сбоя, не теряетесь и не сдаетесь Что мы предлагаем? Работу в офисе в Минске. График работы — гибридный Оформление по ТК РБ Платформу обучения и развития «Т‑Банк Апгрейд». Курсы, тренинги, вебинары и базы знаний. Поддержку менторов и наставников, помощь в поиске точек роста и карьерном развитии Заботу о здоровье. Оформим полис ДМС со стоматологией и страховку от несчастных случаев. Компенсацию обедов и транспорта После окончания испытательного срока — частичную компенсацию затрат на спорт и 5 sick days в год 31 календарный день отпуска в год Программу лояльности для сотрудников от партнеров Достойную зарплату — обсудим ее на собеседовании",
  "keywords" : [ "GitLab CI", "Ansible", "Python / Go / Java / C# / TypeScript", "Atlassian Confluence", "Gitlab", "Jira", "Kubernetes" ]
}, {
  "url" : "https://hh.ru/vacancy/109757235?query=java",
  "companyName" : "hibirit",
  "textContent" : "О компании: hibirit является аккредитованной ИТ-компанией, которая занимается разработкой программного обеспечения на заказ для российских и зарубежных клиентов с 2015 года. Среди наших клиентов: Сбербанк, КАМАЗ, Volkswagen, Инвитро и другие. Наши команды разработчиков находятся в России, и мы стремимся расширить наш бизнес на белорусском рынке. Мы специализируемся на создании высококачественных решений с использованием Java и JavaScript. В связи с открытием представительства в Беларуси хотим найти энергичного и целеустремлённого менеджера по продажам B2B, который поможет нам привлечь первых клиентов в Беларуси. Обязанности: Активный поиск и привлечение новых клиентов в сегменте среднего и крупного бизнеса на рынке Беларуси. Проведение холодных звонков, написание холодных писем и проведение встреч с потенциальными клиентами. Ведение переговоров и заключение контрактов, согласование условий сотрудничества. Разработка и выполнение стратегии продаж, анализ рынка и выявление новых возможностей. Установление и поддержание долгосрочных отношений с клиентами, регулярные коммуникации и выявление новых потребностей. Взаимодействие с командой проектных менеджеров и разработчиков для обеспечения успешной реализации проектов. Ведение отчетности о продажах, планирование и выполнение KPI. Требования: Опыт работы: 2+ года в продажах IT-услуг (предпочтительно в сфере аутсорсинга или разработки ПО). Навыки переговоров: Умение выстраивать доверительные отношения с клиентами, уверенность в переговорах на уровне топ-менеджмента. Понимание рынка IT: Базовые знания технологий разработки ПО (Java, JavaScript) и способность легко разбираться в новых технологических решениях. Проактивность и нацеленность на результат: Готовность брать на себя ответственность за достижение целей по продажам. Коммуникативные навыки: Отличные устные и письменные коммуникативные способности. Организованность: Умение управлять своим временем, работать с CRM-системами и вести отчётность. Преимущества работы с нами: Возможность стать частью растущей компании и активно влиять на её развитие на новом рынке. Поддержка команды профессионалов в области разработки ПО. Конкурентоспособная заработная плата + бонусы за успешные сделки. Гибкий график работы и возможность удалённой работы. Перспективы карьерного роста и профессионального развития. Условия: Оплата: Оклад + мотивационная система с бонусами за успешные продажи. Формат работы: Гибкий, возможны встречи с клиентами в офисах в Минске. Офис в спокойном месте в центре Минска. Трудоустройство по ТК РБ Если вы готовы принять вызов и стать частью нашей команды, присылайте своё резюме и краткое мотивационное письмо. Мы будем рады обсудить ваше видение развития продаж в сфере IT!",
  "keywords" : [ "Ведение переговоров", "Холодные продажи", "Телефонные переговоры", "Работа на выставках", "Business Development", "B2B Продажи" ]
}, {
  "url" : "https://hh.ru/vacancy/109953409?query=java",
  "companyName" : "ООО ГК Иннотех | разработка ИТ-решений (Иннотех)",
  "textContent" : "Обязанности: Поддержка существующего приложения, внедрение новой функциональности поддержка кастомных элементов пользовательского интерфейса Написать Unit Test для существующих модулей Работать с системой контроля версий Git Работа в кросс-функциональной команде Требования: опыт разработки Android от 2 лет уверенные знания по Java и Kotlin умение разбираться и работать с чужим кодом готовность к командной работе и трудиться над общими задачами знание и понимание принципов SOLID понимание и умение применять архитектурные паттерны (MVP, MVVM, …) опыт работы с Dagger 2, RxJava 2, Android Architecture Components опыт работы с Git участие в code review опыт разработки клиент-серверных приложений Jira, confluence опыт написания Unit/UI-тестов",
  "keywords" : [ ],
  "address" : "Москва, Динамо, Петровский парк, Замоскворецкая линия, метро Динамо"
}, {
  "url" : "https://hh.ru/vacancy/110134346?query=java",
  "companyName" : "Гроу Медиа",
  "textContent" : "Привет, будущий коллега! Grow Media – это рекламное агентство. Наши продукты - это различные сервисы для рынка performance маркетинга, а также собственные мобильные приложения. Основные рынки работы – США, Европа, Латинская Америка и Азия. Мы находимся в поиске тестировщика приложений и игр / QA Engineer (Games and Apps) в нашу команду по созданию мобильных приложений! Нам нужен тот, кто умеет искать баги, ломать приложения, уметь фиксировать пути воспроизведения найденных неполадок, а в идеале - знать что нужно исправить для их фикса. Обязанности: тестирование приложений и игровых проектов компании; контроль качества проектов компании на платформах Android и iOS; подготовка тестового окружения для проведения тестирования; проведение ручного и регрессивного тестирования; поиск ошибок локализации; оформление баг-репортов; контроль исправления багов; написание и поддержка тестовой документации (тест-планы, тест-кейсы и чек-листы); взаимодействие с разработчиками и другими сотрудниками компании. Пожелания к кандидату: знания, необходимые для развёртывания системы тестирования с нуля; опыт тестирования приложений и игр на Android и iOS; хорошее понимание принципов и методик тестирования; большой игровой опыт на мобильных устройствах; опыт работы с Android Studio (ADB) и Xcode; понимание процесса разработки и жизненного цикла ПО; представление о принципах работы клиент-серверных приложений, баз данных; умение работы с Git и сборкой билда; работа с документами в Google Docs. Желательные: опыт тестирования рекламных SDK; опыт тестирования инструментов аналитики Firebase и Branch; анализ данных производительности Unity проектов (Profiler); знания языков программирования (приоритет: C#, JavaScript, TypeScript, ReactNative, Java); опыт разработки игр и приложений на Unity и React Native; уровень английского языка не ниже B1. Что используем: платформы: Android, iOS; магазины приложений: Google Play, App Store; языки разработки приложений: C# (Unity), React Native (JavaScript); документация: Notion, Google Docs; таск-трекинг: Trello; система контроля версий: Git; общение: Slack. Условия: занятость частичная. На данном этапе от 10 до 20 часов в месяц, к сентябрю планируется увеличение загрузки; оплата почасовая. Пожалуйста, пишите ожидаемую стоимость часа в сопроводительном письме при отклике на вакансию; удаленка.",
  "keywords" : [ "Английский — B1 — Средний" ]
}, {
  "url" : "https://hh.ru/vacancy/110141134?query=java",
  "companyName" : "RedLab",
  "textContent" : "Группа компаний \"Литота Лабс\", имеет более 17 лет успешной деятельности на рынке РФ и СНГ. Мы создаем и внедряем уникальные ИТ решения для развития бизнеса ведущих компаний букмекерской, финансовой и других сфер. МЫ СПЕЦИАЛИЗИРУЕМСЯ НА СОЗДАНИИ ЦИФРОВЫХ ПРОДУКТОВ ДЛЯ В2В КЛИЕНТОВ И ФОРМИРУЕМ ВЫДЕЛЕННЫЕ КОМАНДЫ РАЗРАБОТКИ. СРЕДИ НАШИХ КЛИЕНТОВ: крупнейшие российские ИТ гиганты, вместе с которыми мы реализуем масштабные федеральные проекты - IBS, Диасофт, ОТР, ЛАНИТ, Айтеко, Норбит, БФТ, Cinimex, Кометрика, Неофлекс, Парма, Техносерв, ТимФорс, мы принимаем участие в разработке продуктов для ведущих российских банков самых разных цветов, компании, которым мы помогаем автоматизировать их бизнес и создавать новые продукты: УБРиР, ВСК, SKB Lab, Cleverence, U_C_S, Еврохим, KonnektU, BPC, BrandMonitor, InvoiceBox, СберЗвук. МЫ ПРИДЕРЖИВАЕМСЯ ПРОДУКТОВОГО ВИДЕНИЯ: В ТЕСНОМ ВЗАИМОДЕЙСТВИИ С ЗАКАЗЧИКОМ ИЩЕМ ЛУЧШИЕ ИДЕИ ДЛЯ РЕШЕНИЯ ЕГО ЗАДАЧ И НАХОДИМ ОПТИМАЛЬНЫЕ ВАРИАНТЫ ИХ РЕАЛИЗАЦИИ. Последние 9 лет 100% сотрудников Литоты Лабс работают удалённо. Мы считаем, что работать нужно там, где удобно, а не под влиянием внешних факторов - и нам ни разу не пришлось пожалеть о выборе данной модели. Для выполнения проектов по ЗАКАЗНОЙ РАЗРАБОТКЕ ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ наша команда ищет JAVA BACKEND РАЗРАБОТЧИКА. МЫ ПОРУЧИМ: Разработку новой функциональности в действующих проектах и разработку проектов с 0. Рефакторинг и оптимизацию существующей функциональности. Исправление найденных дефектов. Написание модульных и интеграционных тестов. Написание технической документации. ДЛЯ ВЫПОЛНЕНИЯ ЗАДАЧ НЕОБХОДИМЫ: Опыт коммерческой разработки на Java не менее 3-х лет. Основные принципы и подходы в работе с реляционными базами данных (в т.ч. уровни изоляции транзакций, язык SQL, основы работы с ключами, основы работы ORM-фреймворков). Опыт использования Spring Framework в реальных проектах. Принципы работы и особенности использования Spring Framework. Основы ООП, методологий разработки и шаблонов проектирования и уметь применять их на практике. Основные подходы и техники написания модульных и интеграционных тестов. Английский язык (на уровне чтения проф. литературы). БУДЕТ ПЛЮСОМ: Знание принципов популярных СУБД (MySQL/Postgres). Понимание основы работы с VCS (в частности, с Git). МЫ ПРЕДЛАГАЕМ: Полностью удаленную работу - возможность распоряжаться своим временем с наибольшей эффективностью, но при этом чувствовать свою причастность к делу и команде. Интересные и уникальные проекты в трендовых направлениях. Справедливое вознаграждение в соответствии со вкладом в развитие компании. Свободу локации и мобильность. Возможность профессионального развития до руководителя группы или в сторону технического эксперта. Комфортная рабочая атмосфера.",
  "keywords" : [ "Java", "Kafka", "Spring Boot", "ActiveMQ", "ORACLE", "Kotlin", "RabbitMQ", "Elasticsearch", "Docker", "OpenShift", "Spring Framework", "MongoDB", "Spring Seсurity", "Kubernetes" ]
}, {
  "url" : "https://hh.ru/vacancy/110955437?query=java",
  "companyName" : "ООО ГК Иннотех | разработка ИТ-решений (Иннотех)",
  "textContent" : "Обязанности: Создание высоконагруженных сервисов, поддержĸа и доработĸа теĸущих; Участие в ĸод ревью; Подготовĸа релиз плана перед обновлением сервиса или первого вывода в прод; Интеграция со смежными системами REST, KAFKA; Хранение/обновление больших объемов данных, масштабирование на потребителей; Работа в тесном сотрудничестве с бизнес-аналитиками, UX/UI дизайнерами, владельцем продукта, а также с другими командами. Требования: Опыт коммерческой разработки Highload приложений на Java; Отличные знания Java Core и опыт работы со стеком Spring, в том числе SpringBoot; Использовали Git; Gradle/Maven; Опыт в построении микросервисной архитектуры; Навыки работы с очередями (Kafka, RabbitMQ, ArtemisMQ); Навыки работы с (Docker, K8s/OpenShift); Опыт работы с СУБД (PostgreSQL, Oracle); Опыт написания unit - тестов; Понимание Reactive Spring (Spring WebFlux, R2DBC, Reactive Spring Data). Будет плюсом: Есть опыт в построении высоконагруженных распределенных систем и понимание проблем многопоточной обработки данных; Есть понимание основ криптографии и практический опыт в использовании TLS; Есть опыт работы c Nexus.",
  "keywords" : [ ]
}, {
  "url" : "https://hh.ru/vacancy/110956642?query=java",
  "companyName" : "Aston",
  "textContent" : "Мы — международная аккредитованная ИТ-компания, четырехкратный обладатель премии «Работодатель года» по версии Habr. C 2007 года разрабатываем цифровые решения для b2b-клиентов. Мы работаем с топовыми российскими и иностранными компаниями и знаем, какие специалисты востребованы на рынке. Поэтому приглашаем вас на бесплатное онлайн-обучение “QA Engineer Java”, где преподавателями будут практикующие ИТ-специалисты уровня Middle и Senior. Ежегодно мы обучаем 900+ человек, лучшие стажеры после обучения получают первую работу в ИТ. 75% стажеров с первого раза проходят интервью на проекты. Онлайн-курс \"QA Engineer Java\": продолжительность 2 месяца, 2 раза в неделю, в вечернее время; теория + практика + домашние задания. Требования к кандидатам: уверенные знания теории тестирования; понимание SQL; понимание принципов работы WEB / Mobile приложений; базовые знания Java; готовность после обучения пройти стажировку в компании IT-компании ASTON; уровень английского языка от А2 и выше; готовность к командировкам в РФ после обучения. После успешного окончания онлайн-курса приглашение в Лабораторию на стажировку QA Engineer Java с последующим трудоустройством в IT-компании ASTON. Условия стажировки в Лаборатории оформление по ТК РБ; Обучение с 9:00 до 18:00 с перерывом на обед; Изучение теории с еженедельными проверками изученного материала; Практика на учебных проектах под руководством опытного техлида; Подготовка к собеседованию и самопрезентации; Минск, Витебск, Гомель, Полоцк - стажировка в офисе; удаленный формат стажировки. Что получают стажеры ASTON? Поддержка ментора в процессе обучения и после выхода на коммерческий проект; Бесплатные корпоративные курсы английского языка; Частичная компенсация стоимости спортивных абонементов; Доступ к корпоративному порталу с обучающими материалами. ASTON - это отличная возможность старта и роста в сфере IT!",
  "keywords" : [ "Java", "Test case", "Базы данных", "Нагрузочное тестирование", "JSON API", "Тестирование", "web тестирование", "Проведение тестирований", "автоматизация тестирования", "Функциональное тестирование", "SQL", "ООП", "Модульное тестирование", "Регрессионное тестирование", "Selenium IDE" ]
}, {
  "url" : "https://hh.ru/vacancy/110994457?query=java",
  "companyName" : "RedLab",
  "textContent" : "Hello, Python Developers! RedLab — глобальная ИТ-компания, которая занимается созданием ПО и формированием выделенных команд разработки. Мы входим в ГК Litota Group c 2019 года и объединяем лучших экспертов со всего мира, для которых создание ИТ-продуктов — не просто работа, а дело всей жизни. Для работы на разнообразных трендовых проектах, в том числе, международного уровня наша команда ищет PYTHON-РАЗРАБОТЧИКА для аутстафф направления. Группа компаний \"Литота Лабс\", имеет более 17 лет успешной деятельности на рынке РФ и СНГ. Мы создаем и внедряем уникальные ИТ решения для развития бизнеса ведущих компаний букмекерской и финансовой сфер и других сфер. Последние 9 лет 100% сотрудников Литоты Лабс работают удалённо. Мы считаем, что работать нужно там, где удобно, а не под влиянием внешних факторов - и нам ни разу не пришлось пожалеть о выборе данной модели. Мы ценим нашу команду, поэтому заботимся о том, чтобы сотрудники были полностью удовлетворены работой и приносили реальный результат нашим клиентам. Предлагаем: полную занятость со стабильными выплатами; оплату труда, соответствующую вашим навыкам и ожиданиям, с реальной возможностью роста; разнообразные трендовые проекты, в том числе, международного уровня; полностью удаленный формат работы; стабильный график 5/2 с гибким началом рабочего дня; оформление по ТК или ГПХ с физ. лицом. Ожидаем: Опыт коммерческой разработки на Python от 3-х лет; Владение одним из асинхронных фреймворком: FastAPI, AioHttp. Опыт работы с asyncio, threading. Будет плюсом владение фреймворками: Sanic, Starlette,Django, Flask, etc.; Опыт работы с БД (PostgreSQL/Oracle); Опыт работы с брокерами очередей; Опыт разработки API (RestAPI); Опыт написания SQL-запросов; Опыт работы с микросервисной архитектурой; Опыт работы с Git, Jira; Коммуникабельность, умение продуктивно общаться с коллегами. Будет плюсом: Опыт работы с Docker, GitLab CI, OpenShift либо Kubernetes; Опыт работы с Keycloak; NoSQL (Clickhouse, Mongo, InfluxDB). Сертификаты станут плюсом, но совсем не обязательны, нам важен достойный уровень ваших знаний и умений! Этапы отбора: Анкета; Первичное интервью; Техническое интервью; Оффер. Ждем Вас в нашей дружной команде!",
  "keywords" : [ "Unit Testing", "GitHub", "PostgreSQL", "REST API", "Celery", "JavaScript", "MySQL", "PHP", "Python", "Flask", "Java", "RestAPI", "Redis", "Bash", "SQL", "REST", "Backend", "jQuery", "Git", "Linux", "Frontend", "Django", "Ansible", "Clickhouse", "Django Framework", "API", "FastAPI", "Gitlab" ]
}, {
  "url" : "https://hh.ru/vacancy/111078036?query=java",
  "companyName" : "Aston",
  "textContent" : "Мы — российская аккредитованная ИТ-компания, четырехкратный обладатель премии «Работодатель года» по версии Habr. C 2007 года разрабатываем цифровые решения для b2b-клиентов. Мы работаем с топовыми российскими и иностранными компаниями и знаем, какие специалисты востребованы на рынке. Поэтому приглашаем вас на стажировку Java-разработчик. Лучшие получат свою первую работу в ИТ! Ежегодно мы обучаем 900+ человек, 75% стажеров с первого раза проходят интервью на проекты. Требования к кандидатам: понимание принципов ООП, понимание алгоритмов и структур данных, знание Java Core; обязательное знание основ Java EE (Servlets, jsp); представление о реляционных базах данных (Oracle, MySQL, PostgreSQL и др.); опыт написания unit-тестов, знания систем контроля версий (git или svn), Spring Framework, а также ORM (Hibernate Framework); готовность к командировкам; знание английского языка на уровне Pre-Intermediate и выше; высшее образование. Что мы предлагаем? Оформление по ТК РБ; Официально устраиваем на работу; Даём доступ к корпоративной программе обучения; Берём на работу также лучших стажёров; После выхода на проект регулярно пересматриваем и повышаем зарплату; Обеспечиваем классические IT-плюшки: офис в центре города, бесплатный английский, корпоративные ивенты, частичная компенсация стоимости спортивных абонементов. Условия стажировки: Обучение 3-4 месяца 5 дней в неделю с 9:00 до 18:00 с перерывом на обед; Изучение теории с еженедельными проверками изученного материала; Практика на учебных проектах под руководством опытного техлида; Подготовка к собеседованию и самопрезентации; Пройти обучение удаленно. Приходи в ASTON и расти вместе с нами!",
  "keywords" : [ "Java EE", "Java Servlets", "Java", "Unit Testing", "PostgreSQL", "JSP", "SVN", "ORACLE", "ООП", "Git", "MySQL", "Hibernate ORM", "Spring Framework" ]
}, {
  "url" : "https://rabota.by/vacancy/104890170?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Софтнетикс",
  "textContent" : "Компания Softnetix ищет на новый проект Backend Kotlin Developer'ов (формат работы - офис Минск, Немига 5). Описание проекта Проект представляет собой систему агрегации и анализа информации. На backend'e используется сервис-ориентированная архитектура. Для написания сервисов используются Kotlin. Требования: Хороший уровень любого из языков (Java, Kotlin, Scala) Опыт работы с SQL Понимание OOP, SOLID Знание паттернов проектирования Опыт работы с любым фреймворком (Ktor, Quarkus, Vert.x, Axon Framework, Akka, Micronaut, Play Framework, Spring) Опыт работы с системами сборки Gradle или Maven Опыт работы с системами контроля версий Git или Mercurial Базовые знания Docker Базовые навыки работы с командной строкой Linux Преимуществами будут: Знание принципов DDD Знание паттерна Event Sourcing Понимание принципов асинхронного программирования (Kotlin Coroutines) Понимание сервис-ориентированной/микросервисной архитектуры PostgreSQL (JOOQ, JDBC, R2DBC) WebSockets GraphQL Kafka Redis Cassandra, ScyllaDB ClickHouse Nginx Kotest, Mockk, Testcontainers GitLab CI/CD pipelines Docker swarm / Kubernetes Условия: Работа из комфортного офиса в центре Минска (Немига) Столы с регулировкой высоты, 27\" 4k мониторы, современное железо (Ryzen 9 7950X, Intel Core i7 14700KF) Частые пересмотры ЗП (performance review) Чёткий план карьерного и профессионального роста Полностью оплачиваемые больничные Отпуск 28 дней, возможность брать отпуск по частям Гибкое начало рабочего дня (до 10:30) и отсутствие микроменеджмента Корпоративные курсы английского языка, корпоративные ивенты",
  "salary" : "от 600 до 3 500 $ на руки",
  "keywords" : [ "Java", "Nginx", "Паттерны проектирования", "PostgreSQL", "Kafka", "Redis", "HTTP", "Microservices", "SQL", "Kotlin", "ООП", "Backend", "Git", "NoSQL", "Linux", "Docker", "Clickhouse", "SOLID", "Gitlab" ],
  "address" : "Минск, Немига, Октябрьская, Площадь Ленина, Юбилейная площадь, улица Немига, 5"
}, {
  "url" : "https://rabota.by/vacancy/107494655?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Innowise Group / Фабрика инноваций и решений",
  "textContent" : "Innowise Group на рынке с 2007 года. За это время наша команда реализовала 850+ проектов для заказчиков из 60+ стран мира — и эти показатели постоянно растут. Для тебя это возможность интенсивно развиваться, пробовать себя в разных направлениях и технологиях, стать ментором и реализовывать свои самые смелые карьерные ожидания. Основа нашего успеха — крутая команда. У нас сформировалось профессиональное комьюнити, которое поможет тебе расти, общаться с экспертами и поддерживать компетенции на высоком уровне. Уверены, что ты сможешь усилить нашу команду! Наши ожидания: Автоматизация тестирования web (опционально мобильных приложений,desktop, тестирование API) используя следующие языки программирования: Java; Знание паттернов автоматизации тестирования; Опыт создание фреймворка для автоматизации тестирования; Опыт работы с CI\\CD системами; Знание и опыт работы с системами тест репортинга; Опыт работы с CVS (системами контроля версий); Знание рабочего процесса при работе с ветвями; Опыт ведения проектов с различными методологиями разработки ПО (классические, SCRUM, Kanban); Четкое понимание жизненного цикла проекта и места QA в этом цикле; Опыт работа с базами данных; Опыт работы с различными баг-трекинговыми и тест трекинговыми системами; Знание инструментов для тестирования API; Владение английским языком В2. Будет плюсом: Опыт создания скриптов для работы со сторонними объектами; Опыт работы со скриптовыми языками (powershell, bash); Умение определять оптимальные инструменты и подходы для автоматизации; Опыт менторинга; Опыт определения тестового покрытия. Мы предлагаем: Обучение и развитие: Большой пул разноплановых проектов в таких сферах, как FinTech, Medicine, Entertainment, eCommerce, Gaming, Artificial Intelligence и пр.; Минимум легаси; короткий бенч; Широкий стек технологий, возможность перехода между ними; Индивидуальные карты роста и регулярный пересмотр условий (роли на проекте, уровня ЗП); Подготовка к собеседованиям с зарубежными заказчиками на английском языке. Рабочая среда: Формат работы: офис; Просторные и комфортные рабочие места; Подробный онбординг: знакомство с командой, процессами и правилами, экскурсия по офису, welcome card; Уютные кухни, игровые комнаты, коворкинги, лаунж-зоны. Дополнительные бонусы: Cкидки у компаний-партнеров (от пиццерий и книжных до магазинов бытовой техники); Добровольное медицинское страхование. Ну что, ты с нами? Ждем тебя в нашей дружной команде!",
  "keywords" : [ ]
}, {
  "url" : "https://rabota.by/vacancy/107763295?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Лайфтех",
  "textContent" : "Приглашаем в команду Senior Android developer на проект BiP. О проекте: Мессенджер BiP - это удобный современный мессенджер с голосовой и видеосвязью, а также большим набором развлекательных функций, который используется по всему миру. На текущий момент мессенджером BiP активно пользуются более 129 млн пользователей (в том числе 117 на Android), количество скачиваний приложения - около 70 млн. Стек технологий: Java/Kotlin, RxJava2, Dagger2, AndroidX, Room. Активная стадия разработки Международная команда разработчиков уровня senior/expert (более 10 человек) Наши ожидания: Опыт работы с Kotlin Обширные знания и опыт создания асинхронных многопоточных приложений с использованием различных платформ и сторонних решений, таких как Kotlin Coroutines, RxJava и Executors Хорошее знание принципов объектно-ориентированного, реактивного и функционального программирования Опыт работы с шаблонами архитектурного проектирования, такими как MVVM (обязательно), MVP, MVI и т. Д. Опыт работы с основными Android Arch компонентами, такими как ViewModel, LiveData, Paging, Room, Navigation и WorkManager. Знание DI, в частности Dagger 2. Хорошие знания TCP и UDP, Sockets, понимание WebRTC. Хорошее знание REST Хорошее знание принципов SOLID Опыт в Scrum Разговорный английский от уровня В1 Условия работы и социальный пакет: Формат работы удаленный Подробнее о нашей социальной политике и бенефитах можно узнать в профиле компании, или на нашем сайте Условия мотивации обсуждаются индивидуально Присоединяйся к команде lifetech, решай сложные профессиональные задачи, повышай уровень компетенций!",
  "keywords" : [ "RxJava", "Git", "MVP", "Dagger 2", "Scrum", "Английский язык", "Kotlin" ],
  "address" : "Минск, проспект Победителей, 103"
}, {
  "url" : "https://rabota.by/vacancy/108323434?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО КлеверДев Софтваре",
  "textContent" : "We are #hiring! Are you a Java Developer looking for anunique experience career in a fast growing up-and-coming company? CleverDev Software offers great opportunities for career advancement, competence improvement, and contribution to great inspiring projects. Your Responsibilities As a #javadeveloper you will work on: ● web application (server side) development and support; ● data acquisition services (http requests) development using Amazon Lambda serverless technology; ● REST API for Angular implementation of Single Page Application (design of database for storage of entities, CRUD development of services); ● data import from external systems via REST API and authorization implementation via OAuth2; ● code review. Our Requirements You are a perfect candidate for us if you meet the following mandatory requirements: ● at least 1 years of commercial development experience in Java; ● database design experience; design patterns ● RESTful interfaces ● Concurrency/multithreading ● One or more databases like PostgresQL, Oracle, Mongo DB, MS SQL Server ● SDLC and CI/CD ● Unit testing ● Clean code concepts ● Spring or similar frameworks ● JDBC, Hibernate, JPA, Spring Data ● Kafka, JMS or MQ technologies ● Hands on with Cloud (Azure, AWS, GCP, etc.) ● Docker, Kubernetes. ● English at the document reading level Preferable requirements: Knowledge of one of cloud platforms such as AWS or GCP, Azure (rare) AWS Cloud: Knowledge of: Lambda, DynamoDB, Hive, API Gateway, ElasticSearch, Cloudwatch, Kinesis, S3, EC2, Firehose, SQS, CodePipeline, CodeBuild, Aurora GCP: e.g., Google Cloud Compute Engine, Google Cloud Load Balancing, Google Kubernetes Engine, Google Cloud Looker Azure: Cloud Native Azure Solution, Azure Integration, Azure Cosmos DB Cassandra API Our Work Format Our company encourages Flexible Work Format — you can work from home or in our cosy office. Our teams use Jira for tasks settings, and Confluence for project descriptions. Our Terms We are sure you would love working with us as we provide: ● formal employment; ● competitive compensation depending on your experience and skills; ● regular assessments campaign; ● open free control style; ● corporate English courses; ● cool office-parties every month; ● friendly environment of communication and cooperation. Feel free to contact CleverDev Software at any time!",
  "keywords" : [ "AngularJS", "Java", "Spring Framework", "Hibernate ORM", "SQL" ],
  "address" : "Минск, Грушевка, Михалово, проспект Жукова, 29"
}, {
  "url" : "https://rabota.by/vacancy/108538127?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ЗАО Водород",
  "textContent" : "VADAROD – IT компания, мы специализируемся на разработке и сопровождении программных продуктов в банковском и финансовом домене. Приглашаем Senior Android Developer на проект онлайн-банкинга для физических лиц. Задачи: Разработка мобильного приложения (android) по подготовленному тз/макетам с применением лучших практик; Анализ входящих инициатив от заказчика; Участие в code review; Коммуникация с заказчиком; Активное участие в жизни компании и отдела мобильной разработки(митапы и другие инициативы). Мы ожидаем: Опыт работы от 5-ти лет в мобильной разработке; Желательно знание финтех домена, понимание бизнес-процессов в банках; Знания ООП, SOLID, MVC, MVP , MVVM , REST, Android SDK, Kotlin, Java. Мы предлагаем: Комфортный, современный офис в центре города с прекрасным видом на парк; Гибкое начало рабочего дня; Формат работы - офис, гибрид. Медицинская страховка с включенной стоматологией; Курсы английского языка; Возможность внешнего и внутреннего обучения, участие в семинарах и конференциях; Отпуск 29 дней и материальный бонус к отпуску; Обеспечиваем необходимой техникой для комфортной работы.",
  "keywords" : [ "Java", "MVVM", "MVP", "MVC", "Android SDK", "SOLID", "Android", "Kotlin" ],
  "address" : "Минск, Купаловская, Октябрьская, Площадь Победы, проспект Независимости, 32А"
}, {
  "url" : "https://rabota.by/vacancy/108607683?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО НитСофт",
  "textContent" : "NeatSoft - IT-компания, специализирующаяся на разработке веб- и мобильных приложений с 2016 года. Мы работаем с клиентами из различных стран мира и успешно реализовали проекты в странах СНГ и Западной Европы. Наши проекты включают как продуктовую разработку (например, logtime.me и mybase.pro), так и аутсорсинг разработки. Работаем с такими технологиями как: Angular; React; VueJS; NodeJS; NestJS; Yii2; Laravel; DevOps Tools; Flutter, Java. Мы находимся в постоянном развитии и ищем 1С Программиста в нашу дружную команду. Обязанности: Поддержка действующих механизмов в 1С. Интеграция с различными информационными системами, в т.ч. с использованием брокера сообщений Rabbit MQ. Оперативное решение проблем, инцидентов, связанных с функционированием системы. Создание и поддержка документации по работе с программным обеспечением 1С, включая инструкции пользователям и рекомендации по настройке. Оптимизация существующих решений, повышение производительности. Разработка и внедрение нового функционала на платформе 1С. Требования: Высшее образование; Опыт работы от 1 года; Опыт разработки конфигураций с нуля; Умение писать чистый, аккуратный, документированный код; Опыт работы с конфигурациями с большим объемом данных; Знание языка запросов 1С, БСП, основных механизмов 1С; Опыт интеграции 1С со сторонними сервисами (XML / JSON, SOAP / - REST, HTTP / WS). Будет плюсом: Навыки интеграции с использованием брокера сообщений Rabbit MQ; Опыт работы в финтех компаниях. Английский язык уровня B1 и выше. Ценные для нас навыки: Хорошо развитые коммуникативные и аналитические способности. Умение работать в команде и брать на себя ответственность. Мы предлагаем: Дружественную и уютную атмосферу, удобное расположение офиса. Комфортное рабочее место с чаем, кофе и печеньем, пицца вторниками. Нескучные задачи без бюрократии и формализма. Заработную плату, привязанную к курсу USD. Гибкий график работы с плавающим началом рабочего дня. Бонусы и премии по результатам работы и значимым событиям. Если вы заинтересованы в этой вакансии и соответствуете указанным требованиям, мы будем рады видеть вас в нашей команде!",
  "keywords" : [ "1С программирование", "1С: Предприятие", "Английский язык" ],
  "address" : "Минск, Грушевка, Михалово, Петровщина, улица Карла Либкнехта, 66"
}, {
  "url" : "https://rabota.by/vacancy/108828986?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Центр информационных технологий Мингорисполкома",
  "textContent" : "Обязанности: разработка и внедрение программных продуктов; сопровождение внедренных программных продуктов, их доработка и внесение изменений. Требования: высшее техническое образование; знание английского языка на базовом уровне; опыт работы в Git; знание SOL и PL/SQL; знание принципов программирования на Kotlin/Java; знание принципов разработки мобильных приложений для операционной системы Android; понимание основных шаблонов проектирования, принципы объектно-ориентированного программирования; знание принципов работы и методов администрирования СУБД Oracle приветствуется; умение читать и дорабатывать чужой код; понимание принципов клиент-серверного взаимодействия, протоколов HTTP/HTTPS. Условия: возможность профессионального роста и развития; официальное оформление; комфортные условия работы; стабильная заработная плата; график работы с понедельника по четверг с 8.45 до 18.00, в пятницу до 16.45.",
  "keywords" : [ ]
}, {
  "url" : "https://rabota.by/vacancy/108865963?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО НитСофт",
  "textContent" : "NeatSoft - IT-компания, специализирующаяся на разработке веб- и мобильных приложений с 2016 года. Мы работаем с клиентами из различных стран мира и успешно реализовали проекты в странах СНГ и Западной Европы. Наши проекты включают как продуктовую разработку (например, logtime.me и mybase.pro), так и аутсорсинг разработки. Работаем с такими технологиями как: Angular; React; VueJS; NodeJS; NestJS; Yii2; Laravel; DevOps Tools; Flutter, Java. Мы находимся в постоянном развитии и ищем GoLang Developer в нашу дружную команду. Что мы ожидаем: Знание и опыт разработки на GoLang. Уверенное владение языком программирования Go. Опыт работы с фреймворками и библиотеками GoLang. Понимание основ асинхронного программирования и многопоточности. Опыт работы с системами контроля версий, такими как Git. Желание учиться и развиваться в области GoLang-разработки. Будет плюсом: Опыт коммерческой разработки на GoLang от 3 лет. Знание и опыт работы с сетевыми протоколами и веб-серверами на основе GoLang. Опыт работы с базами данных, включая SQL и NoSQL. Знание и опыт работы с JSON/XML. Умение работать с REST API и другими веб-сервисами. Ценные для нас навыки: Хорошо развитые коммуникативные и аналитические способности. Умение работать в команде и брать на себя ответственность. Английский язык уровня B1 и выше. Мы предлагаем: Дружественную и уютную атмосферу, удобное расположение офиса. Комфортное рабочее место с чаем, кофе и печеньем. Нескучные задачи без бюрократии и формализма. Заработную плату, привязанную к курсу USD. Гибкий график работы с плавающим началом рабочего дня. Бонусы и премии по результатам работы и значимым событиям. Если вы заинтересованы в этой вакансии и соответствуете указанным требованиям, мы будем рады видеть вас в нашей команде!",
  "keywords" : [ "Git", "Go", "GoLand", "Английский — B1 — Средний", "Английский язык" ],
  "address" : "Минск, Грушевка, Михалово, Петровщина, улица Карла Либкнехта, 66"
}, {
  "url" : "https://rabota.by/vacancy/108955928?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "IDF Technology",
  "textContent" : "IDF Technology – успешная IT-компания, специализирующаяся на кредитном скоринге, Data Science и финансовых цифровых технологиях. И мы приглашаем Java developer стать частью нашей компании! Задачи: Разработка нового функционала; Переписывать монолит на микросервисную архитектуру; Проводить аудит текущих решений на предмет идей улучшений; Профайлинг, оптимизация и рефакторинг существующих решений. Требования: Java; Spring Framework; Hibernate ORM; Gradle; JPA; MySQL. Для нас важно: Глубокое понимание ООП и шаблонов проектирования; Понимание концепции микросервисов и умение писать масштабируемые системы; Коммерческий опыт на Java от 3-х лет. Стек проекта: JAVA 17; Kotlin; Spring Framework; Infrastructure - Docker, ELK, Netflix stack (Swarm, Consul, Vault, Hystrix, Kibana, Grafana, Prometheus, Haproxy); Mongo, GridFS, Redis, ElasticSearch, RabbitMQ, Kafka, MySql, JavaEE (JPA, JAX-RS), Glassfish; ORM - Hibernate, Jooq; Testing - on Spock, JUnit, Mockito, RestAssured; Build - Gradle, Maven. Условия: Заработная плата, привязанная к курсу валют; Годовой бонус; Оплата участия в профильных конференциях, митапах и т.д.; Компенсация занятий иностранным языком и спортом; ДМС после испытательного; Режим работы, уважающий биоритмы каждого отдельного сотрудника; Отпуск 28 дней + 5 sick days; Оплата анализов/лекарств/врачей на ковид; Адекватный менеджмент, отсутствие бюрократии; сильная и действительно дружная команда; Весёлая корпоративная жизнь (тимбилдинги, мероприятия и корп.подарки). Присоединяйтесь к нашей команде!",
  "keywords" : [ "Java", "MySQL", "Spring Framework", "Kotlin" ]
}, {
  "url" : "https://rabota.by/vacancy/108969537?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Innowise Group / Фабрика инноваций и решений",
  "textContent" : "Innowise Group на рынке с 2007 года. За это время наша команда реализовала 850+ проектов для заказчиков из 60+ стран мира — и эти показатели постоянно растут. Для тебя это возможность интенсивно развиваться, пробовать себя в разных направлениях и технологиях, стать ментором и реализовывать свои самые смелые карьерные ожидания. Основа нашего успеха — крутая команда. У нас сформировалось профессиональное комьюнити, которое поможет тебе расти, общаться с экспертами и поддерживать компетенции на высоком уровне. Информация о проекте: Мы занимаемся разработкой информационной системы для управления транспортным сообщением в одном из крупных городов. Система включает мобильное приложение, веб-платформу, информационные дисплеи на остановках и в других общественных местах. Мы интегрируем данные о маршрутах и времени прибытия транспорта в реальном времени, предоставляя пользователям возможность легко планировать поездки, получать уведомления о изменениях маршрутов и пополнять проездные карты. Система использует внешние данные о маршрутах и добавляет GPS-треки транспорта в реальном времени для обновления информации о движении. Наше решение активно используется разными сервисами для планирования поездок, информационными дисплеями и операторами общественного транспорта. Наши ожидания: Коммерческий опыт работы от 2-ух лет. Опыт работы с микросервисной архитектурой и высоконагруженными системами. Уверенное владение .Net, C#, ASP.NET Core, Razor Pages. Знание JavaScript, Typescript, React, Node.js. Опыт работы с облачными решениями (Azure, Firebase) и инструментами (Azure DevOps). Гибкий график с обязательной работой 4 часа ночью для коммуникации с клиентами и командой. Будет плюсом: Опыт работы с CMS (например, Umbraco) и AngularJS будет плюсом. Чем предстоит заниматься: Разработка и поддержка микросервисной архитектуры на разных языках программирования (C#, .Net, Java, Node.js). Интеграция с внешними источниками данных о транспортных маршрутах и управление GPS-треками. Реализация нотификаций для пользователей о изменениях маршрутов и других событиях. Разработка UI для веб-приложений, мобильных платформ и публичных информационных дисплеев. Оптимизация и поддержка системы, которая уже несколько лет в продакшене. Мы предлагаем: Обучение и развитие: Большой пул разноплановых проектов в таких сферах, как FinTech, Medicine, Entertainment, eCommerce, Gaming, Artificial Intelligence и пр.; Минимум легаси; короткий бенч; Широкий стек технологий, возможность перехода между ними; Индивидуальные карты роста и регулярный пересмотр условий (роли на проекте, уровня ЗП) Подготовка к собеседованиям с зарубежными заказчиками на английском языке. Рабочая среда: Формат работы: офис; Просторные и комфортные рабочие места; Подробный онбординг: знакомство с командой, процессами и правилами, экскурсия по офису, welcome card; Уютные кухни, игровые комнаты, коворкинги, лаунж-зоны. Дополнительные бонусы: Добровольное медицинское страхование. Cкидки у компаний-партнеров (от пиццерий и книжных до магазинов бытовой техники). Ну что, ты с нами? Ждем тебя в нашей дружной команде!",
  "keywords" : [ "Razor Pages", "Umbraco CMS", "Tailwind CSS" ]
}, {
  "url" : "https://rabota.by/vacancy/109076264?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "LeverX",
  "textContent" : "LeverX is seeking a talented SAP BTP Consultant to join our dynamic team. This is an exciting opportunity to work with a global IT partner and gain experience in building business applications using cutting-edge technologies and SAP Business Technology Platform (BTP) services across international projects. REQUIREMENTS: Minimum 5 years of experience working in the SAP environment connected with any of the products: S/4HANA, SAP Cloud Solutions (Ariba, SuccessFactors, CX, etc) Expertise in management of the SAP BTP Services and Tools via Platform Cockpit Expertise in SAP BTP Services setup: Trust, Platform Roles, Destinations, Connectivity (including Cloud Connector), Principal Propagation Expertise with SAP Cloud Identity Services (IAS and IPS), XSUAA. Setup, configuration, administration. Experience with SAP BTP Cloud Foundry environment (CLI and operations) Expertise in solution architecture or willing to grow as solution architect Excellent English communication skills (verbal and written) Desire to learn and explore new cloud technologies and tools RESPONSIBILITIES: Be part of LeverX BTP Community, including engineers, architects, and solution experts. Design, develop, and deploy cloud enterprise solutions using a combination of SAP technologies and solutions, focusing on Automation and Integration. Collaborate with functional analysts and architects to capture requirements, and work with developers to design consumer-grade business applications. Stay updated with the latest SAP BTP features and services, participating in internal meetups and knowledge-sharing sessions. Analyze and resolve significant, complex, high-impact production issues, evaluating alternatives as necessary and implementing solutions. Balance multiple tasks efficiently and switch between different tasks as needed. Work with multi-regional teams across different time zones. ‘Nice to have’ skills: Experience in any solution from SAP Build portfolio: Work Zone, Apps, Process Automation, Code Knowledge of the SAP development standards and methodologies Understanding of multi tenant application development approaches Experience with HANA Cloud (Operations, Development) Understanding of Modern SAP web standards - Web Components, CAP (Node.js / Java) Understanding of Event driven architecture and application within SAP environment (Event Mesh) Expertise with other SAP BTP services and tools Expertise participating in Pre-Sales / Solution Design Makes you stand out: - Expertise with CAP (Node.js or Java) - Expertise in enterprise architecture topics",
  "keywords" : [ ]
}, {
  "url" : "https://rabota.by/vacancy/109076984?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Вэльюсофт",
  "textContent" : "Valuesoft - компания (входит в ПВТ), специализирующаяся на разработке собственного продукта для анализа спортивных событий и котировок букмекерских контор. Наша цель - предоставить клиентам инструменты и технологии для принятия обоснованных решений в области спортивных ставок. Обязанности: Java-программист для сканирования и парсинга сайтов букмекерских контор Требования: Опыт извлечения данных из веб-страниц и обработка их Понимание того, как работают http(s)/ajax - запросы Понимание того, как устроены html/xml/json разметки Базовые знания работы JavaScript (понимание основных концепций и возможностей языка) Умение писать читаемый и структурированный код (корректные и осмысленные названия переменных/методов/классов) В тествой задаче, помимо ответа, добавьте примечание что дочитали до этого пункта Понимание алгоритмов и структур данных имеющихся в базовом SDK (Collection, Map, Stream, работа с потокам и т.п) Знание регулярный выражений Опыт работы с git Условия: Официальное трудоустройство Мед. страховка Работа бок о бок со всеми кто разрабатывает и принимает ключевые решения по развитию продукта Просторный офис недалеко от метро (10 мин пешком) По мере роста опыта - привлечение к большему количество разнообразных и интересных задач Плавающий график . Т.е. будет 2 выходных, но они могут быть в другие дни помимо субботы и воскресенья (по предварительной договоренности с работником)",
  "salary" : "от 900 до 2 100 $ на руки",
  "keywords" : [ "Java" ]
}, {
  "url" : "https://rabota.by/vacancy/109147325?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО НитСофт",
  "textContent" : "NeatSoft - IT-компания, специализирующаяся на разработке веб- и мобильных приложений с 2016 года. Мы работаем с клиентами из различных стран мира и успешно реализовали проекты в странах СНГ и Западной Европы. Наши проекты включают как продуктовую разработку (например, logtime.me и mybase.pro), так и аутсорсинг разработки. Работаем с такими технологиями как: Angular; React; VueJS; NodeJS; NestJS; Yii2; Laravel; DevOps Tools; Flutter, Java. Мы находимся в постоянном развитии и ищем DevOps-инженера в нашу дружную команду. Что мы ожидаем: Опыт администрирования и конфигурации операционных систем на базе Linux. Понимание работы систем баз данных, таких как SQL и NoSQL. Практический опыт в настройке мониторинга с использованием таких инструментов как Grafana, Prometheus, систем сбора. Знание основ контейнеразации и оркестрации (Docker, Kubernetes, и т.п.) Базовое понимание сборки проектов на языках: Java (Maven, Gradle), Golang, C#. Знание сетевых протоколов (TCP/IP, HTTP, Websockets). Будет плюсом: Опыт работы DevOps инженером от 1 года. Понимание процессов и принципов разработки ПО. Умение диагностировать инфраструктурные и локальные ошибки. Понимание практик DevOps, принципов CI/CD и опыт применения в реальных инфраструктурах. Понимание микросервисной архитектуры. Опыт администрирования gitlab. Ценные для нас навыки: Хорошо развитые коммуникативные и аналитические способности. Умение работать в команде и брать на себя ответственность. Английский язык уровня B1 и выше. Мы предлагаем: Дружественную и уютную атмосферу, удобное расположение офиса. Комфортное рабочее место с чаем, кофе и печеньем. Нескучные задачи без бюрократии и формализма. Заработную плату, привязанную к курсу USD. Гибкий график работы с плавающим началом рабочего дня. Бонусы и премии по результатам работы и значимым событиям. Если вы заинтересованы в этой вакансии и соответствуете указанным требованиям, мы будем рады видеть вас в нашей команде!",
  "keywords" : [ "Linux", "Docker", "CI/CD", "Bash", "Gitlab", "Python" ],
  "address" : "Минск, Грушевка, Михалово, Петровщина, улица Карла Либкнехта, 66"
}, {
  "url" : "https://rabota.by/vacancy/109205235?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Бэлл Интегратор",
  "textContent" : "Bell Integrator – один из ведущих системных интеграторов страны. Мы аккредитованная ИТ-компания и являемся частью ГК Softline. Bell Integrator активно реализует проекты по всей России, среди наших заказчиков – крупнейшие системообразующие финансовые, телеком и ритейл компании страны. Проекты: Продуктовая банковская команда проекта PEGA SFA. Разработка проектов цифрового бизнеса в сегменте КИБ. В SFA у КМ должна появиться возможность оформлять Бизнес кредит с графиком аннуитетного платежа. В НИБ у клиента должна появится возможность оформить БК с графиком аннуитетного платежа Команда занимается развитием направления страхования, в т.ч. защиты бизнеса, страхования залогового обеспечения и иных рисков на кредитных продуктах поточного кредитования. За счет внедрения Защиты бизнеса Банк частично конвертирует процентный доход в комиссионный Требования: Опыт работы с Pega от 2-3х лет; Умение работать с background процессами в Pega (Agent, Queue Processor) и проектировать асинхронное взаимодействие с внешними системами. Базовые знания Java/Ruby; Понимание процессного подхода, основ BPM, Case Management; Навыки написания запросов SQL, оптимизация запросов; Знание различных методов интеграции систем (синхронное/асинхронное взаимодействие, интеграция через шину), опыт работы с REST/SOAP API, понимание особенностей форматов обмена данными JSON/XML; Задачи: включают в себя полный цикл разработки: проектирование решений, разработка, включение в общую поставку и дальнейшее экспертное сопровождение. Условия: Официальное трудоустройство в аккредитованную компанию Bell Integrator Конкурентная заработная плата Удаленный формат работы Добровольное медицинское страхование Собственное фитнес-приложение Скидки на занятия английским языком через SkyEng Корпоративная техника (по согласованию с руководителем) Корпоративные развлекательные программы",
  "keywords" : [ "REST", "MQ", "pega", "SOAP" ]
}, {
  "url" : "https://rabota.by/vacancy/109219195?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Бэлл Интегратор",
  "textContent" : "Bell Integrator – один из ведущих системных интеграторов России. Мы являемся аккредитованной ИТ-компанией. Центральный офис Bell Integrator расположен в Москве, представительства – в Нижнем Новгороде, Пензе, Саратове, Уфе, Минске (Беларусь). На текущий момент с нами работает более 2500 высококлассных аналитиков, руководителей проектов, разработчиков, тестировщиков и специалистов по сопровождению крупных информационных систем. Bell Integrator активно реализует проекты по всей России, среди наших заказчиков – крупнейшие системообразующие финансовые, телеком и ритейл компании страны. На рынке РБ Bell Integrator 12 лет. Являемся резидентами ПВТ (Парк высоких технологий). Обязанности: автоматизация тестирования клиент-серверных приложений (обязательно - API, WEB, MQ, DB) Требования: Опыт от 2х лет Знание в Java stream api + functional interfaces + модификаторы +- реализацию ООП концепций; Опыт разработки тестовой документации (чек-листы, планы, отчеты и тому подобное); Умение находить/формулировать/предлагать решения; Высокий уровень самоорганизации и коммуникативный навык; Условия: - Конкурентоспособная заработная плата - Корпоративное обучение и сертификация в технических и бизнес областях - Широкие возможности для карьерного роста и профессионального развития - Корпоративные развлекательные программы - Корпоративная программа частичной компенсации занятий по английскому языку (партнер Skyeng) - компенсация спорта AllSports - ДМС.",
  "salary" : "от 190 000 до 260 000 ₽ на руки",
  "keywords" : [ "Java", "Git", "TestNG", "Apache Kafka", "API", "Автоматизированное тестирование", "SQL" ],
  "address" : "Минск, Институт Культуры, улица Фабрициуса, 8"
}, {
  "url" : "https://rabota.by/vacancy/109280878?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Бэлл Интегратор",
  "textContent" : "Стек: Java 11, Kafka, PostgreSQL, OpenShift, Spring Boot, React (Typescript), микросервисная архитектура, cloud native подход, интеграция с 20+ различными системами в периметре банка и за его пределами Требования: Специалист по Java 8+, Spring Boot Опыт более 4 лет в разработке систем промышленного уровня на Java Опыт более 1 год в роли тимлида разработки Опыт правильного применения шаблонов проектирования ПО Опыт разработки микросервисов Знание протоколов, форматов и технологий HTTP, REST, GRPC, JSON, XML, XSD Способность создавать решения, обеспечивающие отказоустойчивость систем Высшее техническое образование Желательно: Опыт проектирования межсервисных взаимодействий умение применять принципы реактивного программирования Стремление к максимальному покрытию кода тестами Опыт работы со Spring Validation, StateMachine, Swagger Знакомство с OpenShift и Istio Опыт работы по agile/scrum методологии Знание и умение работать с Jira и Confluence Понимание, как устроен бизнес глобальных рынков Обязанности: Разработка бизнес и интеграционной логики Проектирование технических решений Подготовка к внедрению Рецензирование кода, дизайна решения, документации Написание модульных и интеграционных тестов Условия: Официальное трудоустройство в Bell Integrator Конкурентная заработная плата (по итогам собеседования) Аккредитованная ИТ-компания Формат работы: удаленно Менторство Возможности карьерного роста и получения экспертизы в ведущих проектах страны Скидки на занятия фитнесом и собственное фитнес-приложение Скидки на занятия английским языком",
  "keywords" : [ "Java", "PostgreSQL", "OpenShift", "Spring Framework", "Apache Kafka", "руководство командой разработчиков" ]
}, {
  "url" : "https://rabota.by/vacancy/109302442?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "УП Е-Вижн",
  "textContent" : "О вакансии: В команду Web разработки ищем Senior PHP Разработчика. Среди наших проектов - b2c и b2b магазины, информационные сайты известных брендов: AENO, Canyon, Lorgar, Prestigio, а также разработанные нашей командой CMS и CRM системы для управления контентом, каталогом, продажами и маркетингом. Ключевые обязанности: Разработка и поддержка высоконагруженных проектов; Участие в разработке архитектуры; Участие в Design Review и Code Review; Обзор и улучшение инструментов автоматизации для CI/CD. Требования: Опыт работы на PHP от 5 лет; Работа с Laravel 8+; Знание PHP 8.0 и выше; Опыт работы с PostgreSQL / MySQL (движки БД, индексы, оптимизация запросов); Опыт работы с Redis; Опыт работы с Elasticsearch; Уверенное знание и понимание принципов SOLID и паттернов проектирования; Знание принципов микросервисной архитектуры; Понимание и опыт работы с CI/CD; Опыт написания модульных тестов; Знание и умение настраивать NGINX; Опыт настройки логирования и мониторинга сложных систем. Будет плюсом: Опыт работы с крупными и сложными проектами; Уверенное знание SQL, сложных запросов, знание оптимизации SQL-запросов; Опыт работы с другими языками программирования (Java, C#) и NodeJS; Опыт разработки на Vue.js/JS; Особенности проекта: основной сервер на PHP, работа с базами данных RDBMS/NoSQL, брокер сообщений Rabbit MQ, движок Elasticsearch. Мы предлагаем: интересные и разнообразные задачи; динамичную работу в международной компании; широкие возможности для профессионального развития и роста; стабильность, социальное обеспечение и гарантии; конкурентоспособную заработную плату. Оставляй отклик! Будем рады тебе в нашей команде.",
  "keywords" : [ ],
  "address" : "Минск, Каменная Горка, улица Притыцкого, 156"
}, {
  "url" : "https://rabota.by/vacancy/109305327?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Бэлл Интегратор",
  "textContent" : "Обязанности: Разработка бизнес и интеграционной логики Проектирование технических решений Подготовка к внедрению Рецензирование кода, дизайна решения, документации Написание модульных и интеграционных тестов Требования: Специалист по Java 8+, Spring Boot Опыт более 4 лет в разработке систем промышленного уровня на Java Опыт более 1 год в роли тимлида разработки Опыт правильного применения шаблонов проектирования ПО Опыт разработки микросервисов Знание протоколов, форматов и технологий HTTP, REST, GRPC, JSON, XML, XSD Способность создавать решения, обеспечивающие отказоустойчивость систем Высшее техническое образование Желательно: Опыт проектирования межсервисных взаимодействий умение применять принципы реактивного программирования Стремление к максимальному покрытию кода тестами Опыт работы со Spring Validation, StateMachine, Swagger Знакомство с OpenShift и Istio Опыт работы по agile/scrum методологии Знание и умение работать с Jira и Confluence Понимание, как устроен бизнес глобальных рынков Условия: Официальное трудоустройство в Bell Integrator Конкурентная заработная плата (по итогам собеседования) Аккредитованная ИТ-компания Формат работы: удаленно Менторство Возможности карьерного роста и получения экспертизы в ведущих проектах страны Скидки на занятия фитнесом и собственное фитнес-приложение Скидки на занятия английским языком",
  "keywords" : [ ]
}, {
  "url" : "https://rabota.by/vacancy/109309885?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Иностранное унитарное предприятие Адмитад",
  "textContent" : "Мы ищем Senior DevOps Engineer. Обязанности: Разработка CI/CD решений; Активное участие в переходе сервисов на микросервисную архитектуру; Тесное сотрудничество с отделами разработки, тестирования; Поддержка и развитие инструментов мониторинга сервисов продукта; Автоматизация тестовой среды и задач поддержки производства. Требования: Опыт работы в должности DevOps-инженера не менее 2 лет; Опыт администрирования Linux (знание архитектур Debian, Ubuntu, Centos) не менее 2 лет; Опыт работы с платформами виртуализации (Vmware, KVM, Xen); Опыт работы с контейнерами (LXC, Docker,Containerd) не менее 1 года; Опыт работы на K8S (AWS, GCE, BareMetal) не менее 1 года; Навыки настройки сетевой инфраструктуры; CI/CD (предпочтительно Gitlab); Знание технологий: Web (nginx/php/python/gnodejs/o/ruby/java); Прометей/Grafana, Ansible/Terraform, bash/Python/Go; Опыт работы в проектах с высоким трафиком и понимание принципов отказоустойчивости и масштабируемости сервисов. Условия: Работа в международной компании; Гибридный формат работы (офис/домашний офис); Современный офисс; Корпоративное обучение - курсы и тренинги, встречи и конференции; Добровольное медицинское страхование после испытательного срока; Частичная компенсация расходов на посещение тренажерного зала; Корпоративные мероприятия и тимбилдинги.",
  "keywords" : [ "Ubuntu", "K8S", "GCE", "Go", "Prometheus", "Grafana", "DevOps", "Debian", "Linux", "Docker", "Terraform", "BareMetal", "Ansible", "CI/CD", "CentOS", "AWS", "Python" ]
}, {
  "url" : "https://rabota.by/vacancy/109429924?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Andersen",
  "textContent" : "Международная компания Andersen, один из лидеров рынка outsource production, проводит набор на стажировку по направлению Java с последующим трудоустройством в Беларуси (в офисе: Минск, Витебск, Полоцк, Гомель или Беларусь remote). Компания Andersen заинтересована в скором профессиональном развитии сотрудников и повышении их квалификации, готова инвестировать средства и время. Поэтому нашим конкурентным преимуществом считается быстрый рост, в отношении зарплат, в том числе. Требования: уровень знания английского языка Intermediate и выше; уровень знания немецкого языка Intermediate и выше будет плюсом; понимание принципов ООП, понимание алгоритмов и структур данных, знание Java Core; представление о реляционных базах данных (Oracle, MySQL, PostgreSQL и др.); опыт написания unit-тестов, знания систем контроля версий (git или svn), Spring Framework, а также ORM (Hibernate Framework); плюсом будет: знание основ Java EE (Servlets, jsp); наличие учебных/тестовых проектов в портфолио; знание, что такое Git и как с ним работать; коммуникабельность, мотивированность, высокая скорость усвоения новых знаний. Условия: теоретическое обучение: групповой интенсив; практика на учебном проекте по руководством опытных кураторов; контроль освоения знаний стажера и обратная связь; формат обучения: онлайн или в офисе; корпоративные курсы английского языка на базе офиса или онлайн; доступ к корпоративной программе внутреннего обучения (собственная образовательная платформа); участие в яркой корпоративной жизни компании. Стажер Andersen смело может рассчитывать на: высокий профессионализм менторов; бережное и внимательное отношение к себе в ходе обучения; помощь и поддержку в процессе обучения и при выходе на коммерческий проект после него; гарантированное трудоустройство при успешном прохождении обучения. Andersen - это отличная возможность старта и роста в сфере IT!",
  "keywords" : [ "Java EE", "Java Servlets", "Java", "Unit Testing", "Базы данных", "PostgreSQL", "JSP", "SVN", "ORACLE", "ООП", "Немецкий — B1 — Средний", "Git", "MySQL", "Spring Framework", "Hibernate ORM", "Немецкий язык", "Английский — B1 — Средний", "Английский язык", "Java Core" ]
}, {
  "url" : "https://rabota.by/vacancy/109433464?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Юзтех Бел",
  "textContent" : "IT-компания UseTech приглашает Middle+/Senior Android разработчика (Java/Kotlin) на проект нашего заказчика — инновационной компании, располагающей самыми современными технологиями для инвестирования и трейдинга. UseTech – оказывает полный спектр услуг в области заказной разработки ПО, независимого тестирования, ИТ-консалтинга, автоматизации, а также создании качественного продукта. Объединяет высококлассных профи: разработчиков, архитекторов, тестировщиков, бизнес-аналитиков и других специалистов. О задачах на проекте: Работа над продуктовыми задачами внутри фича-команд; Развитие интересных вам технических частей проекта; Проведение Code Review; Улучшение архитектуры и принятие технических решений вместе с командой; Участие в принятии решений процесса разработки. Что мы ожидаем от кандидата: От 4-5 лет опыта разработки Android приложений (коммерческого, не фриланс); Опыт работы в команде из 5+ разработчиков; Глубокое понимание Android SDK; Понимание Clean Architecture; Знание MV* паттернов, паттернов проектирования и архитектур; Понимание многомодульной архитектуры приложения; Умение писать Unit тесты; Опыт работы с Dagger2, RxJava, Coroutines, Navigation Component. Будет плюсом: Опыт работы с WebSockets; Опыт работы с Compose; Умение работы и настройки CI/CD; Понимание и опыт работы с Server Driven UI; Опыт написания UI и Snapshot тестов. Мы предлагаем: Работу в компании, которая много лет входит в топы самых престижных рейтингов – один из 25 лучших работодателей России 2020 по версии HeadHunter, 1-ое место в ежегодном рейтинге «Самые лояльные сотрудники 2020» от HeadHunter и 7 место рейтинга «Лидеры ИТ и Интернет индустрии России»; Трудоустройство – только официальное по ТК РБ и в штат компании; Гибкое утро (с 8 до 12 утра по Москве), рабочий график 5/2, гибкое сочетание офисной и удаленной работы; Полис медицинского страхования (ДМС + стоматология для сотрудников, скидки на страхование для членов семьи); Подарки, скидки и сертификаты для детей сотрудников; Оплата обучения и сертификаций; Регулярные внутренние семинары под эгидой Корпоративного Университета, посвященные новым технологиям и самым актуальным темам в области аналитики, разработки, тестирования, управления; Usetech English Club – обучение английскому с корпоративными скидками, разговорный клуб.",
  "keywords" : [ "Dagger2", "Coroutines", "RxJava", "Kotlin", "Android" ]
}, {
  "url" : "https://rabota.by/vacancy/109459473?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Andersen",
  "textContent" : "Международная компания Andersen, один из лидеров рынка outsource production, проводит набор на стажировку по направлению QA Manual с последующим трудоустройством в Беларуси (в офисе: Минск, Витебск, Гомель, Полоцк). Компания Andersen заинтересована в скором профессиональном развитии сотрудников и повышении их квалификации, готова инвестировать средства и время. Поэтому нашим конкурентным преимуществом считается быстрый рост, в отношении зарплат, в том числе. Требования: хорошие знания теории тестирования; если вас интересует бесплатное обучение Andersen \"AutoQA Java\", то укажите в отклике \"Обучение\"; знание английского или немецкого языка на уровне Intermediate и выше; понимание SQL; понимание работы WEB / Mobile приложений; опыт работы не обязателен. Условия: теоретическое обучение; практика на учебном проекте под руководством опытных кураторов; контроль освоения знаний стажера и обратная связь; формат обучения: в офисе; корпоративные курсы английского языка на базе офиса или онлайн; доступ к корпоративной программе внутреннего обучения (собственная образовательная платформа); участие в яркой корпоративной жизни компании. Стажер Andersen смело может рассчитывать на: высокий профессионализм менторов; бережное и внимательное отношение к себе в ходе обучения; помощь и поддержку в процессе обучения и при выходе на коммерческий проект после него; гарантированное трудоустройство при успешном прохождении обучения. Andersen - это отличная возможность старта и роста в сфере IT!",
  "keywords" : [ "QA", "Немецкий — B1 — Средний", "REST", "Ручное тестирование", "Test case", "Check-list", "SOAP", "Функциональное тестирование", "Английский — B1 — Средний", "SQL" ]
}, {
  "url" : "https://rabota.by/vacancy/109471686?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Бэлл Интегратор",
  "textContent" : "Формат работы: удалённо, РБ Компания: BELL INTEGRATOR BELL INTEGRATOR — крупный системный интегратор и аккредитованная ИТ-комания. В нашей команде более 2500 специалистов, включая аналитиков, руководителей проектов, разработчиков и тестировщиков, работающих над крупными информационными системами. Мы реализуем проекты по всей России для ведущих финансовых, телеком и ритейл компаний. Центральный офис находится в Москве, представительства — в Нижнем Новгороде, Пензе, Саратове, Уфе и Минске. Описание проекта: Мы — дружная команда с опытом в автоматизации тестирования. В рамках данного банковского проекта мы используем Java 15 и Maven для написания тестов. Ручным тестированием не занимаемся, что позволяет сосредоточиться на автоматизации. Предлагаем широкий выбор задач по различным проектам, включая API, веб-приложения, очереди сообщений (MQ) и базы данных (DB). Требования Опыт автоматизации тестирования от 3 лет. Знания в тестировании клиент-серверных приложений и/или API, WEB, MQ, DB. Умение работать с Java Stream API, функциональными интерфейсами и ООП. Опыт разработки тестовой документации (чек-листы, планы, отчеты и т. д.). Навыки поиска и предложения решений. Высокий уровень самоорганизации и хорошие коммуникативные навыки. Обязанности Разработка автотестов для API, WEB, MQ и DB на Java. Проверка технических заданий на полноту и непротиворечивость. Создание чек-листов в Xray. Учет дефектов и спорных моментов в Jira/Confluence. Разработка общих решений и участие в code review. Контроль исправления дефектов. Взаимодействие с аналитиками и разработчиками. Условия Конкурентная заработная плата. Корпоративное обучение и сертификация. Развлекательные мероприятия для сотрудников. Возможность удаленной работы. Если вы хотите стать частью команды, мы будем рады видеть вашу кандидатуру!",
  "keywords" : [ "Java" ]
}, {
  "url" : "https://rabota.by/vacancy/109482821?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Бэлл Интегратор",
  "textContent" : "BELL INTEGRATOR – крупный системный интегратор страны. Мы являемся аккредитованной ИТ– компанией. На текущий момент с нами работает более 2500 высококлассных аналитиков, руководителей проектов, разработчиков, тестировщиков и специалистов по сопровождению крупных информационных систем. Bell Integrator активно реализует проекты по всей России, среди наших заказчиков – ведущие системообразующие финансовые, телеком и ритейл компании страны. Центральный офис Bell Integrator расположен в Москве, представительства – в Нижнем Новгороде, Пензе, Саратове, Уфе, Минске (Беларусь). ПРОЕКТ: Создание системы сопровождения сделок глобальных рынков с ценными бумагами. Решение позволит сотрудникам максимально автоматизировано: • подтверждать условия сделок с контрагентами • проводить расчёты по сделкам (перемещение денег и ценных бумаг) • контролировать исполнение обязательств • оценивать справедливую стоимость • вести учёт ц. бумаг в разрезе мест хранения Решение строится на собственной платформе банка, что позволяет пользоваться готовыми сервисами/библиотеками, однако выбор реализации остаётся за командой. СТЕК: Java 11, Kafka, PostgreSQL, OpenShift, Spring Boot, React (Typescript), микросервисная архитектура, cloud native подход, интеграция с 20+ различными системами в периметре банка и за его пределами. ЧТО МЫ ОЖИДАЕМ ОТ КАНДИДАТОВ: Специалист по Java 8+, Spring Boot. Опыт более 4 лет в разработке систем промышленного уровня на Java. Опыт более 1 год в роли тимлида разработки. Опыт правильного применения шаблонов проектирования ПО. Опыт разработки микросервисов. Знание протоколов, форматов и технологий HTTP, REST, GRPC, JSON, XML, XSD. Способность создавать решения, обеспечивающие отказоустойчивость систем. Высшее техническое образование. БУДЕТ ПЛЮСОМ: Опыт проектирования межсервисных взаимодействий. Умение применять принципы реактивного программирования. Стремление к максимальному покрытию кода тестами. Опыт работы со Spring Validation, StateMachine, Swagger. Знакомство с OpenShift и Istio. Опыт работы по agile/scrum методологии. Знание и умение работать с Jira и Confluence. Понимание, как устроен бизнес глобальных рынков. ЧЕМ ПРЕДСТОИТ ЗАНИМАТЬСЯ: Разработка бизнес и интеграционной логики. Проектирование технических решений. Подготовка к внедрению. Рецензирование кода, дизайна решения, документации. Написание модульных и интеграционных тестов. МЫ ПРЕДЛАГАЕМ: Возможность участия в интересных проектах. Возможность профессионального и карьерного роста в компании. Опыт работы в команде профессионалов. Уровень заработной платы обсуждается индивидуально. Специальные тарифы для сотрудников в спортивные клубы и языковые курсы и пр. Удаленный формат работы.",
  "keywords" : [ "Java", "Kafka", "Spring Boot" ]
}, {
  "url" : "https://rabota.by/vacancy/109614892?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "СИСТЕМНЫЕ ТЕХНОЛОГИИ",
  "textContent" : "Приглашаем в нашу команду Junior+ QA Automation Engineer. Проект: интернет-банкинг для юридических лиц (веб-приложение). На проекте написаны тестовые сценарии, которые необходимо автоматизировать. В дальнейшем возможно подключение на другие проекты компании. Вас ожидает: Работа по автоматизации тестирования web и API. Разбор результатов автотестов. Поддержание автотестов в актуальном состоянии. Какие навыки пригодятся? Коммерческий опыт работы AQA engineer от 6 месяцев. Понимание жизненного цикла разработки ПО. Знание видов и процессов тестирования ПО. Базовые знания языка программирования Java. Опыт работы с БД, навыки написания базовых SQL запросов. Практические навыки использования Git. Умение тестировать API с использованием Postman. Навыки автоматизации тестирования API c помощью Java и использования REST Assured. Умение использовать Maven/TestNG/Allure. Базовые навыки использования Jenkins/Gitlab CI/TeamCity. Знание формата обмена данными JSON/XML. Будет плюсом: Опыт ручного тестирования. Что вам даст работа в нашей компании? Работа в большой ИТ компании с грамотно выстроенными процессами, которые дают прозрачность работы. Сплоченный коллектив, который уже на протяжении нескольких лет работает над сложными задачами. На время адаптационного периода у вас будет ментор, который поможет вам быстро адаптироваться в задачах, команде и проекте. Расширенный социальный пакет, о котором мы расскажем вам на встрече :)",
  "keywords" : [ "Jenkins", "QA", "Java", "Maven", "Git", "Junior", "XML", "JSON API", "QA auto", "Postman", "SQL" ],
  "address" : "Минск, улица Академика Купревича, 3"
}, {
  "url" : "https://rabota.by/vacancy/109647019?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО НитСофт",
  "textContent" : "NeatSoft - IT-компания, специализирующаяся на разработке веб- и мобильных приложений с 2016 года. Мы работаем с клиентами из различных стран мира и успешно реализовали проекты в странах СНГ и Западной Европы. Наши проекты включают как продуктовую разработку (например, logtime.me и mybase.pro), так и аутсорсинг разработки. Работаем с такими технологиями как: Angular; React; VueJS; NodeJS; NestJS; Yii2; Laravel; DevOps Tools; Flutter, Java, Python. Мы находимся в постоянном развитии и ищем Node.js developer для нашей команды. Что мы ожидаем: Отличное знание Node.js, понимание масштабирования и узких мест Отличное знание TypeScript Опыт работы с БД (SQL, noSQL) Умение писать unit-тесты (Jest) Знание принципов построения надежной архитектуры и паттернов проектирования Опыт работы по Scrum Будет плюсом: Опыт коммерческой разработки на Node.js от 1 года. Знание и опыт работы с Angular/React. Понимание принципов построения SPA. Опыт работы с GraphQL. Опыт работы с WebSocket. Ценные для нас навыки: Хорошо развитые коммуникативные и аналитические способности. Умение работать в команде (предлагать и обсуждать идеи, аргументировать свою позицию, слушать и понимать людей, договариваться). Английский язык уровня B2 и выше. Мы предлагаем: Дружественную и уютную атмосферу, удобное расположение офиса. Комфортное рабочее место с чаем, кофе и печеньем. Нескучные задачи без бюрократии и формализма. Заработную плату, привязанную к курсу USD. Гибкий график работы с плавающим началом рабочего дня. Бонусы и премии по результатам работы и значимым событиям. Если вы заинтересованы в этой вакансии и соответствуете указанным требованиям, мы будем рады видеть вас в нашей команде!",
  "keywords" : [ "TypeScript", "Backend", "Unit Testing", "PostgreSQL", "MySQL", "Node.js", "Scrum", "Английский — B1 — Средний", "SQL", "Английский язык" ],
  "address" : "Минск, Грушевка, Михалово, Петровщина, улица Карла Либкнехта, 66"
}, {
  "url" : "https://rabota.by/vacancy/109731203?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Белорусские облачные технологии",
  "textContent" : "Обязанности: разработка программного обеспечения (далее – ПО) в соответствии с поставленными задачами; тестирование, отладка разработанного ПО, доработка ПО при уточнении требований к ПО; интеграция программных компонентов; администрирование и модернизация разработанного ПО; документирование исходного кода на основе комментариев; понимание процессов взаимодействия ПО с задействованными системами и умение объяснять данные процессы техническому писателю для создания пользовательской документации; написание документации для разработчика; Требования к соискателю: опыт коммерческой разработки от 6 мес.; опыт и понимание работы CRM систем; Опыт работы со следующими технологиями: -java; -groovy; -bitrix; -базы данных (PostgreSQL); -написание SQL запросов; - linux; знание архитектурных принципов построения информационных систем: понимание микросервисной архитектуры; понимание различных видов интеграций систем, в том числе асинхронных, очередей задач; понимание архитектуры REST и принципов построения RESTful-сервисов; понимание форматов XML, JSON; Будет «плюсом»: опыт работы с Docker, Git; опыт работы с БД (PostgreSQL); опыт работы с консолью разработчика в браузере; опыт в разработке либо интеграции с CRM-системами; создание документации к написанному ПО; способность доносить мысли (устно и письменно) простым доступным языком; аналитическое мышление, умение анализировать большие данные и делать выводы. Условия: работа в центре города; официальное трудоустройство; добровольное медицинское страхование; оплачиваемый ФОК; оплата мобильной связи; официальная стабильная заработная плата; бонусы по результатам работы; возможности для профессионального роста (обучение и тренинги, корпоративный английский); хорошо оборудованное рабочее место.",
  "keywords" : [ "Java", "restful", "1С-Битрикс", "PostgreSQL", "JSON", "Groovy", "WSL", "REST", "Git", "Docker", "Linux", "XML", "Python", "CRM" ],
  "address" : "Минск, улица Клары Цеткин, 24"
}, {
  "url" : "https://rabota.by/vacancy/109754327?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Бэлл Интегратор",
  "textContent" : "Bell Integrator – один из ведущих системных интеграторов страны. Мы аккредитованная ИТ-компания и являемся частью большой семьи ГК Softline. Bell Integrator активно реализует проекты по всей России, среди наших заказчиков – крупнейшие системообразующие финансовые, телеком и ритейл компании страны. Формат работы: удалённо с территории Беларуси, России, Казахстана. Проект: Универсальный клиентский фронт. На текущий момент у компании есть ряд приложений - Мир Инвестиций, Капитал, локальное приложение для ЮАР (brokstock) и тд. В планах выход на новые рынки. Отсюда потребность быстрого выхода на новые рынки (подразумевается работа с клиентами других стран). У каждого рынка свой бэк, с которым необходимо интегрироваться, свои требования по реализации согласно местному законодательству, особенностям учета и ведения документов и тд. Самый простой вариант – написание каждый раз нового мобильного приложения. Однако это связано для компании с большими временными и финансовыми затратами, а также необходимостью поддержки и развития всей линейки приложений. Принято решение о создании универсальной платформы клиентского фронта, которую можно будет быстро дорабатывать и кастомизировать под новые регионы. Платформа создается как green field, с учетом наработок существующих приложений. В состав системы входят базовые приложения под iOS и Android, веб-интерфейс админки, сама микросервисная платформа. Требования: Глубокое знание Java core Знание принципов ООП и понимание паттернов проектирования Опыт разработки систем в парадигме микросервисной архитектуры. Опыт работы с Camunda Опыт работы со Spring Framework (Spring boot, Spring Cloud) Опыт работы с брокерами сообщений (Kafka) Опыт работы с PostgreSQL Опыт работы с Junit или другим фреймворком для тестов Хорошее понимание принципов Agile разработки Умение читать чужой код, делать ревью Опыт в финтех проектах Желательные требования: Понимание технологий DevOps Опыт работы с Docker, Kubernetes Опыт работы в территориально распределенных командах Условия: Конкурентоспособная заработная плата Корпоративное обучение и сертификацию в технических и бизнес областях Корпоративные развлекательные программы Помощь при релокации Формат работы удаленный на территории РФ, РБ, Казахстана",
  "keywords" : [ ]
}, {
  "url" : "https://rabota.by/vacancy/109769473?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Бэлл Интегратор",
  "textContent" : "Обязанности: Разработка клиентской и серверной части ПО на проекте. Разработка Bdd-тестов, микросервисов Требования: Опыт разработки в Delphi от 3 лет Умение писать надежный и понятный код Знание и опыт работы с Windows API Знания и опыт в разработке низкоуровневых и многопоточному высоконагруженных и распределённых систем. Навыки разработки клиент-серверных приложений Понимание архитектуры СУБД Oracle, ее особенностей; Опыт работы с большими базами данных; Навыки проектирования реляционных баз данных; Хорошее знание языка программирования PL/SQL; Опыт оптимизации сложных SQL запросов; Будет плюсом: • Знания и опыт разработки на Java с использованием Spring Framework. • Опыт работы в депозитарной деятельности Условия: Возможность профессионального и карьерного роста в компании, возможность поучаствовать в разных проектах; Опыт работы в распределенной команде профессионалов; Уровень заработной платы обсуждается индивидуально; Возможность работать удаленно на территории РФ и Беларуси.",
  "keywords" : [ "Delphi", "ORACLE" ]
}, {
  "url" : "https://rabota.by/vacancy/109827446?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ОАО ИнДев Солюшенс",
  "textContent" : "InDev Solutions - яркая и амбициозная ИТ-команда крутых профессионалов. Миссия нашей компании: “Опираясь на лучшие стандарты и опыт, мы развиваемся вместе с нашими партнерами, стараясь опережать их запросы и ожидания”. Девиз нашей компании - “Совершенство через технологии”, предлагаем присоединиться к нам и совершенствоваться вместе! Мы разрабатываем сложные, интересные и неординарные проекты в сфере здравоохранения, страхования, образования и не только. На текущий момент мы ищем в команду талантливого и перспективного Flutter developer (Middle) на полную занятость в наш уютный офис. Также открыта позиция Flutter developer (Junior+). Мы ожидаем от Вас опыт работы на аналогичной позиции, а также: знания Dart и Flutter, опыт от года в коммерческой разработке; уверенные знания ООП, понимание основных шаблонов проектирования и SOLID; опыт работы и понимание BLoC / Provider / Riverpod; опыт работы с нативным кодом (Java/Kotlin и Swift/ObjectiveC); опыт написания Unit-тестов; опыт написания Flutter Plugins (будет плюсом). Мы предлагаем: официальное оформление с первого рабочего дня (испытательный срок 3 месяца); крутую команду с компетентными, креативными и веселыми коллегами; достойную белую заработную плату; трудовой отпуск 28 календарных дней и 3 sick days в году; комфортабельные офисы в самом центре Минска (метро Институт культуры и метро пл. Ф. Богушевича); возможность прохождения обучения за счет компании; добровольное медицинское страхование (после прохождения испытательного срока); материальная компенсация занятий спортом (до 150 бел. рублей в месяц) и культурно-массовых мероприятий (до 150 бел. рублей в месяц) после прохождения испытательного срока; регулярные корпоративные праздники, мероприятия и приятные подарки от компании. Будем рады видеть тебя в нашей дружной команде!",
  "keywords" : [ ]
}, {
  "url" : "https://rabota.by/vacancy/109877762?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО НитСофт",
  "textContent" : "NeatSoft - IT-компания, специализирующаяся на разработке веб- и мобильных приложений с 2016 года. Мы работаем с клиентами из различных стран мира и успешно реализовали проекты в странах СНГ и Западной Европы. Наши проекты включают как продуктовую разработку (например, logtime.me и mybase.pro), так и аутсорсинг разработки. Работаем с такими технологиями как: Angular; React; VueJS; NodeJS; NestJS; Yii2; Laravel; DevOps Tools; Flutter, Java. Мы находимся в постоянном развитии и ищем Vue.js developer для нашей команды. Что мы ожидаем: Знание и опыт разработки на Vue. Отличные знания JavaScript, HTML, CSS, SCSS (HTML5, CSS3). Уверенные знания TypeScript. Умение работать с REST API и другими веб-сервисами. Понимание ООП и основных паттернов проектирования (SOLID, DRY, KISS и т.д.). Опыт работы с Git, продуктами Atlassian (Jira). Базовые навыки использования Docker, сред контейнеризации. Будет плюсом: Опыт коммерческой разработки на Vue.js от 1 года. Знание и опыт работы с Angular/React. Опыт работы с базами данных, включая SQL и NoSQL. Знание и опыт работы с XML. Опыт работы с Vuex и Vue Router. Понимание принципов построения SPA. Опыт написания тестов с использованием Jest или Mocha. Знание и опыт работы с WebSocket и GraphQL. Ценные для нас навыки: Хорошо развитые коммуникативные и аналитические способности. Умение работать в команде и брать на себя ответственность. Английский язык уровня B2 и выше. Мы предлагаем: Дружественную и уютную атмосферу, удобное расположение офиса. Комфортное рабочее место с чаем, кофе и печеньем. Нескучные задачи без бюрократии и формализма. Заработную плату, привязанную к курсу USD. Гибкий график работы с плавающим началом рабочего дня. Бонусы и премии по результатам работы и значимым событиям. Если вы заинтересованы в этой вакансии и соответствуете указанным требованиям, мы будем рады видеть вас в нашей команде!",
  "keywords" : [ "TypeScript", "Vue.js", "Git", "JavaScript", "Vue", "React", "Английский — B2 — Средне-продвинутый", "Angular", "Английский язык" ],
  "address" : "Минск, Грушевка, Михалово, Петровщина, улица Карла Либкнехта, 66"
}, {
  "url" : "https://rabota.by/vacancy/110022044?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Бэлл Интегратор",
  "textContent" : "Удаленный формат работы Bell Integrator – аккредитованная ИТ-компания и являемся частью большой семьи ГК Softline. Bell Integrator активно реализует проекты по всей России, среди наших заказчиков – крупнейшие системообразующие финансовые, телеком и ритейл компании страны. Банковский проект. Требования Опыт работы в автоматизации тестирования от 3-х лет Опыт в автоматизации тестирования клиент-серверных приложений (и/или - API, WEB, MQ, DB) Знание Java stream api + functional interfaces + модификаторы +- реализация ООП концепций Опыт разработки тестовой документации (чек-листы, планы, отчеты и тому подобное) Умение находить/формулировать/предлагать решения Высокий уровень самоорганизации и коммуникативные навыки Обязанности Разработка API, WEB, MQ, DB автотестов на Java Тестирование ТЗ на разработку (полнота, непротиворечивость и т.п.) Разработка чек-листов по требованиям (xray) Фиксация дефектов, не проработанных/спорных моментов в Jira/Confluence Разработка вспомогательных общих решений + code review Заведение и контроль исправления дефектов Взаимодействие с командой аналитиков и разработчиков",
  "keywords" : [ "Java", "MQ", "WEB", "API", "Автоматизированное тестирование", "DB" ]
}, {
  "url" : "https://rabota.by/vacancy/110036883?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО GRYMALA / ГРЫМАЛА",
  "textContent" : "Привет! Мы - продуктовая компания Grymala. Занимаемся разработкой собственных мобильных приложений из категории утилиты - измерения с помощью технологий дополненной реальности, компьютерного зрения, машинного обучения и 3D графики. Наши Android-приложения (AR Plan 3D, AR Ruler, Ruler App) завоевали лидерство в своей категории с общим количеством скачиваний > 50 млн. Любить своё дело, стремиться к высоким стандартам качества, быть приверженными инновациям, постоянно изучать новое, развиваться и испытывать азарт перед амбициозными задачами - это наш lifestyle. Сейчас команда Grymala нуждается в опытном и увлеченном Android Developer, уровня Strong Middle. Чем предстоит заниматься: Разработка мобильных AR приложений под платформу Android Решение широкого спектра задач по существующим приложениям - новая функциональность, имплементация UI / UX улучшений, багофикс Активное развитие в технологиях из области интереса компании: AR / AI / CV / HPC / 3D Graphics / Algorithms / Custom UI solutions Применение современных техник программирования под Андроид Эффективное взаимодействие с командой Наши ожидания: Опыт коммерческой разработки Android приложений от 3-х лет Математический майндсет, навыки алгоритмического мышления Уверенные знания Java, Kotlin и Android SDK. Понимание алгоритмов и структур данных Опыт работы с Jetpack compose, Jetpack architecture Глубокое знание Java Memory Model и Garbage Collector Опыт работы с многопоточностью и асинхронностью: знание Coroutines, Handler, Looper, Thread и Executor Знание паттернов проектирования Знание Git, Jira, Confluence Интерес к современным технологиям из области интереса компании и Android разработки, владение современными техниками программирования под Android (в том числе такими инструментами на базе Generative AI, как ChatGPT, copilot) Вовлеченность в продукты компании Смелость и азарт перед сложными задачами, умение реализовывать нестандартные элементы UI, анимации и мультитач Способность работать самостоятельно и оценивать время для выполнения задач Будет большим плюсом: Знание ARCore и опыт написания приложений, использующих дополненную реальность Знание OpenGL / Vulkan Интерес и знакомство с основами- и более продвинутыми темами из области 3D компьютерной графикой, компьютерного зрения (CV), анимаций 2D и 3D, высоконагруженных вычислений Наличие технического / математического образования, побед и призовых мест по профильным предметным олимпиадам (программирование / математика / физика) Мы предлагаем: Работу в компании, разрабатывающей инновационный продукт Возможность развиваться и проявить себя Открытых и профессиональных коллег Семейную атмосферу и лояльный менеджмент Гибкий график и творческую рабочую атмосферу Мы слышим и понимаем наших сотрудников, внимательны к пожеланиям и предложениям. Развитие и комфорт для каждого - вот что нам важно!",
  "keywords" : [ "3D Graphics", "High Performance Computing (HPC)", "Java", "Augmented Reality (AR)", "Java Memory Model", "Custom UI / UX", "Jetpack architecture", "Asynchrony", "Kotlin", "Artificial Intelligence (AI)", "Multithreading", "Garbage Collector", "Android SDK", "Computer Vision (CV)", "Jetpack compose" ],
  "address" : "Минск, Молодежная, Площадь Ленина, улица Карла Либкнехта, 66"
}, {
  "url" : "https://rabota.by/vacancy/110046565?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО КОУДКЭЙВ ПРО",
  "textContent" : "Requirements: at least 2 years of ASP.NET Core WebAPI backend development experience at least 2 years of experience with React, Vue.js, Angular or Blazor at least 1 year of working with UI toolkit such as Tailwind, Foundation, Material, Bootstrap etc a good understanding of Component-Based Design commercial experience with SQL and relational DBs (PostgreSQL/MySQL/MS SQL) commercial experience with no-SQL databases (MongoDB, CosmosDB, Cassandra) designing and consuming RESTful API strong understanding of HTTP protocol (caching, compression etc) Git (GitHub) and basic GitFlow Familiarity with JIRA, CI/CD tools Experience in server-side events and/or WebSockets and/or SignalR Nice to have (optional): Experience in WebRTC (Jitsi, Twilio etc) and/or video streaming is a huge plus Experience in Unity WebGL or Three.js or Babylon.js is a huge plus Experience in Google Cloud or Azure is a huge plus Docker and Docker Compose exposure Soft skills: ☺️ Willingness to work in an Agile environment ☺️ Strong communication and analytical skills ☺️ Knowledge in software development patterns and key principles of software development Benefits: Corporate English (50% is paid by the company) Competitive compensation and bonus days of paid time off Flexible work hours Team of professionals providing you with the opportunity to grow Corporate library",
  "salary" : "от 800 до 1 200 $ на руки",
  "keywords" : [ "C#", "Unit Testing", "Design Patterns", "REST API", "TDD", "JavaScript", "Java Script", ".NET", "PHP", "Entity Framework", "React.js", "Английский — B2 — Средне-продвинутый", ".NET Core", "Английский язык", "Azure", "MS Visual Studio", "React", "SQL", "RabbitMQ", "Vue.js", "Backend", "Git", "СУБД", "ASP.NET Core", "Atlassian Jira", "ASP.NET", "API", "MongoDB", "Разработка ПО" ],
  "address" : "Минск, Немига, Октябрьская, Интернациональная улица, 25А"
}, {
  "url" : "https://rabota.by/vacancy/110058480?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Бэлл Интегратор",
  "textContent" : "Проект: создание системы сопровождения сделок глобальных рынков с ценными бумагами. Решение позволит сотрудникам максимально автоматизировано • подтверждать условия сделок с контрагентами • проводить расчёты по сделкам (перемещение денег и ценных бумаг) • контролировать исполнение обязательств • оценивать справедливую стоимость • вести учёт ц. бумаг в разрезе мест хранения Проект по построению бэк-офисной и учётной инфраструктуру для торговли ценно-бумажными продуктами (сделки купли/продажи акций/облигаций, РЕПО etc,). Команда состоит из аналитиков, разработчиков, тестировщиков, DevOps. Инфраструктура создается с нуля силами проектных agile-команд на cloud-native платформе банка и плотно интегрируется в информационную инфраструктуру банка, планируется интеграции более чем с 20 целевыми АС Банка в том числе выгрузка данных в облако. Стек: Java 11, Kafka, PostgreSQL, OpenShift, Spring Boot, React (Typescript), микросервисная архитектура, cloud native подход, интеграция с 20+ различными системами в периметре банка и за его пределами Требования: Специалист по Java 8+, Spring Boot Опыт более 4 лет в разработке систем промышленного уровня на Java Опыт более 1 год в роли тимлида разработки Опыт правильного применения шаблонов проектирования ПО Опыт разработки микросервисов Знание протоколов, форматов и технологий HTTP, REST, GRPC, JSON, XML, XSD Способность создавать решения, обеспечивающие отказоустойчивость систем Высшее техническое образование Желательно: Опыт проектирования межсервисных взаимодействий умение применять принципы реактивного программирования Стремление к максимальному покрытию кода тестами Опыт работы со Spring Validation, StateMachine, Swagger Знакомство с OpenShift и Istio Опыт работы по agile/scrum методологии Знание и умение работать с Jira и Confluence Понимание, как устроен бизнес глобальных рынков Обязанности: Разработка бизнес и интеграционной логики Проектирование технических решений Подготовка к внедрению Рецензирование кода, дизайна решения, документации Написание модульных и интеграционных тестов Условия: Официальное трудоустройство в Bell Integrator Конкурентная заработная плата (по итогам собеседования) Аккредитованная ИТ-компания Формат работы: удаленно Менторство Возможности карьерного роста и получения экспертизы в ведущих проектах страны Скидки на занятия фитнесом и собственное фитнес-приложение Скидки на занятия английским языком",
  "keywords" : [ "Java" ]
}, {
  "url" : "https://rabota.by/vacancy/110123601?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "IDF Technology",
  "textContent" : "IDF Technology – успешная IT-компания, специализирующаяся на кредитном скоринге, Data Science и финансовых цифровых технологиях. И мы приглашаем DevOps стать частью нашей компании! Задачи: построение CI/CD; автоматизация развертывания и настройка окружения; работа с дата-центрами (Selectel, Aws, DO); администрирование оборудования и ПО виртуальных и реальных сред, тестирование и программный тюнинг серверных платформ; предупреждение сбоев, оперативное реагирование на инциденты, способные привести к остановке работы сервисов; поддержка и развитие IT-инфраструктуры офиса разработчиков и удаленных специалистов; организация противодействия DoS/DDoS-атакам (использование механизмов дата-центра и собственных наработок). Чего мы ждем от вас: Уверенные знания OS Linux; Понимание DevOps lifecycle, основных концепций (СI/CD, CM, IaC); Опыт с Jenkins, Jenkins declarative pipelines обязателен и/или с GitLab Ci; Опыт сборки и траблшутинга Java приложений (Gradle + Maven); Опыт с Docker обязателен (траблшутинг, написание Dockerfiles и docker-compose); Знание хотя бы одного из CM инструментов (Chef или Ansible); Опыт написания скриптов на Bash, Python; Опыт работы с Nomad и Consul. Условия: Заработная плата, привязанная к курсу валют; Годовой бонус; Оплата участия в профильных конференциях, митапах и т.д.; Компенсация занятий иностранным языком и спортом; ДМС после испытательного; Режим работы, уважающий биоритмы каждого отдельного сотрудника; Отпуск 28 дней + 5 sick days; Адекватный менеджмент, отсутствие бюрократии; сильная и действительно дружная команда; Весёлая корпоративная жизнь (тимбилдинги, мероприятия и корп.подарки).",
  "keywords" : [ ],
  "address" : "Минск, Интернациональная улица, 36"
}, {
  "url" : "https://rabota.by/vacancy/110144675?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО ВЭБ Технологии",
  "textContent" : "We are looking for Java Developer Lead to expand our team and to work on Fintech and other external projects. Stack: Java 17+, Spring-Boot, Spring JPA, Spring Security, Cloud, K8S, Helm, GitLab AutoDevOps, Redis, PostgreSQL, JUnit, Mockito, Wiremock, Spock, Pact, Prometheus, Grafana. What will you do: Develop new features and keep existing application healthy; Migrate functionality from legacy applications to new one; Maintain team technical expertise and performance in green area. Experience needed: Minimum 5 years of relevant work experience (as Java Developer); Solid experience with Spring Framework; Hands on experience in development functionality accompanied by unit tests, integration tests, etc; Proficient in Object Oriented Analysis and Design; Familiar with RDBMS including ORM, SQL; Extensive experience in building either SOA applications or system integrated with many 3-rd party dependencies via RESTful API; Extensive experience in building production ready microservice solutions. Will be a plus: Ability to read React and .net code; Ability to justify decisions for non-technical people; Ability to mentor teammates and keep their personal development plans synchronized with strategic project needs. Focus on result. Any activity starts from definition of success or definition of done. Education activities, proof of concepts development, research tasks, all have to converge to tangible result Open-minded but have healthy level of critical thinking. E.g. following common 4 questions every time making a decision regarding new technology/tool/approach: What is the power of technology? What limitations does the technology diminish? What rules enable us to manage this limitation? What new rules will be need? Understand a power of team work. Team work means: using advantage of expertise of many individuals that accelerates solving tricky problems; knowledge sharing, more valuable comments on solution/technology assessing session, etc We offer: Extended social package (medical insurance, significant events benefits, corporate English teachers); Decent salary; Sick leave is paid according to the Laws of Belarus; 29 days of vacation; Possibility to work remotely; Payment for external trainings, seminars, conferences; Office in the center of Minsk (Molodezhnaya station); Small office rooms, not open space.",
  "keywords" : [ ],
  "address" : "Минск, Молодежная, улица Скрыганова, 6/3"
}, {
  "url" : "https://rabota.by/vacancy/110253856?query=java&hhtmFrom=vacancy_search_list",
  "textContent" : "",
  "keywords" : [ ]
}, {
  "url" : "https://rabota.by/vacancy/110453759?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Бэлл Интегратор",
  "textContent" : "BELL INTEGRATOR – крупный системный интегратор страны. Мы являемся аккредитованной ИТ– компанией. На текущий момент с нами работает более 2500 высококлассных аналитиков, руководителей проектов, разработчиков, тестировщиков и специалистов по сопровождению крупных информационных систем. Bell Integrator активно реализует проекты по всей России, среди наших заказчиков – ведущие системообразующие финансовые, телеком и ритейл компании страны. Центральный офис Bell Integrator расположен в Москве, представительства – в Нижнем Новгороде, Пензе, Саратове, Уфе, Минске (Беларусь). ПРОЕКТ: Ищем опытного архитектора, за плечами которого есть успешные проекты трансформации SDLC от ручных сборок и поставок, до полностью автоматизированного конвейера с внедрением IaC, CI/CD, DevSecOps и т.п, понимающий какие метрики и Quality Gates необходимо разработать и внедрить для постоянного развития процессов. Ожидаем, что кандидат будет лидером внедрения DevOps-практик и повышения DevOps Maturity для систем Банка в продуктовых командах и командах разработки систем Банка. Стек: Bitbucket, Jira, Confluence, HPSM vSphere, Tanzu, Kubernetes, ArgoCD Grafana, Prometheus, Alertmanager, ELK, FluentBit Nginx, Istio, Kyverno, Trivy, HashiCorp Vault Java, Jenkins, Kaniko, Artifactory, Keycloak Git, Terraform, Ansible ЧТО МЫ ОЖИДАЕМ ОТ КАНДИДАТА: Широкий кругозор в ИТ инфраструктуре. Понимание тенденций российского рынка ИТ. Знание Kubernetes на высоком уровне. Экспертные знания Linux. Глубокое понимание работы сетей. Знание одного из языков программирования (bash, python, go и т.п.). Понимание принципов реализации платформ виртуализации. Понимание принципов построения отказоустойчивых и высокодоступных систем. Понимание принципов построения облачной инфраструктуры (IaaS/PaaS/SaaS-решений). Продвинутые знания в области информационной безопасности (контейнеров в частности). Желательно высшее техническое образование. Английский на уровне чтения документации, кода. Какой опыт нам интересен: Реализация CI/CD для сложных распределённых приложений с использованием подхода Infrastructure as a Code. Работа в качестве Senior DevOps / DevSecOps. Сопровождение больших промышленных инсталляций Kubernetes. Администрирование большого парка Linux-машин. Внедрение системам мониторинга, логирования, трейсинга, оповещения. Проектирование и сопровождение высокодоступных решений. ЧЕМ ПРЕДСТОИТ ЗАНИМАТЬСЯ: Участвовать в развитии процесса разработки ПО (SDLC). Отслеживать тенденций рынка комплексных решений для разработки ПО. Проводить исследования, анализ, выбор и пилотирование новых решений. Разрабатывать архитектуру для новых решений, презентовать, защищать, делать оценку трудоемкости. Делать расчёт необходимой инфраструктуры и формулировать системные требования под новые решения. Вести документацию по новым решениям (схемы, инструкции по развертыванию, руководства для команды поддержки). Интегрировать новые решения в существующий CI/CD- процесс. Писать планы для трансформации текущих решений. Писать гайдлайны для SDLC-процесса и DevOps-практик. Проводить воркшопы и презентации по новым решениям и подходам. Участвовать в решении проблем как 3-я линия поддержки. Внедрять инструменты автоматизации развертывания окружений. Взаимодействовать с командами разработки, для выстраивания CI/CD - процессов и по вопросам контейнеризация приложений. МЫ ПРЕДЛАГАЕМ: Возможность участия в интересных проектах. Возможность профессионального и карьерного роста в компании. Опыт работы в команде профессионалов. Уровень заработной платы обсуждается индивидуально. Специальные тарифы для сотрудников в спортивные клубы и языковые курсы. Удаленный формат работы.",
  "keywords" : [ "Архитектура", "DevOps", "Linux", "CI/CD" ]
}, {
  "url" : "https://rabota.by/vacancy/110611001?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Scand",
  "textContent" : "Scand Ltd. is looking for a creative and initiative Marketing Manager. SCAND Ltd. is an software development company, with offices in Warsaw, Poland and Minsk, Belarus. The company is focused on custom software development outsourcing across multiple technologies including .NET, Java, PHP, JavaScript, and C++. With more than 20+ years in IT and 700 successful projects for dozens of customers globally and over 250 highly experienced engineers on board, we are rated as one of the top software outsourcing companies in Eastern Europe. Responsibilities: Participation in the digital strategy development and its implementation across various marketing channels; Generating new ideas on how to increase conversions; Research on new lead generation channels; Market analysis, competitive analysis, building hypotheses, A/B testing; Proofreading and writing articles on various IT and business topics; Content distribution and e-mail outreach campaigns; Managing social media campaigns (LinkedIn, Facebook, Twitter); Supporting corporate websites (content development, copywriting, corporate blogging).. Requirements: Advanced English (perfect content writing skills); Experience in IT sphere; Experience in using CMS; Basic knowledge in SEO, Google Analytics, Semrush; Experience in using email marketing tools (BuzzStream, Mailchimp, etc). German would be a plus; Team-oriented, creative and positive thinking person with analytical skills. What we offer: Official employment; Possibility of working remotely; Stable decent salary; Health insurance; English courses; 29-day paid vacation; Friendly team, loyalty and understanding; Interesting festivals and events, active recreation with colleagues; Sport support (swimming pool, gym, etc.); Free seasonal flu vaccine; Auto and bicycle parking (+ shower cabins for cyclists); Comfortable office in convenient proximity to the city center (underground station “Institute of Culture”).",
  "keywords" : [ "Mailchimp", "Маркетинг", "CMS", "Маркетолог", "A/B testing", "SEO", "Английский — B1 — Средний", "Marketing", "Английский язык" ]
}, {
  "url" : "https://rabota.by/vacancy/110639696?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Марк Формэль",
  "textContent" : "Приглашаем в команду профессионалов Опытного руководителя IT подразделения/ IT директор. Обязанности: Обеспечение эффективности всех информационно-технологических процессов компании; Определение и реализация стратегии развития IT с учётом требований бизнеса; Руководство персоналом - подбор и расстановка кадров, постановка задач, контроль исполнения; Разработка плана мероприятий по автоматизации производства, розницы, онлайн; Бюджетирование и контроль за соблюдением бюджета; Обеспечение полного цикла разработки продуктов компании (анализ, оценка, проектирование, разработка, тестирование, сдача в коммерческую эксплуатацию, поддержка); Управление несколькими продуктами в стадии реализации; Ответственность за информационную безопасность; Сопровождение IT проектов (собственных и внешних), интеграционных проектов, проектов автоматизации, проектов по большим данным; обеспечение стабильной и бесперебойной работы IT-систем, компьютерного и сетевого оборудования, поддержки пользователей; эффективное взаимодействие с подрядчиками и с внутренними заказчиками. Требования: высшее образование, желательно техническое; знание процессов розничной и оптовой торговли, в т.ч. маркетплейсов; стаж работы от 3 лет на должности IT-директора в крупной успешной и структурированной компании, желательно сферы розничной торговли/электронной коммерции; знание современных методик и практик IT-деятельности; знание современных технологий и архитектур; опыт автоматизации процессов; опыт управления крупными IT-проектами, проектами по большим данным, e-commerce, web-разработками; опыт работы с java, 1С и Битрикс; знание любой из конфигураций 1С УХ, ERP, УПП, УТ, Бухгалтерия; системное мышление, широкий профессиональный кругозор; стрессоустойчивость, работоспособность, сильные управленческие навыки; хорошие коммуникативные навыки и умение эффективно взаимодействовать в команде. Условия: Оформление в соответствии с ТК РБ, социальные гарантии Современный офис в г. Заславль Достойная оплата труда (оклад+премия)",
  "salary" : "от 10 000 Br на руки",
  "keywords" : [ "Управление персоналом", "Руководство коллективом", "Системное мышление", "Java", "1С-Битрикс", "Бюджетирование", "Управление проектами", "web-разработки" ]
}, {
  "url" : "https://rabota.by/vacancy/110750980?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Itransition",
  "textContent" : "Кого мы ищем? Ты также заканчиваешь учебу в университете? Твоя нынешняя работа не приносит тебе удовольствия, и ты заинтересован в карьере в IT? Ты одержим программированием и ищешь место, где сможешь применить свои навыки в кодинге? Что мы предлагаем? Возможность стартовать свою карьеру в IT с нуля: Прими участие в интенсивной трехмесячной бесплатной программе индивидуального обучения с поддержкой наставника. После успешного завершения обучения приглашаем тебя в нашу команду! Тебя ждет трудоустройство и участие в проектах для таких известных компаний, как Mercedes-Benz, Diageo, adidas, Whirpool, Shell и других. Кто мы? Опытный игрок на рынке QA с командой из более 1000 специалистов. Каждый сотрудник компании прошел этот путь и все готовы поделиться своим опытом с тобой! Какие навыки важны для нас? Базовое понимание Java, C# или JavaScript. Базовые знания объектно-ориентированного программирования (ООП). Уровень английского языка не ниже B1. Готовность полностью погрузиться в обучение и работу – 40 часов в неделю. Как подать заявку? Пожалуйста, отправь свое резюме на английском языке. Особое внимание удели своим навыкам программирования, своему текущему местоположению и своему уровню владения английским языком.",
  "keywords" : [ "C#", "QA", "Автоматизация тестирования", "Java", "JavaScript", "Тестирование", "Аналитическое мышление", "Английский — B1 — Средний", "Английский язык" ]
}, {
  "url" : "https://rabota.by/vacancy/110766515?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Белорусский народный банк",
  "textContent" : "Белорусский народный банк – банк, который создает будущее. Мы проходим цифровую трансформацию и ломаем стереотипы о классическом банковском обслуживании. Мы заботимся о благополучии нашей команды и предоставляем гибкие условия, чтобы обеспечить баланс между работой и личной жизнью. Мы считаем, что банк может и должен быть лояльным: как к клиентам, так и сотрудникам. Если ты мечтаешь стать частью нашей команды – присоединяйся к нам в роли Senior Java Developer. Основные задачи: Разработка бизнес-логики и back-end системы на Java. Создание функциональных API. Участие в оценке, планировании и разработке архитектуры проекта. Работа с новыми приложениями и поддержка существующих. Внедрение в команду рационализаторских идей и новых технологий. Разработка и актуализация технической документации Коммуникация с заказчиками: митинги, оценка инноваций, анализ требований. Участие в оценке сроков и трудоемкости реализации задач. Участие в собеседованиях и отборе новых членов команды. Обучение младших разработчиков, наставничество Ожидания от кандидата: Глубокие знания и практический опыт работы с Spring Framework (Boot, Data,Security, Cloud). Опыт работы с репозиториями (git). Опыт работы с Rest и SOAP. Практический опыт применения паттернов проектирования. Опыт работы с инструментами гарантированной доставки сообщений. Опыт работы с SQL/NoSQL-базами данных. Опыт разработки высоконагрузочных микросервисов. Опыт разработки программного обеспечения в области FinTech. А что у нас Работа в гибридном графике работы с возможностью посещения офиса (БЦ Футурис). В БНБ-Банке мы стремимся быть в авангарде финтех-инноваций, создавая продукты и услуги, которые меняют представление о том, каким может быть банк. Возможность принять участие в различных амбициозных финтех-проектах. 31 день отпуска и медицинское обслуживание в «Лодэ» как приятный бонус. Скидки на абонементы и оплачиваемые корпоративные тимбилдинги. Предоставление необходимого оборудования для работы.",
  "keywords" : [ "Java", "REST", "NoSQL", "Spring Framework", "Spring Boot", "Spring Data", "SOAP", "Spring Security", "Spring Cloud", "SQL" ],
  "address" : "Минск, проспект Независимости, 173"
}, {
  "url" : "https://rabota.by/vacancy/110774686?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Каспи Софтвер",
  "textContent" : "Приглашаем талантливого разработчика присоединиться к нашей команде! Технологии, использующемые при разработке: Kotlin/Java, OOP, Clean Architecture, Design Patterns, MVVM, MVP, Coroutines, Kotlin Flow, Android SDK, Android Jetpack Libs, Fragments and ViewModels, Retrofit, Room, Dagger 2, Hilt, Koin, Navigation Component, Glide, ExoPlayer, Firebase services Что нужно будет делать: • разрабатывать приложения с 0 и дорабатывать существующие приложения • продумывать архитектуру приложения • улучшать аналитику и добавлять события и A/B тесты для проверки гипотез Что мы ожидаем: • от 2 лет коммерческого опыта • желание и умение писать чистый и аккуратный код, который легко поддерживать • знание цикла работы приложения, управления памятью • понимание паттернов проектирования и современных архитектурных подходов • опыт работы с Git • опыт разработки клиент-серверных приложений • технический английский • умение самостоятельно находить ответы на вопросы Что мы предлагаем: • возможность удаленной работы и гибкое начало рабочего дня (c 09:00 до 11:00) • работу над интересными проектами и возможность улучшить свои скилы • дружная команда единомышленников • лояльное и понимающее руководство с фокусом на качестве и результате • испытательный срок 3 месяца (может быть завершен досрочно) • формат: фулл-тайм (также возможно обсудить и парт-тайм)",
  "keywords" : [ "Coroutines", "MVVM", "Fragments and ViewModels", "Design Patterns", "Clean Architecture", "MVP", "Hilt", "Kotlin Flow", "Android", "Kotlin", "ООП", "Retrofit", "Git", "Dagger 2", "Android Jetpack Libs", "Android SDK", "Android Studio" ],
  "address" : "Минск, улица Сурганова, 41"
}, {
  "url" : "https://rabota.by/vacancy/110792759?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО НитСофт",
  "textContent" : "NeatSoft - IT-компания, специализирующаяся на разработке веб- и мобильных приложений с 2016 года. Мы работаем с клиентами из различных стран мира и успешно реализовали проекты в странах СНГ и Западной Европы. Наши проекты включают как продуктовую разработку (например, logtime.me и mybase.pro), так и аутсорсинг разработки. Работаем с такими технологиями как: Angular; React; VueJS; NodeJS; NestJS; Yii2; Laravel; DevOps Tools; Flutter, Java. Мы находимся в постоянном развитии и ищем PHP-разработчика в нашу дружную команду. Ценные для нас навыки: Знания Yii2 или Laravel; Опыт работы с MongoDb, Mysql, PostgreSql; Опыт работы с Docker; Хорошее владение Linux; Умение работать с системами контроля версий Git; Понимание архитектуры REST. Если ты дочитал досюда и знаком с вышеупомянутыми навыками – ты нам подходишь, и мы готовы предложить: Дружественную уютную атмосферу, удобное расположение; Комфортное рабочее место (чай, кофе, печеньки); Нескучные задачи без бюрократии и формализма (мы за свободу действий  и мышления); Заработную плату, привязанную к курсу USD; Гибкий график работы с плавающим началом рабочего дня (основные часы работы команды с 10:00 до 18:00); Бонусы и премии по результатам работы и значимым событиям (рождение детей, свадьба).",
  "keywords" : [ "PostgreSQL", "Laravel", "SQL", "REST API", "Backend", "Git", "Yii2", "Docker", "Linux", "Web", "MySQL", "PHP", "MongoDB" ],
  "address" : "Минск, Грушевка, Михалово, Петровщина, улица Карла Либкнехта, 66"
}, {
  "url" : "https://rabota.by/vacancy/110866511?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО ФП-ТРЭЙД",
  "textContent" : "Компания CompleteSoft в поисках Middle Frontend Developer! Мы ищем коллегу с 2-х лет опыта разработки. Чем предстоит заниматься: Анализ требований, проектирование решений совместно с командой. Разработка новой функциональности программных продуктов. Подготовка необходимой технической документации. Организация процесса сборки приложений. Что мы от Вас ждем: Коммерческий опыт разработки на Java Script/React от 2 лет. Знания и опыт в верстке HTML/CSS /SCSS. Понимание HTTP-протокола (авторизация, сессии, Cookie и т. д.) Опыт оптимизации рендеринга и загрузки. Опыт использования REST API. Хорошие знания JS ES6+. Опыт работы с Typescript, Webpack, git. Опыт pull request и code review. Опыт работы в команде с бэкенд разработчиками, бизнес-аналитиками и QA. Понимание принципов методологии Agile и ее фреймворков: Scrum, Kanban. Будет плюсом: Опыт работы с Redux, Redux-Thunk, Reselect,toolkit, react-hook-form. Понимание и опыт работы с Jest, React-Testing-Library. Опыт проектирования REST API для взаимодействия фронта и бэка. Опыт работы с законченными высоконагруженными продуктами. Условия: Зарплата по итогам собеседования. 4 sick days в год. Гибридный график работы. Ждем ваших резюме!",
  "keywords" : [ "REST API", "CSS", "Git", "Redux", "SCSS", "JavaScript", "HTML" ],
  "address" : "Минск, Академия наук, улица Платонова, 49"
}, {
  "url" : "https://rabota.by/vacancy/110888680?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Клеркгрупп",
  "textContent" : "В связи с расширением команды активно ведём поиск опытных Android разработчиков уровня Middle и Senior! Стек: Jetpack Compose, MVVM, Kotlin Coroutines + Flow, Hilt, Room Обязанности: Разработка функционала приложения; Ревью кода; Написание тестов; Работа в команде. Требования: Опыт коммерческой мобильной разработки от 2-х лет; Знание Android SDK (Activity, Fragments, Services, etc), Kotlin/Java; Понимание принципов многопоточного программирования; Опыт работы с Retrofit, Jetpack, Coroutines, Flow, ViewModel, Material Components; Знание DI (Dagger2/Hilt); Знание архитектурных паттернов (MVP, MVVM, etc); Понимание что такое тесты и зачем они нужны (E2E, Unit, интеграционных); Базовое понимание многомодульной архитектуры проекта; Понимание применения паттернов проектирования, их плюсы и минусы; Умение работать в команде. Мы предлагаем: Оформление по ТК Республики Беларусь; Стабильную официальную заработную плату; Комфортный, современный офис в Минске либо удаленное сотрудничество; Расширенный социальный пакет.",
  "keywords" : [ "Java", "Retrofit", "Unit Testing", "Android SDK", "Kotlin" ]
}, {
  "url" : "https://rabota.by/vacancy/110894184?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО НитСофт",
  "textContent" : "NeatSoft - IT-компания, специализирующаяся на разработке веб- и мобильных приложений с 2016 года. Мы работаем с клиентами из различных стран мира и успешно реализовали проекты в странах СНГ и Западной Европы. Наши проекты включают как продуктовую разработку (например, logtime.me и mybase.pro), так и аутсорсинг разработки. Работаем с такими технологиями как: Angular; React; VueJS; NodeJS; NestJS; Yii2; Laravel; DevOps Tools; Flutter, Java. Мы находимся в постоянном развитии и ищем .NET разработчика в нашу друную команду. Что мы ожидаем: Хорошее знание основ платформы .NET. Знание SQL, базовый опыт работы с реляционной базой данных. (например: MS SQL Server, PostgreSQL и так далее). Понимание и умение использовать шаблонов проектирования и архитектурных паттернов. Умение работать с системой контроля версий (Git). Понимание архитектуры микросервисов. Будет Плюсом: Опыт работы коммерческой разработки под .Net от 1 года. Опыт работы с JS Frameworks (e.g. Angular, Vue, React). Опыт работы с высоконагруженными системами, решение вопросов производительности, стабильности и надежности. Опыт в написании unit и integration тестов. Ценные для нас навыки: Хорошо развитые коммуникативные и аналитические способности. Умение работать в команде и брать на себя ответственность. Английский язык уровня B2 и выше. Мы предлагаем: Дружественную и уютную атмосферу, удобное расположение офиса. Комфортное рабочее место с чаем, кофе и печеньем. Нескучные задачи без бюрократии и формализма. Заработную плату, привязанную к курсу USD. Гибкий график работы с плавающим началом рабочего дня. Бонусы и премии по результатам работы и значимым событиям. Если вы заинтересованы в этой вакансии и соответствуете указанным требованиям, мы будем рады видеть вас в нашей команде!",
  "keywords" : [ "RabbitMQ", "English", "MS SQL", "Git", "Docker", ".NET", "SOLID", "MSMQ", "Kubernetes", ".NET Core" ],
  "address" : "Минск, Грушевка, Михалово, Петровщина, улица Карла Либкнехта, 66"
}, {
  "url" : "https://rabota.by/vacancy/110914687?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Три Фаундэйшн",
  "textContent" : "We are searching for a brand new gamedev startup that will focus on publishing midcore & hardcore games for mobile. This is a great chance to join while the core team is being formed! You'll be responsible for making strategic decisions, building a team from scratch, and being at the forefront of a company! The company was founded by seasoned entrepreneurs with a proven track record of building successful businesses in the gamedev industry over the last 12 years. What will help you stand out: • 8+ years of experience, with a significant amount of it in building multiplayer online games off which at least 3 years of experience as Lead Developer, Head of Development, or CTO in a gaming company • Extensive experience in the development and deployment of online games, including expertise in network architecture, server-side programming, and player engagement strategies • Experience with cloud computing, DevOps, cybersecurity, and game engines (e.g., Unity, Unreal Engine) • Experience working with Amazon Gamelift, Google Firebase and / or Microsoft Playfab • Strong technical expertise and previous hands-on experience as a software engineer, preferably in large mobile products (iOS/Android native, C++/C#/Java/Scala) • English fluent. If joining a brand new studio and shaping its future sounds like the right challenge for you, we would love to hear from you!",
  "keywords" : [ "C#", "DevOps", "Amazon Gamelift", "C++", "Unreal Engine", "Unity", "mobile products", "Google Firebase" ]
}, {
  "url" : "https://rabota.by/vacancy/110955292?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО АйФьючер",
  "textContent" : "Привет! Мы находимся в поиске Senior Java Developer в нашу команду. Масштабные решения, культура профессионализма и интересные задачи – это про нас :) iFuture – продуктовая IT-компания, мы разрабатываем собственный международный продукт с многомиллионной аудиторией в сфере спортивной аналитики и развлечений уже на протяжении 27 лет. Ищем опытного Java разработчика в команду, которая разрабатывает сервисы маркетинга. Основные задачи: анализ и обсуждение бизнес-требований; интеграция со сторонними сервисами и системами; поддержка и развитие существующей функциональности; разработка и добавление новых сервисов. Наши технологии: Java 17/21; Spring Boot; JPA/Hibernate; Redis; Apache Kafka, RabbitMQ; Docker; REST / JSON-RPC; PostgreSQL / Oracle DB; JUnit, Mockito; Maven; Atlassian, микросервисная архитектура. Вы нам подходите, если имеете: высшее техническое образование (преимуществом будет профильное - \"прикладная информатика\", \"программная инженерия\" и др.); опыт в разработке распределённых систем от 5 лет; опыт работы со Spring экосистемой, Spring Boot, Hibernate; опыт работы с реляционными БД (желательно PostgreSQL, Oracle); опыт работы с MessageBroker-ми (желательно RabbitMQ, Kafka); Мы предлагаем: отсутствие овертаймов: мы за баланс работы и отдыха! гибкое начало рабочего дня (присутственные часы с 11 до 17 GMT+3), 5-дневная рабочая неделя; возможность выбрать удобный формат работы – из дома, в офисе или гибридно; 5 оплачиваемых Sick Days в дополнение к отпуску (25 дней); комфортный офис в центре города с зонами отдыха, кикером, открытыми и закрытыми зонами для проведения совещаний и stand-up митингов, оборудованную кухня со всем необходимым для лёгкого перекуса и обеда; корпоративную рабочую технику и аксессуары; компенсацию оплаты обучений и конференций по профилю специализации, чтобы каждый сотрудник мог расти и развиваться, а также доступ к корпоративной библиотеке; расширенную ДМС со стоматологией и медикаментами; корпоративные скидки у компаний-партнеров; внутренние курсы английского языка в онлайн и оффлайн формате; классные тимбилдинги и дружную команду; оформление по ТК Республики Беларусь с 1-го рабочего дня (испытательный срок – не более 3-х месяцев).",
  "keywords" : [ "Java", "Maven", "Hibernate", "PostgreSQL", "Redis", "JSON-RPC", "RabbitMQ", "Oracle DB", "REST API", "REST", "Docker", "JUnit", "Mockito", "Spring Framework", "Apache Kafka" ],
  "address" : "Минск, Институт Культуры, Площадь Ленина, Могилёвская улица, 39А"
}, {
  "url" : "https://rabota.by/vacancy/110991586?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Innowise Group / Фабрика инноваций и решений",
  "textContent" : "Innowise Group на рынке с 2007 года. За это время наша команда реализовала 850+ проектов для заказчиков из 60+ стран мира — и эти показатели постоянно растут. Для тебя это возможность интенсивно развиваться, пробовать себя в разных направлениях и технологиях, стать ментором и реализовывать свои самые смелые карьерные ожидания. Основа нашего успеха — крутая команда. У нас сформировалось профессиональное комьюнити, которое поможет тебе расти, общаться с экспертами и поддерживать компетенции на высоком уровне. Уверены, что ты сможешь усилить нашу команду! Наши ожидания: Глубокое понимание Javascript, TypeScript, HTML, CSS (Sass, LESS), Angular 2-18+; Знание RxJS, NgRX, понимание Redux - Знание современных паттернов разработки и архитектурных принципов; Опыт работы с RESTful API; Опыт работы с Node.js (Nest.js); Опыт работы с СУБД PostgreSQL, MongoDB; Опыт работы с системами контроля версий; Опыт тестирования кода (Unit, e2e ); Опыт в разработке пользовательских интерфейсов, включая создание сложных и масштабируемых веб-приложений; Уровень владения английским языком от Intermediate+; Отличные навыки коммуникации; Интерес к новым технологиям, инициативность и постоянное стремление к самосовершенствованию и развитию. Будет плюсом: Python, C# (.Net), Java; React, Vue - Ionic (Capacitor/Cordova); Electron - Web3 (solidity, ethers); Уровень владения немецким языком от Intermediate+. Мы предлагаем: Обучение и развитие: Большой пул разноплановых проектов в таких сферах, как FinTech, Medicine, Entertainment, eCommerce, Gaming, Artificial Intelligence и пр.; Минимум легаси; короткий бенч; Широкий стек технологий, возможность перехода между ними; Индивидуальные карты роста и регулярный пересмотр условий (роли на проекте, уровня ЗП) Подготовка к собеседованиям с зарубежными заказчиками на английском языке. Рабочая среда: Формат работы: офис; Просторные и комфортные рабочие места; Подробный онбординг: знакомство с командой, процессами и правилами, экскурсия по офису, welcome card; Уютные кухни, игровые комнаты, коворкинги, лаунж-зоны. Дополнительные бонусы: Добровольное медицинское страхование. Cкидки у компаний-партнеров (от пиццерий и книжных до магазинов бытовой техники). Ну что, ты с нами? Ждем тебя в нашей дружной команде!",
  "keywords" : [ ]
}, {
  "url" : "https://rabota.by/vacancy/110999303?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "GP Solutions",
  "textContent" : "Travel project focused on mountain vacations, from skiing to wellness. This company offers customized packages across top European destinations, delivering unique, nature-driven experiences. We’re looking for a skilled Java (Scala) Developer to help integrate APIs from the travel industry (e.g., hotels, apartments). If you’re proficient in Java and open to working with Scala, this is a great opportunity to expand your skills. Candidate location: remote/in-office or hybrid. Requirements: 3+ years of experience in Java; Experience with Scala; Strong understanding of algorithms and SQL; Intermediate English level or higher. Will be a plus: Familiarity with other programming languages. Your responsibilities would include: Integrate APIs and build a cache of travel products in the database; Work with Java and Scala (with most code written in Scala); Contribute to our search and booking system; Continuously learn and apply new technologies as needed. If you are looking for a place where you’ll tackle challenging projects alongside some of the most talented and dynamic people you’ve ever worked with, GP Solutions might just be the place for you. Join us!",
  "keywords" : [ "Java", "Scala" ]
}, {
  "url" : "https://rabota.by/vacancy/111043070?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО БалинаСофт",
  "textContent" : "Компания BalinaSoft развивается и растет, появляются новые проекты, число необходимых для них сотрудников увеличивается. У нас работают как опытные разработчики, так и джуниоры. К нашей команде можете присоединиться и вы, если именно сейчас просматриваете актуальные вакансии на позицию React Native developer Обязанности: создавать элегантные, удобные, отзывчивые и интерактивные интерфейсы на нескольких устройствах писать повторно используемый код и библиотеки (с соответствующей документацией) в соответствии со стандартом, что позволяет быстро и легко поддерживать код в будущем оптимизировать приложения для максимальной скорости и масштабируемости сотрудничать с back-end разработчиками и веб-дизайнером для повышения удобства использования и устранения неполадок Hard skills: углубленные знания современных возможностей JavaScript, включая стрелочные функции, деструктуризацию, spread/rest операторы и модули, и ES6+; знание принципов асинхронного программирования (Promises, async/await); умение создавать и управлять функциональными и классовыми компонентами, знание жизненного цикла компонентов и хуков (useState, useEffect, useContext и т.д.), понимание контекста (Context API) и его применения для управления состоянием; опыт работы с библиотеками для управления состоянием (например, Redux, MobX или Recoil), понимание принципов работы с middleware (например, Redux Thunk или Redux Saga); опыт работы с библиотеками для навигации (например, React Navigation); Знание Docker, умение интегрировать RESTful и GraphQL API в приложения, опыт работы с библиотеками для выполнения HTTP-запросов (например, axios, fetch) умение писать integration и unit-тесты знание особенностей iOS и Android платформ, включая различия в дизайне и функциональности, опыт работы с нативными модулями и интеграцией с нативным кодом (Java/Kotlin для Android, Objective-C/Swift для iOS) несомненным плюсом будут: Опыт работы с асинхронным программированием (например, с использованием asyncio или библиотек типа FastAPI) Знание и использование пакета react-native-webview Знание основ DevOps и опыт работы с облачными платформами (например, AWS, Azure, Google Cloud) Опыт работы с системами мониторинга и логирования (например, Prometheus, ELK Stack) Soft skills: Реальное планирование сроков выполнения задач, самостоятельность и инициативность в их решении, неукоснительное следование дедлайнам Ответственность, нацеленность на результат, желание и умение доводить дело до конца, внимательность и внимание к деталям Собранность, организованность, интеллигентность, порядочность Умение работать в команде У кандидатов мы ожидаем увидеть: умение преобразовать бизнес-требования в технические задачи законченное или завершаемое высшее образование в области программирования инициативность, умение представлять свои идеи, самостоятельно находить информацию и решать проблемы интерес к IT-сфере, желание развиваться и обучаться удовольствие от участия в сложных технических проектах и предоставления оптимальных решений на каждом этапе разработки Условия: Уникальная возможность для профессионального развития и роста; Комфортные условия труда; Возможность совмещать учёбу и работу Заработная плата по результатам собеседования Просьба указывать в резюме или сопроводительном письме стек технологий, с которым Вы работаете, и ожидания по заработной плате",
  "salary" : "от 1 200 до 2 500 Br на руки",
  "keywords" : [ ]
}, {
  "url" : "https://rabota.by/vacancy/111051094?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО АКДев Групп",
  "textContent" : "Requirements: Minimum of 4 years of experience in Android app development. Experience in tasks/project estimation. Proficiency in Java and Kotlin programming languages, with a deep understanding of object-oriented design principles and software development patterns. Experience with Android SDK, Android Studio, and related development tools and frameworks. Solid understanding of mobile UI/UX design principles and best practices, with the ability to create visually appealing and user-friendly interfaces. Knowledge of back-end technologies and RESTful APIs for integrating mobile applications with server-side systems. Excellent understanding of computer fundamentals, data structures, algorithms, architecture patterns (MVP, MVVI, etc.) Strong problem-solving skills, communication skills, attention to detail, and ability to work independently and collaboratively in a fast-paced environment. English level: A2+. Responsibilities: Collaborate with cross-functional teams to define, design, and ship new features for our Android applications. Develop clean, efficient, and maintainable code in Java and Kotlin, following. Implement user interfaces in collaboration with our UI/UX designers. Integrate with back-end services and APIs to ensure seamless data exchange and functionality. Perform code reviews, testing, debugging, and optimization. Contribute to continuous improvement initiatives, such as process optimization and tooling enhancements, to streamline development workflows. Will be a plus: experience in Kotlin Multi Platform experience in developing Kotlin server applications We offer: Comfortable location in modern office in Minsk (Business Center Titan); A dedicated rest area with delicious tea, coffee with cookies, sweets and other pleasures; Flexible work day, individual schedule; Official employment; Endless professional growth; The ability to propose and implement your own ideas and see them come to life. A chance to make a real impact in the world of financial technology.",
  "keywords" : [ "Java", "REST API", "Android SDK", "Android Studio", "Kotlin" ],
  "address" : "Минск, Петровщина, проспект Дзержинского, 104"
}, {
  "url" : "https://rabota.by/vacancy/111071262?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Райкири Клауд",
  "textContent" : "Наш бренд \"Делай Свое дело\" – ведущий провайдер услуг бухгалтерского аутсорсинга в сфере IT. Мы так же являемся членами ПВТ и разработчиками собственного программного обеспечения, аналога 1С, для учета и анализа финансовой деятельности. Наша команда известна своим инновационным подходом и высоким уровнем обслуживания клиентов. Мы ищем в команду сообразительного и амбициозного Full-stack developer! В нашей команде вы получите: - обучение, поддержку и развитие; - возможность удовлетворить свои амбиции (финансовые и профессиональные); - общение с командой лучших профессионалов, на которых хочется ровняется; - крутой офис в центре города; - штатных менеджеров по управлению стрессом: Бусельфину и Дану. Да, да, у нас дог френдли офис. Мы интенсивно растем и развиваемся каждый год. И каждый год мы покоряем новые вершины. Если тебе нравится покорять и ты не хочешь стоять на месте, присоединяйся к нашей команде, которая «Делает Свое Дело». Обязанности: разработкой серверной и клиентской частей программ исправление багов Требования: Наличие высшего образования - по специальности, либо экономического (с дополнительными курсами по программированию Язык программирование Java Языки разметки HTML5/CSS Язык построения запросов к базе данных SQL Работа с базами данных Разработка клиент-серверных приложенией на языке Java Работа c ORM системами JPA/Hibernate/EclipseLink Знание библиотеки классов Java Знание библиотек написание веб-сервисов JAX-RS/Spring-WebMVC Знание основ работы с шаблонизаторами Опыт работы ОБЯЗАТЕЛЕН Условия: стабильная зарплата, социальные гарантии работа на полный рабочий день в Минске, в уютном офисе в центре, с кухней, печеньками, удобным рабочим местом с быстрым компьютером и большим монитором возможность стать частью молодой команды, увлечённой страстью построить лучший клиентский сервис для предпринимателей возможности для саморазвития и роста мы готовы помогать тебе в обучении, но при этом требуем взамен адекватной самоотдаче нашей компании",
  "keywords" : [ "Java EE", "CDI Java", "JavaScript", "JPA", "JAX-RS", "SQL" ],
  "address" : "Минск, улица Мясникова, 70"
}, {
  "url" : "https://rabota.by/vacancy/111076861?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Innowise Group / Фабрика инноваций и решений",
  "textContent" : "Innowise Group на рынке с 2007 года. За это время наша команда реализовала 850+ проектов для заказчиков из 60+ стран мира — и эти показатели постоянно растут. Для тебя это возможность интенсивно развиваться, пробовать себя в разных направлениях и технологиях, стать ментором и реализовывать свои самые смелые карьерные ожидания. Оcнова нашего успеха — крутая команда. У нас сформировалось профессиональное комьюнити, которое поможет тебе расти, общаться с экспертами и поддерживать компетенции на высоком уровне. Уверены, что ты сможешь усилить нашу команду. Voka – это первый в мире комплексный 3D атлас анатомии и патологической анатомии, представляющий инновационные решения в области медицинского образования и визуализации. Наш продукт активно используется профессионалами и студентами для углубленного изучения человеческого тела. Наши ожидания: Уверенные знания Java и опыт работы с Spring Framework. Опыт работы с NoSQL базами данных (Document, Key-Value, Time-Series и тд). Знание технологий кеширования (например, Redis). Опыт работы с решениями для поиска (Elasticache и аналогичные). Опыт разработки микросервисов. Опыт работы с системами обмена сообщениями, такими как Kafka или другие MQ. Будет плюсом: Опыт работы с crafterCMS. Знание Kotlin. Опыт работы в CMS/LMS домене. Мы предлагаем: Индивидуальные карты роста и регулярный пересмотр условий (роли на проекте, уровня ЗП) Формат работы: офис; Просторные и комфортные рабочие места; Подробный онбординг: знакомство с командой, процессами и правилами, экскурсия по офису, welcome card; Уютные кухни, игровые комнаты, коворкинги, лаунж-зоны. Дополнительные бонусы: Добровольное медицинское страхование. Cкидки у компаний-партнеров (от пиццерий и книжных до магазинов бытовой техники). Ну что, ты с нами? Ждем тебя в нашей дружной команде!",
  "keywords" : [ "NoSQL", "ElastiCache", "Работа в команде", "Spring Framework", "Redis", "Apache Kafka" ]
}, {
  "url" : "https://rabota.by/vacancy/111112280?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ОАО ЦНИИТУ",
  "textContent" : "Frontend developer зарплата по итогам собеседования ОАО ЦНИИТУ Пролетарская, Минск, Партизанский проспект, 2к4 Требуемый опыт работы: 1–2 лет. Полная занятость, полный день. ОАО \"ЦНИИТУ\" приглашает на работу Frontend-разработчика. Обязанности: Frontend JS разработчик (React фреймворк, MongoDB, PostgreSQL, NodeJs, React Native, Redux, Flux, RTK Query). Качественное и своевременное проектирование, разработка кода и рефакторинг. Умение разбираться и поддерживать чужой код. Знания по Java, Sql будут плюсом. Требования: Обязательно Уверенные знания в React, JavaScript, HTML5, CSS3.Опыт работы с React. Понимание основ XML/XSD. Конвертация XML/SOAP в JSON/REST, процессов интеграции средствами WEB-сервисов. Понимание и опыт работы (минимальное проектирование и администрирование, знания SQL-запросов будет преимуществом) с реляционными и документоориентированными базами данных. Понимание микросервисной архитектуры на уровне пользователя. Наш стек: React, Kubernetis, Java, Spring, Maven, Kafka, PostgreSQL, Mongo. Желательно Опыт профессиональной разработки программного обеспечения от 1 года. Понимание протокола HTTP и опыт работы с внешними API (REST). Условия: Полный день, понедельник-пятница с 9 до 18. Проф. обучение, повышение квалификации. Медицинское страхование после 3х месяцев работы.",
  "salary" : "от 2 700 до 4 500 Br на руки",
  "keywords" : [ "Vue.js", "REST", "DOM", "PostgreSQL", "JavaScript", "HTML5", "MongoDB", "JSON", "React Native", "React" ],
  "address" : "Минск, Пролетарская, Партизанский проспект, 2к4"
}, {
  "url" : "https://rabota.by/vacancy/111113235?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Модульные строительные системы",
  "textContent" : "Компания \"CUBY Technologies\" занимается реализацией инвестиционного проекта, связанного с выпуском оборудования и комплектующих для модульного строительства быстровозводимых домов. В данный момент наша команда проектирует платформу, объединяющую ряд сервисов, которая автоматизирует сложные механизмы строительства и пользования недвижимостью. На первом этапе мы проектируем сложную нагруженную систему, которая позволит нашим заводам максимально автоматизировать процесс производства деталей для модульных домов - и координирует методологию их сборки. Конечная цель - это сервис для неквалифицированных рабочих с автоматической системой выдачи задач в процессе цикла производства и сборки здания. Наш продукт - это завод, который можно развернуть в любой точке мира. Кого мы ищем: Наша команда находится в поиске на постоянную основу в офис Middle Backend-разработчика Обязанности: Разработка серверных приложений; Проектирование и разработка баз данных; Обеспечение безопасности данных; Интеграция сторонних сервисов; Соблюдение сроков и управление проектами; Соблюдение стандартов; Масштабирование приложений. Стек технологий: Spring WebFlux, Keycloak, MongoDB, Java 8+, Docker, Project Reactor Условия: Официальное трудоустройство; Возможность принять участие в проекте, который формирует новые правила и законы строительства модульных домов на рынке США и Европы; Создание комфортных условий для развития знаний и навыков; Высокий уровень дохода, соразмерный профессионализму кандидата.",
  "keywords" : [ "java 8+,", "Project Reactor", "Docker", "Spring WebFlux", "MongoDB", "Keycloak" ],
  "address" : "Минск, улица Солтыса, 187"
}, {
  "url" : "https://rabota.by/vacancy/111113606?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО ГеймТек",
  "textContent" : "GameTech в поиске амбициозных Java разработчиков, желающих попасть в Gamedev. Для разработки игр для мобильных платформ (iOS, Android, Amazon) компанией разработан собственный фреймворк. Игровая логика пишется на Java. Затем Java код конвертируется в С++ код и далее компилируется для указанных платформ. Такой подход позволяет добиться высокой скорости разработки за счет того, что для тестирования игровой логики нет необходимости делать сборку для устройства, достаточно запустить desktop Java приложение. Обязанности: Разработка и оптимизация игровой логики. Разработка новой и рефакторинг текущей функциональности игры. Разработка и развитие проектного инструментария разработки (редакторы, валидаторы ресурсов, инструменты сборки). Помощь нетехническим (Гейм Дизайнеры) специалистам в решении возникающих проблем. Мы ожидаем от вас: Опыт разработки игр. Знание особенности работы движка на различных платформах. Опыт разработки на Java. Знание классических алгоритмов и структур данных(списки, графы, поиск пути и д.р.), шаблонов проектирования. Знание современных принципов программирования: SOLID, KISS. Умение писать качественный и понятный код. Самостоятельность в принятии архитектурных решений. Способность и готовность поддерживать и расширять Legacy code. Готовность быть наставником и помощником для начинающих членов команды. Приветствуется: Опыт работы с OpenGLES, Vulkan. Опыт разработки мобильных приложений (iOS, Android). Опыт разработки на Ruby. Опыт работы с другими 3D движками (Unity, Unreal Engine и т.п.). Опыт работы с различными плагинами и сервисами (Firebase, FairBid и т.д.). Почему у нас приятно работать? Мы вдохновляемся друг другом! Делимся опытом, обмениваемся крутыми идеями, обсуждаем их и сразу же идем реализовывать. И результаты превосходят все наши ожидания. Наш департамент заботы усиленно работает, чтобы слово «забота» звучало в компании чаще, чем вы успеете о ней подумать. В стартовый набор входит медицинское страхование, компенсация больничного, отпуск, 4 Sick days в год, компенсация спорта, а также психологическая поддержка для сотрудников. Для профессионального развития есть все необходимое: внутренние курсы английского языка, посещение профильных конференций, курсов, воркшопов и многое другое. Конечно же, это не все. Мы всегда ярко празднуем дни рождения компании, новогодние праздники, тимбилдинги, релизы и дни рождения проектов. В копилке приятных бонусов также премии за рекомендации будущих коллег, ко дню рождения и важным событиям вашей жизни. Присоединяйтесь к нам и создавайте будущее игр!",
  "keywords" : [ "Java" ]
}, {
  "url" : "https://rabota.by/vacancy/111114861?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Альфа-Банк: IT-направление и цифровой бизнес",
  "textContent" : "Альфа Банк – один из ведущих частных банков, который входит в число системно значимых банков Беларуси. Мы работаем как финтех-компания, интегрируя в свою бизнес-модель успешные практики в области мобильных платежей, онлайн-кредитования, цифровых транзакций и других передовые технологии. Сейчас в Альфе более 60 тысяч бизнес-клиентов и почти миллион клиентов-физлиц. Сегодня в команде Альфа Банка более 2500 профессионалов. Мы объединяем людей с разным опытом, взглядами и интересами. Присоединяйся к команде. Вместе мы способны на большее! Ключевые задачи: очистка, преобразование и агрегация данных для анализа и моделирования разработка ETL (Extract, Transform, Load) процессов работа с большими объемами данных создание масштабируемых решений (Spark, Hadoop), в т.ч. на базе контейнерной архитектуры (Kubernetes) разработка, развертывание и оптимизация (квантование, прунинг, дистилляция) моделей для уменьшения размера модели и улучшения эффективности инференции автоматизация процессов обучения и тестирования моделей (Airflow) решение высоконагруженных промышленных задач в области NLP(LLM), Computer Vision, Deep Learning Пожелания к кандидатам: наличие профильных сертификаций по data science; участие и призовые места в конкурсах по ML/DL: Kaggle, DrivenData, AIcrowd, RoboCup, etc.; наличие собственных проектов в публичных репозиториях в области ML/AI, CV, NLP; профильное математическое образование (статистика, теория вероятности, etc.) или в области ИИ; Предпочтительно владение следующими технологиями: один из языков программирования: Python, R, Java, Scala, C++. библиотеки обработки данных: NumPy, Pandas. библиотеки машинного обучения: Tensorflow, Keras, PyTorch, Scikit-Learn. библиотеки NLP и CV: NLTK, SpaCy, Gensim, Hugging Face Transformers, OpenCV, YOLO, PIL. библиотеки и платформы больших данных: Hadoop, Hive, Spark, PySpark, Kafka, Apache Flink. ETL и БД: Apache NiFi, Talend, Apache Airflow, SQL (PostgreSQL, MySQL), NoSQL (MongoDB, Cassandra). опыт работы с инструментами визуализации данных: Tableau, PowerBI, D3.js. Git, Docker, Kubernetes. фреймворки для создания веб-сервисов: Flask, Django. Что предлагаем для твоего комфорта: работу в команде с высокой экспертизой; современный стек технологий, масштабные проекты и сильную команду; мощное железо для работы; формат работы на выбор (удаленный/гибкий график); сочетание стабильности банка и гибкости ИТ; Альфа Среду (серию митапов о цифровой трансформации банка).",
  "keywords" : [ "Computer Vision Engineer", "Data Analyst", "Машинное обучение", "Machine Learning", "Research Engineer", "Data Science", "R", "NLP", "Researcher", "Data Engineer", "Machine Learning Engineer", "Deep Learning Engineer", "Python", "TensorFlow", "Kubernetes", "ML" ]
}, {
  "url" : "https://rabota.by/vacancy/111115799?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "SaM Solutions Самсолюшнс",
  "textContent" : "We are looking for an experienced Senior/Middle Java Developer ready to work with advanced technologies and develop their skills in an international team to participate in a US client project. Key technologies and requirements: Backend: Strong knowledge of Java 11+; Spring Framework, XML, JSON; Experience building AWS Lambda functions; Excellent AWS SQS skills; Proactivity, good communication skills; Conversational English at C1 level to work with an international team. Cloud technologies (AWS): Working with EC2, SQS, Secrets Manager; Develop and maintain REST services using AWS Lambda (experience required); API Gateway; AppSync (desirable). Additional: Strong knowledge of Git/GitHub; Experience with AWS Serverless Functions; Knowledge of SonarQube/Cloud for code analysis is desirable; Experience with Step Functions, AWS ECS, Docker and AWS SAM would be an advantage. We Offer: Opportunity to work on high-tech projects; Official employment; Flexible schedule, possibility of remote work; Paid time off and paid sick days; English and German language classes; Corporate trainings, seminars, events within the framework of internal PMO; More detailed information can be found on the company description page.",
  "keywords" : [ "Java", "Spring Framework" ]
}, {
  "url" : "https://rabota.by/vacancy/90897379?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Альфа-Банк: направление массового бизнеса",
  "textContent" : "Альфа Банк – один из ведущих частных банков, который входит в число системно значимых банков Беларуси. Мы работаем как финтех-компания, интегрируя в свою бизнес-модель успешные практики в области мобильных платежей, онлайн-кредитования, цифровых транзакций и других передовые технологии. Сейчас в Альфе более 60 тысяч бизнес-клиентов и почти миллион клиентов-физлиц. Сегодня в команде Альфа Банка более 2500 профессионалов. Мы объединяем людей с разным опытом, взглядами и интересами. Присоединяйся к команде. Вместе мы способны на большее! Ключевые задачи: Ручное и автоматизированное тестирование веб приложений (UI, Integration, API, e2e testing); Опыт работы с TMS (Allure TestOps, TestRail, TestIT); Организация процесса тестирования на проектах; Ведение документации по тестированию проектов; Знания в области обеспечения качества ПО. Пожелания к кандидатам: от 3 лет опыта работы; Хорошее понимание процессов разработки ПО; Уверенное знание процессов тестирования и обеспечения качества; Знания инструментов автоматизированного тестирования для платформ Web; Обширные знания методов/методологий тестирования и умение применять их на практике; Практический опыт проведения различных видов тестирования; Написание тестовой документации (тестовые примеры, контрольные списки, отчеты об ошибках, планы и стратегии тестирования); Опыт использования инструментов управления дефектами (например JIRA); Опыт использования систем управления тестированием (например Allure TestOps, TestRail, TestIT); Система контроля версий (например, Git, SVN); Знание языков TypeScript; Что предлагаем для твоего комфорта: работу в команде с высокой экспертизой; современный стек технологий, масштабные проекты и сильную команду; мощное железо для работы; формат работы на выбор (удаленный/гибкий график); сочетание стабильности банка и гибкости ИТ; Альфа Среду (серию митапов о цифровой трансформации банка).",
  "keywords" : [ "QA", "TypeScript", "AQA", "Atlassian Jira", "JavaScript", "Playwright", "Тестирование", "SQL" ]
} ]