[ {
  "url" : "https://rabota.by/vacancy/110611001?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Scand",
  "textContent" : "Scand Ltd. is looking for a creative and initiative Marketing Manager. SCAND Ltd. is an software development company, with offices in Warsaw, Poland and Minsk, Belarus. The company is focused on custom software development outsourcing across multiple technologies including .NET, Java, PHP, JavaScript, and C++. With more than 20+ years in IT and 700 successful projects for dozens of customers globally and over 250 highly experienced engineers on board, we are rated as one of the top software outsourcing companies in Eastern Europe. Responsibilities: Participation in the digital strategy development and its implementation across various marketing channels; Generating new ideas on how to increase conversions; Research on new lead generation channels; Market analysis, competitive analysis, building hypotheses, A/B testing; Proofreading and writing articles on various IT and business topics; Content distribution and e-mail outreach campaigns; Managing social media campaigns (LinkedIn, Facebook, Twitter); Supporting corporate websites (content development, copywriting, corporate blogging).. Requirements: Advanced English (perfect content writing skills); Experience in IT sphere; Experience in using CMS; Basic knowledge in SEO, Google Analytics, Semrush; Experience in using email marketing tools (BuzzStream, Mailchimp, etc). German would be a plus; Team-oriented, creative and positive thinking person with analytical skills. What we offer: Official employment; Possibility of working remotely; Stable decent salary; Health insurance; English courses; 29-day paid vacation; Friendly team, loyalty and understanding; Interesting festivals and events, active recreation with colleagues; Sport support (swimming pool, gym, etc.); Free seasonal flu vaccine; Auto and bicycle parking (+ shower cabins for cyclists); Comfortable office in convenient proximity to the city center (underground station “Institute of Culture”).",
  "keywords" : [ "Mailchimp", "Маркетинг", "CMS", "Маркетолог", "A/B testing", "SEO", "Английский — B1 — Средний", "Marketing", "Английский язык" ]
}, {
  "url" : "https://rabota.by/vacancy/109076022?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ЗАО Водород",
  "textContent" : "VADAROD – IT компания, наша команда специализируется на разработке и сопровождении программных продуктов в финтех домене. Приглашаем в команду Java разработчиков для развития текущих масштабных финтех проектов :) Задачи: Разработка функционала для приложений банка, интеграция с системами банка, разработка архитектурных решений; Мы ожидаем: Высшее техническое образование; От 3-х лет коммерческой разработки; Знание и опыт работы с Spring Boot, Data, Oracle, PostgreSQL, Liquibase, JMS, Docker, Kubernetes, Apache Camel, Keycloak, OAuth2, REST, ELK; Мы предлагаем: Комфортный, современный офис в центре города; Гибкое начало рабочего дня; Формат работы - офис, гибрид; Медицинская страховка с включенной стоматологией; Курсы английского языка; Отпуск 29 дней и материальная помощь на оздоровление; Обеспечиваем необходимой техникой для комфортной работы. Откликайся, мы будем рады познакомиться с тобой!)",
  "keywords" : [ "REST", "Docker", "ELK", "PostgreSQL", "Apache Camel", "Spring Boot", "Keycloak", "ORACLE", "Kubernetes" ],
  "addressString" : "Минск, Купаловская, Октябрьская, Площадь Победы, проспект Независимости, 32А"
}, {
  "url" : "https://rabota.by/vacancy/110639696?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Марк Формэль",
  "textContent" : "Приглашаем в команду профессионалов Опытного руководителя IT подразделения/ IT директор. Обязанности: Обеспечение эффективности всех информационно-технологических процессов компании; Определение и реализация стратегии развития IT с учётом требований бизнеса; Руководство персоналом - подбор и расстановка кадров, постановка задач, контроль исполнения; Разработка плана мероприятий по автоматизации производства, розницы, онлайн; Бюджетирование и контроль за соблюдением бюджета; Обеспечение полного цикла разработки продуктов компании (анализ, оценка, проектирование, разработка, тестирование, сдача в коммерческую эксплуатацию, поддержка); Управление несколькими продуктами в стадии реализации; Ответственность за информационную безопасность; Сопровождение IT проектов (собственных и внешних), интеграционных проектов, проектов автоматизации, проектов по большим данным; обеспечение стабильной и бесперебойной работы IT-систем, компьютерного и сетевого оборудования, поддержки пользователей; эффективное взаимодействие с подрядчиками и с внутренними заказчиками. Требования: высшее образование, желательно техническое; знание процессов розничной и оптовой торговли, в т.ч. маркетплейсов; стаж работы от 3 лет на должности IT-директора в крупной успешной и структурированной компании, желательно сферы розничной торговли/электронной коммерции; знание современных методик и практик IT-деятельности; знание современных технологий и архитектур; опыт автоматизации процессов; опыт управления крупными IT-проектами, проектами по большим данным, e-commerce, web-разработками; опыт работы с java, 1С и Битрикс; знание любой из конфигураций 1С УХ, ERP, УПП, УТ, Бухгалтерия; системное мышление, широкий профессиональный кругозор; стрессоустойчивость, работоспособность, сильные управленческие навыки; хорошие коммуникативные навыки и умение эффективно взаимодействовать в команде. Условия: Оформление в соответствии с ТК РБ, социальные гарантии Современный офис в г. Заславль Достойная оплата труда (оклад+премия)",
  "keywords" : [ "Управление персоналом", "Руководство коллективом", "Системное мышление", "Java", "1С-Битрикс", "Бюджетирование", "Управление проектами", "web-разработки" ]
}, {
  "url" : "https://rabota.by/vacancy/110072110?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Байрил",
  "textContent" : "BYRIL, IT-компания, специализирующаяся на разработке мобильных игр, в поисках Junior Java Developer-a для усиления нашей целеустремленной и независимой команды в игровой индустрии на проект “Морской бой 2”! Мы — команда профессионалов, создающих мобильные игры с вниманием к деталям и душой. BYRIL ориентирована на развитие, рост и создание уникальных проектов в жанре midcore. Чем предстоит заниматься: Разработка мобильных игр для платформы Android/IOS с использованием кроссплатформенного фреймворка LibGDX; Поддержка существующих и разработка новых игровых механик; Взаимодействие с другими департаментами; Написание чистого, поддерживаемого и эффективного кода; Релизное и пострелизное сопровождение приложений. Что мы ожидаем от кандидата: Уверенные знания Java и объектно-ориентированного программирования (ООП); Желание развиваться в игровой индустрии, учиться новым технологиям и углублять свои навыки; Понимание Android SDK, опыт работы в Android Studio; Опыт работы с системами контроля версий (Git); -нимательность к деталям, инициативность, способность работать в команде, любовь к играм; Способность понимать и анализировать поставленные задачи. Будет плюсом: Знание других языков программирования (например, Kotlin); Опыт настройки и сопровождения процессов разработки (CI/CD, code review, статический анализ кода); Знание основ работы с фреймворками (опыт работы с LibGDX, Spring, Hibernate будет плюсом). Присоединяйтесь к нам и внеси свой вклад в код наших midcore-игр!",
  "keywords" : [ "Java", "Git", "Android SDK", "Android Studio" ],
  "addressString" : "Минск, Шафарнянская улица, 18"
}, {
  "url" : "https://rabota.by/vacancy/108687161?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО СолвИтБай",
  "textContent" : "Мы – компания-разработчик программного обеспечения, занимаемся созданием mobile и web решений для компаний, работающих в следующих сферах: FinTech, Retail & Ecommerce, Marketplace & Platforms, Travel & Booking, Healthcare. Нам доверяют клиенты из разных уголков планеты: США, Канады, Великобритании, Франции, Израиля, Германии, Швейцарии, Норвегии, Швеции. В связи с расширением, наша дружная команда SolveIt в поиске QA Engineer ориентированного на результат и саморазвитие для выполнения следующих задач: Анализ требований и документации совместно с командой; Написание тестовой документации; Тестирование продукта на всех этапах разработки; Активная работа со всеми членами команды разработки; Участие в планировании разработки и развития продукта; Непрерывная работа над улучшением качества продукта. Что мы ждем от Вас: Опыт тестирования web и мобильных приложений от 2-х лет; Опыт написания тестовой документации (тест-планы, чек-листы, тест-кейсы, баг-репорты); Опыт работы с реляционными базами данных; Понимание клиент-серверной архитектуры; Опыт тестирования веб-сервисов и API; Опыт работы с системами управления версиями; Уровень разговорного английского от B2 и выше. Будет плюсом: Опыт автоматизации, знание Java/JS. Что мы можем Вам предложить: Работу в международной компании SolveIt над масштабными, сложными и действительно интересными проектами в сфере логистики, транспорта, финансов и медицины (клиенты из Европы, США, Канады); Официальное трудоустройство (4 sick days в год без справок, отпуск 25 календарных дней); Конкурентный уровень заработной платы по результатам собеседования, индексация по результатам Performance Review; Перспективы профессионального и материального роста по результатам работы; Постоянное развитие и обмен опытом внутри команды; Работа над интересными задачами и со \"свежим\" стеком технологий; Гибкий гибридный рабочий график (3 дня из офиса, 2 - удалённо); Светлый офис в 5 минутах от ст. м. Молодёжная в современном бизнес-центре “Контур” с развитой инфраструктурой (магазин, кафе, пекарня); Компенсация занятий спортом/конференций/курсов; Компенсация обслуживания в медицинском центре “ЛОДЭ”; Бесплатная свободная парковка; Снеки и фрукты всегда в офисе. Будем рады видеть вас в числе нашей дружной компании SolveIt!",
  "keywords" : [ "QA", "Atlassian Jira", "Тестирование", "Scrum", "Atlassian Confluence" ]
}, {
  "url" : "https://rabota.by/vacancy/109862333?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Expert Soft",
  "textContent" : "Приглашаем на бесплатный практический тренинг Java Web Development for E-commerce. Мы открыли набор и ждем твой отклик! Мы Expert Soft - аутсорсинговая IT компания из Беларуси, резидент ПВТ. С 2014 года мы разрабатываем и поддерживаем сайты западных enterprise клиентов (США и Западная Европа) преимущественно в е-commerce сфере. За время существования компании мы провели 13 выпусков курса по Java Web, и многие наши выпускники продолжают свой путь в Expert Soft. Некоторые из них уже на протяжении 6+ лет работают на коммерческих проектах, получая ценный практический опыт. А позже сами становятся менторами и передают студентам накопленные знания. Таким образом, на тренинге мы даем действительно ценные навыки, которые в будущем помогают уверенно начать работу на первом коммерческом проекте. Мы предлагаем: Тренинг, который готовит к реальным проектам на технологиях Java-стека (изучение Java, Stream API, 3-layer architecture, HTTP basics и др.). Полностью удаленное обучение с гибким графиком - удобно совмещать с учебой. Продолжительность тренинга 1,5 месяца. Обучение в малых группах с постоянной поддержкой ментора. Помощь и поддержка от HR компании на всех этапах для обучения. По итогам тренинга лучшим стажерам мы предоставляем возможность стать сотрудниками Expert Soft, продолжить учебу в компании (последующая стажировка уже в штате компании предполагает выплату “стипендий”) и начать работу на коммерческих проектах. также для студентов бюджетной формы обучения возможно распределение после прохождения испытательного срока в проекте. Мы ожидаем от вас: Знание английского языка не ниже крепкого Intermediate уровня. Отличные базовые знания по программированию и ООП. Уверенное владение основами Java SE. Базовые знания реляционных баз данных и языка SQL. Возможность уделять учебе не менее 4-5 часов в день. Желание стать профессионалом своего дела! Как пройти отбор на тренинг: Откликнуться на вакансию. Вам будет выслана ссылка на отклик, перейдя по которой необходимо будет ввести вашу почту и заполнить подробную анкету. После обработки анкеты системой на указанную почту вам будут высланы приглашения на базовый онлайн-тест по Java и онлайн-тест по английскому языку. В случае успешного написания обоих тестов необходимо будет выполнить небольшое практическое задание, приглашение на которое также придет письмом. При успешном выполнении всех тестовых заданий мы пригласим вас на техническое интервью. Заключительным этапом при успешно пройденном техническом интервью будет HR собеседование. Ждем ваш отклик!",
  "keywords" : [ "ООП", "Java", "CSS", "Spring Framework", "HTML", "Java SE", "SQL", "Английский язык" ],
  "addressString" : "Минск, улица Мележа, 5к2"
}, {
  "url" : "https://rabota.by/vacancy/110041298?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО GRYMALA / ГРЫМАЛА",
  "textContent" : "Привет! Мы - продуктовая компания Grymala. Занимаемся разработкой собственных мобильных приложений из категории утилиты - измерения с помощью технологий дополненной реальности, компьютерного зрения, машинного обучения и 3D графики. Наши Android-приложения (AR Plan 3D, AR Ruler, Ruler App) завоевали лидерство в своей категории с общим количеством скачиваний > 50 млн. Любить своё дело, стремиться к высоким стандартам качества, быть приверженными инновациям, постоянно изучать новое, развиваться и испытывать азарт перед амбициозными задачами - это наш lifestyle. Мы ищем талантливого и амбициозного Junior+ Android Developer с математическим складом ума, который готов присоединиться к нашей команде и внести свой вклад в создание качественных и инновационных мобильных приложений. Мы ищем ответственного и внимательного к деталям человека, который готов к изучению новых технологий и не боится задач, требующих творческого подхода и тщательного анализа. Мы ценим любознательных и инициативных людей, готовых расти вместе с командой, принимать на себя новые вызовы и находить решения для сложных задач. Чем предстоит заниматься: Разработка и поддержка мобильных AR приложений под платформу Android Написание тестируемого, качественного кода Работа над багами и доработка - выявление, диагностика и исправление ошибок, улучшение функциональности и пользовательского опыта Активное изучение существующих технологий, развитие в технологиях из области интереса компании: AR / AI / CV / HPC / 3D Graphics / Custom UI solutions / Algorithms Эффективное взаимодействие с командой Наши ожидания: Коммерческий опыт разработки на Android от 6-12 месяцев: вы уверенно знакомы с платформой Android и основами разработки мобильных приложений Техническое / математическое высшее образование (БГУИР, БГУ и т.д.) Знание и опыт работы с Kotlin и Java Опыт работы с Jetpack compose, Jetpack architecture Математический склад ума, навыки аналитического / алгоритмического мышления Знание основных компонентов системы Android Опыт работы с системами контроля версий (Git) Понимание основ архитектурных паттернов (MVC, MVVM, MVP, MVI) Знание Jira / Confluence Умение писать чистый, структурированный код Живой интерес к современным технологиям из области интереса компании Желание развиваться и в области исследований и разработок Высокий уровень самостоятельности и ответственности Коммуникабельность, мотивированность, высокая скорость усвоения новых знаний Будет большим плюсом: Наличие побед и призовых мест по профильным предметным олимпиадам (программирование / математика / физика) Наличие собственных pet-projects Наличие интереса к / опыта в технологиях дополненной реальности, компьютерной графики, компьютерного зрения Мы предлагаем: Работу в компании, разрабатывающей инновационный продукт Возможность развиваться и проявить себя Открытых и профессиональных коллег Семейную атмосферу и лояльный менеджмент Гибкий график и творческую рабочую атмосферу Мы слышим и понимаем наших сотрудников, внимательны к пожеланиям и предложениям. Развитие и комфорт для каждого - вот что нам важно!",
  "keywords" : [ "Java", "Augmented Reality (AR)", "Git", "Математический склад ума", "Android", "Kotlin" ],
  "addressString" : "Минск, Молодежная, Площадь Ленина, улица Карла Либкнехта, 66"
}, {
  "url" : "https://rabota.by/vacancy/109686367?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Синтегрико/Syntegrico",
  "textContent" : "Международная IT-компания Syntegrico (резидент Парка высоких технологий) приглашает Java Developer в свою команду для работы над интересными задачами и проектами. Syntegrico основана в 2016 году и насчитывает более 300 квалифицированных и сертифицированных технических специалистов в Республике Беларусь, Российской Федерации, Узбекистане и Грузии. Обязанности: создание нового функционала и улучшение существующего ПО; написание чистого и оптимизированного кода; обеспечение высокого качества ПО, используя проверенные паттерны и методологии; интеграция разрабатываемого ПО с программными решениями Заказчика; исправление технических неисправностей, выявленных в процессе тестирования; работа с Git. Требования: опыт работы на аналогичной должности не менее 2 лет; знание Java core, опыт разработки на Java 8 и более новых версиях; знание Spring Framework: MVC, Boot (nice to know - Security, Cloud); знание Hibernate/JPA; опыт работы с gradle/maven; знание HTML, CSS; знание SQL, понимание принципов реляционных БД (MS SQL и/или PostgreSQL); понимание принципов взаимодействия через REST; знание принципов ООП, SOLID и понимание паттернов проектирования; опыт работы с Git, Jira; английский язык (коммуникация) от Intermediate (B1). Плюсом будет: базовые знания JavaScript; опыт интеграции с API и другими сторонними сервисами; знание принципов разработки SOAP-сервисов; знание структуры XML-инструментария Java; понимание принципов взаимодействия через HTTP/HTTPS; знание и опыт работы с Docker, Kubernetes; знание и опыт работы с RabbitMQ и/или Kafka; знание и опыт работы с тестовыми фреймворками: Junit/TestNG, Mokito; знание и опыт работы с CI/CD (Jenkins, gitlab ci); знание и опыт работы с микросервисами; React.js или Angular.js. Всем своим сотрудникам Syntegrico гарантирует: официальное оформление в штат; комфортный офис с тренажёрным залом; корпоративный курьер; внутренние образовательные митапы для сотрудников. Почему Syntegrico? мы – резиденты ПВТ в Беларуси; специализируемся на консалтинге и аутсорсинговой разработке программных продуктов на платформах Salesforce, 1С, Битрикс24; 500+ клиентов по всему миру; профессиональный рост и развитие в команде экспертов.",
  "keywords" : [ "Java", "Hibernate", "CSS", "PostgreSQL", "HTML", "Spring", "ООП", "REST API", "English", "MS SQL", "Git", "MySQL", "Английский — B1 — Средний" ]
}, {
  "url" : "https://rabota.by/vacancy/110123601?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "IDF Technology",
  "textContent" : "IDF Technology – успешная IT-компания, специализирующаяся на кредитном скоринге, Data Science и финансовых цифровых технологиях. И мы приглашаем DevOps стать частью нашей компании! Задачи: построение CI/CD; автоматизация развертывания и настройка окружения; работа с дата-центрами (Selectel, Aws, DO); администрирование оборудования и ПО виртуальных и реальных сред, тестирование и программный тюнинг серверных платформ; предупреждение сбоев, оперативное реагирование на инциденты, способные привести к остановке работы сервисов; поддержка и развитие IT-инфраструктуры офиса разработчиков и удаленных специалистов; организация противодействия DoS/DDoS-атакам (использование механизмов дата-центра и собственных наработок). Чего мы ждем от вас: Уверенные знания OS Linux; Понимание DevOps lifecycle, основных концепций (СI/CD, CM, IaC); Опыт с Jenkins, Jenkins declarative pipelines обязателен и/или с GitLab Ci; Опыт сборки и траблшутинга Java приложений (Gradle + Maven); Опыт с Docker обязателен (траблшутинг, написание Dockerfiles и docker-compose); Знание хотя бы одного из CM инструментов (Chef или Ansible); Опыт написания скриптов на Bash, Python; Опыт работы с Nomad и Consul. Условия: Заработная плата, привязанная к курсу валют; Годовой бонус; Оплата участия в профильных конференциях, митапах и т.д.; Компенсация занятий иностранным языком и спортом; ДМС после испытательного; Режим работы, уважающий биоритмы каждого отдельного сотрудника; Отпуск 28 дней + 5 sick days; Адекватный менеджмент, отсутствие бюрократии; сильная и действительно дружная команда; Весёлая корпоративная жизнь (тимбилдинги, мероприятия и корп.подарки).",
  "keywords" : [ ],
  "addressString" : "Минск, Интернациональная улица, 36"
}, {
  "url" : "https://rabota.by/vacancy/108323434?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО КлеверДев Софтваре",
  "textContent" : "We are #hiring! Are you a Java Developer looking for anunique experience career in a fast growing up-and-coming company? CleverDev Software offers great opportunities for career advancement, competence improvement, and contribution to great inspiring projects. Your Responsibilities As a #javadeveloper you will work on: ● web application (server side) development and support; ● data acquisition services (http requests) development using Amazon Lambda serverless technology; ● REST API for Angular implementation of Single Page Application (design of database for storage of entities, CRUD development of services); ● data import from external systems via REST API and authorization implementation via OAuth2; ● code review. Our Requirements You are a perfect candidate for us if you meet the following mandatory requirements: ● at least 1 years of commercial development experience in Java; ● database design experience; design patterns ● RESTful interfaces ● Concurrency/multithreading ● One or more databases like PostgresQL, Oracle, Mongo DB, MS SQL Server ● SDLC and CI/CD ● Unit testing ● Clean code concepts ● Spring or similar frameworks ● JDBC, Hibernate, JPA, Spring Data ● Kafka, JMS or MQ technologies ● Hands on with Cloud (Azure, AWS, GCP, etc.) ● Docker, Kubernetes. ● English at the document reading level Preferable requirements: Knowledge of one of cloud platforms such as AWS or GCP, Azure (rare) AWS Cloud: Knowledge of: Lambda, DynamoDB, Hive, API Gateway, ElasticSearch, Cloudwatch, Kinesis, S3, EC2, Firehose, SQS, CodePipeline, CodeBuild, Aurora GCP: e.g., Google Cloud Compute Engine, Google Cloud Load Balancing, Google Kubernetes Engine, Google Cloud Looker Azure: Cloud Native Azure Solution, Azure Integration, Azure Cosmos DB Cassandra API Our Work Format Our company encourages Flexible Work Format — you can work from home or in our cosy office. Our teams use Jira for tasks settings, and Confluence for project descriptions. Our Terms We are sure you would love working with us as we provide: ● formal employment; ● competitive compensation depending on your experience and skills; ● regular assessments campaign; ● open free control style; ● corporate English courses; ● cool office-parties every month; ● friendly environment of communication and cooperation. Feel free to contact CleverDev Software at any time!",
  "keywords" : [ "AngularJS", "Java", "Spring Framework", "Hibernate ORM", "SQL" ],
  "addressString" : "Минск, Грушевка, Михалово, проспект Жукова, 29"
}, {
  "url" : "https://rabota.by/vacancy/110064832?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Itransition",
  "textContent" : "Кого мы ищем? Ты также заканчиваешь учебу в университете? Твоя нынешняя работа не приносит тебе удовольствия, и ты заинтересован в карьере в IT? Ты одержим программированием и ищешь место, где сможешь применить свои навыки в кодинге? Что мы предлагаем? Возможность стартовать свою карьеру в IT с нуля: Прими участие в интенсивной трехмесячной бесплатной программе индивидуального обучения с поддержкой наставника. После успешного завершения обучения приглашаем тебя в нашу команду! Тебя ждет трудоустройство и участие в проектах для таких известных компаний, как Mercedes-Benz, Diageo, adidas, Whirpool, Shell и других. Кто мы? Опытный игрок на рынке QA с командой из более 1000 специалистов. Каждый сотрудник компании прошел этот путь и все готовы поделиться своим опытом с тобой! Какие навыки важны для нас? Базовое понимание Java, C# или JavaScript. Базовые знания объектно-ориентированного программирования (ООП). Уровень английского языка не ниже B1. Готовность полностью погрузиться в обучение и работу – 40 часов в неделю. Как подать заявку? Пожалуйста, отправь свое резюме на английском языке. Особое внимание удели своим навыкам программирования, своему текущему местоположению и своему уровню владения английским языком.",
  "keywords" : [ "QA", "Автоматизация тестирования", "Java", "С#", "JavaScript", "Тестирование", "Аналитическое мышление", "Английский — B1 — Средний", "Английский язык" ]
}, {
  "url" : "https://rabota.by/vacancy/108851432?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО IDT Technologies",
  "textContent" : "Product: The Stored Value Platform (SVP) - the platform of various web services both internal and external. It is the back-end service that enables IDT to sell and service prepaid debit cards that are accepted on the Visa and network in the US. SVP works with 3rd party systems and organizations, such as card printers, processing centers, and banks. Requirements: Experience 0,5 years+. Basic knowledge of Java Core and Java J2EE. Hands-on experience with Spring Boot, Spring Core, and Hibernate Exposure to working with Docker. Experience with Oracle and MongoDB. Basic understanding of algorithms and how to apply them in problem-solving Experience with CI/CD: Jenkins. Solid Git skills, including familiarity with merge, rebase, and cherry-pick operations, etc. Awareness of Clean Code principles (willingness to learn and apply them). Experience conducting code reviews and ensuring test coverage is met and maintained. English B1. Nice to have: Experience with Kubernetes (K8s) is a plus. Experience with AWS as a plus. Responsibilities: Develop microservices in Java and Spring Boot. Creating Docker images and Kubernetes chartres for deploying services both to on-prem and AWS cloud infrastructure. Working with both relational(Oracle) and non-relational(MongoDB) databases. Migrating data from oracle to mongoDB. Participating in scrum team activities(Daily meetings, planings, gromings, retrospectives). Covering code with automated tests. We are pleased to offer you: Modern office with free parking in the very center of Minsk. Remote/ hybrid work opportunity! An exciting and challenging job with talented people around. Competitive salary and growth opportunities. Really good hardware. 26 vacation days & 5 fully covered sick days without sick leave required per year. Compensation for professional training, seminars, and conferences. Sports activities reimbursement. Medical insurance. First-class English lessons. A few words about us: IDT Corporation is a global communications company founded in 1990 and headquartered in Newark, New Jersey. We are industry leaders in prepaid communication and payment services and one of the largest international voice carriers. We are listed on the NYSE, employ over 1800 people across 20 countries, and have over $1.5 billion in revenues. We are not ”another big IT corporation”— we encourage and support in-house entrepreneurs in developing their ideas into business actions.",
  "keywords" : [ "Jenkins", "English B1", "Hibernate", "Docker", "J2EE", "MongoDB", "Spring Boot", "Spring Core", "Java Core" ]
}, {
  "url" : "https://rabota.by/vacancy/108746719?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Софтвейл",
  "textContent" : "Добрый день! Компания «Софтвейл» приглашает студентов 3 и 4 курсов на неоплачиваемую стажировку с возможностью последующего трудоустройства по направлению Java / AEM. Мы занимаемся разработкой ПО для международных рынков — Германии, Италии и США — и работаем в полностью удаленном формате, с фиксированной заработной платой в долларах США. Для участия в стажировке необходимо владение следующими технологиями: Java, Maven HTML / CSS, JavaScript SQL базы данных Приветствуется знание следующих технологий: Docker, Kubernetes NoSQL базы данных Если вас заинтересовало наше предложение, пожалуйста, отправьте нам на почту следующую информацию: Ваше резюме (CV): 1-2 страницы в формате PDF Сопроводительное письмо (Cover Letter) с описанием выполненных вами задач и любыми дополнительными сведениями, которые вы хотели бы добавить к вашей заявке Ссылка на репозиторий с вашими проектами (если есть) Уровень владения английским языком (минимальный уровень — B1) Также можно указать любые другие технологии, с которыми вы работали. С уважением, Команда «Софтвейл»",
  "keywords" : [ "Apache Maven", "Java", "CSS", "NoSQL", "Docker", "JavaScript", "HTML", "SQL", "Kubernetes" ]
}, {
  "url" : "https://rabota.by/vacancy/108797555?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Международный деловой альянс",
  "textContent" : "Компания \"Международный деловой альянс\" приглашает в свою команду Java-разработчика Требования к кандидатам: Наличие опыта работы на стажировке или участие в учебных проектах (также учащиеся последних курсов IT-направлений); Базовые знания ООП, SQL (MySQL, MariaDB), Java EE, Spring, Hibernate, Maven. Личные качества: Умение работать самостоятельно; Прилежность и ответственность; Энтузиазм и желание учиться новым технологиям и подходам; Умение воспринимать обратную связь и улучшать свои навыки. Своим сотрудникам мы предлагаем: Оформление в соответствии с трудовым законодательством РБ; Оплачиваемый отпуск 30 календарных дней; Обслуживание в медицинских центрах с дотацией компании; Поддержка спортивных активностей сотрудников; Занятия спортом в многофункциональном спортивном центре рядом с офисом; Корпоративные скидки и льготы.",
  "keywords" : [ ]
}, {
  "url" : "https://rabota.by/vacancy/110000094?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Программные решения плюс",
  "textContent" : "Компания приглашает мотивированных разработчиков, готовых решать серьезные задачи и разрабатывать системы с использованием современных технологий. Локация: Минск. Мы ожидаем от вас: Хороший уровень знаний JavaEE, глубокое понимание принципов ООП; Профильное образование (IT / технический); Аналитические способности, умение работать в команде, ответственность; Плюсом будет: Знание Spring Framework, Spring MVC, Spring Boot; Мы предлагаем: Доброжелательный коллектив, офис в современном бизнес-центре столицы; Интересные долгосрочные проекты, современный стек технологий; Возможность приобрести опыт работы с командой профессионалов, в течение 20-ти лет занимающихся созданием высоконагруженных систем; Офисный формат работы; Достойную заработную плату по результатам собеседования;",
  "keywords" : [ "Java EE", "ООП", "Spring Framework", "Английский — B2 — Средне-продвинутый" ],
  "addressString" : "Минск, Институт Культуры, улица Казинца, 11А"
}, {
  "url" : "https://rabota.by/vacancy/110252846?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО ВЭБ Технологии",
  "textContent" : "ВЭБ Технологии приглашает Java Developer'а : - Middle с опытом 2-3+ года коммерческого для расширения команды и работы на Fintech проектах. Проекты: Всестороннее развитие инфраструктурных компонент заказчика, реализация высоконагруженных и отказоустойчивых сервисов с нуля. Стэк:Java 17+, Spring-Boot, Spring JPA, Spring Security, Cloud, K8S, Helm, GitLab AutoDevOps, Redis, PostgreSQL, JUnit, Mockito, Wiremock, Spock, Pact, Prometheus, Grafana. Задачи: Реализация новых сервисов и сопровождение существующих; Проектирование компонентов программного продукта; Код-ревью и контроль процесса разработки на проекте; Участие в процессе непрерывного развития процесса разработки в компании; Менторинг сотрудников; Декомпозиция и оценка задач. Необходимые навыки: Уверенное знание и практический опыт работы с Spring Framework (Boot, Data, Security); Уверенное знание и практический опыт реализации улучшений во все стадии SDLC; Понимание концепции TDD и практический опыт применения в разработке; Опыт реализации ПО от проверки требований до поставки в продакшен. Будет плюсом, если есть: Опыт управления процессами разработки и адаптация их под требования проекта; Уверенное владение техниками декомпозиции и оценки задач; Менторинг и составление PDP для коллег в технической плоскости; Опыт разработки ПО в области FinTech; Понимание принципов и ценностей DevTestSecOps. Мы предлагаем: У нас расширенный соц пакет (читайте в описании нашей компании); Достойный уровень заработной платы; Больничный оплачивается по ТК РБ; 29 дней отпуска; Оплату обучения за счет компании( тренинги, семинары, конференции); Работу в центре Минска (ст.м. Молодежная); Возможность удаленной\\гибридной работы по согласованию; У нас кабинеты (не open space).",
  "keywords" : [ ],
  "addressString" : "Минск, Молодежная, улица Скрыганова, 6/3"
}, {
  "url" : "https://rabota.by/vacancy/110145296?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО ФП-ТРЭЙД",
  "textContent" : "CompleteSoft в поиске двух новых коллег, которые пишут Java: Senior и Middle уровня. Мы компания, которая занимается разработкой проектов на аутсорсе и развитием собственных продуктов. Будем рады вашим откликам:) Чем предстоит заниматься: Анализ требований, проектирование решений совместно с командой. Разработка новой функциональности бэк части программных продуктов. Построение архитектуры проектов в части бэкенд. Требования: Иметь реальный опыт разработки коммерческих продуктов с использованием Jаva от 5 лет. Глубокие знания и профессиональное владение технологиями Java: JPA, JMS, JAXB, JAX-WS, JAX-RS, spring-окружение. Знание и уверенное применение ООП, опыт в работе с веб-сервисами (SOAP, Rest). Опыт реализации интеграций с внешними системами через WEB сервисы и REST/SOAP API. Опыт работы с фреймворками. Опыт работы с системами контроля версий. Опыт работы с Jira, Conﬂuence, YouTrack. Создание и поддержание внутренней технической документации в актуальном состоянии. Понимание и опыт работы с очередями сообщений (Rabbit, ActiveMQ). Опыт декомпозиции задач, определения трудоемкости и сроков разработки. Мы ожидаем: Нацеленность на реализацию качественных решений. Готовность взять на себя ответственность за техническую реализацию. Обладание системным мышлением, аналитическим складом ума и способность увидеть «систему», разложив её на составляющие, упорядочить их и увидеть взаимосвязи. Условия: Гибридный график работы. 4 sick days в год без справок. Отпуск 25 календарных дней. Гибкое начало рабочего дня.",
  "keywords" : [ "Java", "Git", "Scrum", "Разработка ПО" ],
  "addressString" : "Минск, Академия наук, улица Платонова, 49"
}, {
  "url" : "https://hh.ru/vacancy/110134346?query=java",
  "companyName" : "Гроу Медиа",
  "textContent" : "Привет, будущий коллега! Grow Media – это рекламное агентство. Наши продукты - это различные сервисы для рынка performance маркетинга, а также собственные мобильные приложения. Основные рынки работы – США, Европа, Латинская Америка и Азия. Мы находимся в поиске тестировщика приложений и игр / QA Engineer (Games and Apps) в нашу команду по созданию мобильных приложений! Нам нужен тот, кто умеет искать баги, ломать приложения, уметь фиксировать пути воспроизведения найденных неполадок, а в идеале - знать что нужно исправить для их фикса. Обязанности: тестирование приложений и игровых проектов компании; контроль качества проектов компании на платформах Android и iOS; подготовка тестового окружения для проведения тестирования; проведение ручного и регрессивного тестирования; поиск ошибок локализации; оформление баг-репортов; контроль исправления багов; написание и поддержка тестовой документации (тест-планы, тест-кейсы и чек-листы); взаимодействие с разработчиками и другими сотрудниками компании. Пожелания к кандидату: знания, необходимые для развёртывания системы тестирования с нуля; опыт тестирования приложений и игр на Android и iOS; хорошее понимание принципов и методик тестирования; большой игровой опыт на мобильных устройствах; опыт работы с Android Studio (ADB) и Xcode; понимание процесса разработки и жизненного цикла ПО; представление о принципах работы клиент-серверных приложений, баз данных; умение работы с Git и сборкой билда; работа с документами в Google Docs. Желательные: опыт тестирования рекламных SDK; опыт тестирования инструментов аналитики Firebase и Branch; анализ данных производительности Unity проектов (Profiler); знания языков программирования (приоритет: C#, JavaScript, TypeScript, ReactNative, Java); опыт разработки игр и приложений на Unity и React Native; уровень английского языка не ниже B1. Что используем: платформы: Android, iOS; магазины приложений: Google Play, App Store; языки разработки приложений: C# (Unity), React Native (JavaScript); документация: Notion, Google Docs; таск-трекинг: Trello; система контроля версий: Git; общение: Slack. Условия: занятость частичная. На данном этапе от 10 до 20 часов в месяц, к сентябрю планируется увеличение загрузки; оплата почасовая. Пожалуйста, пишите ожидаемую стоимость часа в сопроводительном письме при отклике на вакансию; удаленка.",
  "keywords" : [ "Английский — B1 — Средний" ]
}, {
  "url" : "https://rabota.by/vacancy/109731203?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Белорусские облачные технологии",
  "textContent" : "Обязанности: разработка программного обеспечения (далее – ПО) в соответствии с поставленными задачами; тестирование, отладка разработанного ПО, доработка ПО при уточнении требований к ПО; интеграция программных компонентов; администрирование и модернизация разработанного ПО; документирование исходного кода на основе комментариев; понимание процессов взаимодействия ПО с задействованными системами и умение объяснять данные процессы техническому писателю для создания пользовательской документации; написание документации для разработчика; Требования к соискателю: опыт коммерческой разработки от 6 мес.; опыт и понимание работы CRM систем; Опыт работы со следующими технологиями: -java; -groovy; -bitrix; -базы данных (PostgreSQL); -написание SQL запросов; - linux; знание архитектурных принципов построения информационных систем: понимание микросервисной архитектуры; понимание различных видов интеграций систем, в том числе асинхронных, очередей задач; понимание архитектуры REST и принципов построения RESTful-сервисов; понимание форматов XML, JSON; Будет «плюсом»: опыт работы с Docker, Git; опыт работы с БД (PostgreSQL); опыт работы с консолью разработчика в браузере; опыт в разработке либо интеграции с CRM-системами; создание документации к написанному ПО; способность доносить мысли (устно и письменно) простым доступным языком; аналитическое мышление, умение анализировать большие данные и делать выводы. Условия: работа в центре города; официальное трудоустройство; добровольное медицинское страхование; оплачиваемый ФОК; оплата мобильной связи; официальная стабильная заработная плата; бонусы по результатам работы; возможности для профессионального роста (обучение и тренинги, корпоративный английский); хорошо оборудованное рабочее место.",
  "keywords" : [ "Java", "restful", "1С-Битрикс", "PostgreSQL", "JSON", "Groovy", "WSL", "REST", "Git", "Docker", "Linux", "XML", "Python", "CRM" ],
  "addressString" : "Минск, улица Клары Цеткин, 24"
}, {
  "url" : "https://rabota.by/vacancy/109076984?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Вэльюсофт",
  "textContent" : "Valuesoft - компания (входит в ПВТ), специализирующаяся на разработке собственного продукта для анализа спортивных событий и котировок букмекерских контор. Наша цель - предоставить клиентам инструменты и технологии для принятия обоснованных решений в области спортивных ставок. Обязанности: Java-программист для сканирования и парсинга сайтов букмекерских контор Требования: Опыт извлечения данных из веб-страниц и обработка их Понимание того, как работают http(s)/ajax - запросы Понимание того, как устроены html/xml/json разметки Базовые знания работы JavaScript (понимание основных концепций и возможностей языка) Умение писать читаемый и структурированный код (корректные и осмысленные названия переменных/методов/классов) В тествой задаче, помимо ответа, добавьте примечание что дочитали до этого пункта Понимание алгоритмов и структур данных имеющихся в базовом SDK (Collection, Map, Stream, работа с потокам и т.п) Знание регулярный выражений Опыт работы с git Условия: Официальное трудоустройство Мед. страховка Работа бок о бок со всеми кто разрабатывает и принимает ключевые решения по развитию продукта Просторный офис недалеко от метро (10 мин пешком) По мере роста опыта - привлечение к большему количество разнообразных и интересных задач Плавающий график . Т.е. будет 2 выходных, но они могут быть в другие дни помимо субботы и воскресенья (по предварительной договоренности с работником)",
  "keywords" : [ "Java" ]
}, {
  "url" : "https://rabota.by/vacancy/108550901?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО 3с Креатив",
  "textContent" : "Для поддержания и развития проекта будем рады принять на работу специалиста имеющего опыт разработки на Kotlin/Java для backend от 3-х лет. Обязанности: Разработка нового функционала и развитие существующего на Kotlin/Java с использованием Spring Framework. Требования: Профессиональное владение Kotlin или Java, Spring Framework, Spring MVC, PostgreSQL, MongoDB, Gradle, Hibernate. Опыт применения реактивного программирования. Плюсом является опыт работа с Redis, Kafka, понимание k8s, docker. Отличное знание и понимание концепции ООП, шаблонов проектирования, Linux/Ubuntu Server. Самостоятельность, ответственность, аккуратность в оформлении документации. Опыт использования современных средств и процессов разработки приложений (git, CI/CD, code review и т.д). Условия: Удалённая работа с гибким графиком, с оформлением самозанятым по ТК РБ. Размер зарплаты определяется на собеседовании на основании опыта работы и наличия необходимых знаний.",
  "keywords" : [ "RabbitMQ", "Java", "REST API", "Git", "PostgreSQL", "Docker-compose", "Apache Kafka", "gRPC", "SQL", "Intellij IDEA" ]
}, {
  "url" : "https://rabota.by/vacancy/104890170?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Софтнетикс",
  "textContent" : "Компания Softnetix ищет на новый проект Backend Kotlin Developer'ов (формат работы - офис Минск, Немига 5). Описание проекта Проект представляет собой систему агрегации и анализа информации. На backend'e используется сервис-ориентированная архитектура. Для написания сервисов используются Kotlin. Требования: Хороший уровень любого из языков (Java, Kotlin, Scala) Опыт работы с SQL Понимание OOP, SOLID Знание паттернов проектирования Опыт работы с любым фреймворком (Ktor, Quarkus, Vert.x, Axon Framework, Akka, Micronaut, Play Framework, Spring) Опыт работы с системами сборки Gradle или Maven Опыт работы с системами контроля версий Git или Mercurial Базовые знания Docker Базовые навыки работы с командной строкой Linux Преимуществами будут: Знание принципов DDD Знание паттерна Event Sourcing Понимание принципов асинхронного программирования (Kotlin Coroutines) Понимание сервис-ориентированной/микросервисной архитектуры PostgreSQL (JOOQ, JDBC, R2DBC) WebSockets GraphQL Kafka Redis Cassandra, ScyllaDB ClickHouse Nginx Kotest, Mockk, Testcontainers GitLab CI/CD pipelines Docker swarm / Kubernetes Условия: Работа из комфортного офиса в центре Минска (Немига) Столы с регулировкой высоты, 27\" 4k мониторы, современное железо (Ryzen 9 7950X, Intel Core i7 14700KF) Частые пересмотры ЗП (performance review) Чёткий план карьерного и профессионального роста Полностью оплачиваемые больничные Отпуск 28 дней, возможность брать отпуск по частям Гибкое начало рабочего дня (до 10:30) и отсутствие микроменеджмента Корпоративные курсы английского языка, корпоративные ивенты",
  "keywords" : [ "Java", "Nginx", "Паттерны проектирования", "PostgreSQL", "Kafka", "Redis", "HTTP", "Microservices", "SQL", "Kotlin", "ООП", "Backend", "Git", "NoSQL", "Linux", "Docker", "Clickhouse", "SOLID", "Gitlab" ],
  "addressString" : "Минск, Немига, Октябрьская, Площадь Ленина, Юбилейная площадь, улица Немига, 5"
}, {
  "url" : "https://rabota.by/vacancy/110681061?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Сампад",
  "textContent" : "ООО \"Сампад\" в связи с расширением приглашает в свою команду Системного Аналитика, которому интересно развиваться в направлении менторства/обучения менее опытных аналитиков. Несколько слов о нас: Сампад - это команда талантливых профессионалов в сфере разработки, тестирования и сервисной поддержки программных продуктов. С 2013 года мы успешно реализовали более 250 проектов для рынков США и Западной Европы, а также стран СНГ. Среди наших клиентов – стартапы и крупные международные компании из финансовой и страховой сфер, здравоохранения, туризма, ритейла, образования и т.д. Основные технологические направления - Python, Java, .Net, iOS, Android. Мы предлагаем: Позицию системного аналитика, который будет работать на коммерческом проекте крупных заказчиков, а также заниматься обучением менее опытных системных аналитиков в рамках нашей лаборатории. Проект 1: Платформа для продажи телекоммуникационного оборудования, которая имеет развернутый каталог с более чем 20 тыс. товаров, а также с возможностью заказать и оплатить товар. Проект 2: Проект направлен на расширение функциональности коробочного CRM решения, его адаптацию под нужды пользователей и интеграция с внутренним ПО компании и обеспечение консистентности данных при их миграции в/из CRM системы. Чего мы ждем от специалиста? Коммерческий опыт работы Системным аналитиком от 3-х лет; Наличие высшего образования; Наличие крепкой теоретической базы по системному анализу; Наличие опыта или интереса к менторству; Навык формирования базы знаний; Навык проведения собеседований; Навык проведения презентаций; Развитые лидерские качества; Грамотная речь; Самостоятельность и ответственность. В рамках проектной работы важно иметь: Опыт работы с требованиями (сбор, анализ, документирование и коммуникация требований); Понимание принципов работы с СУБД, опыт работы с SQL-запросами средней и повышенной сложности; Опыт постановки задач разработчикам программного обеспечения и контроль их исполнения; Опыт работы с брокерами сообщений (Kafka, Rabbit MQ); Понимание принципов ООП; Понимание и опыт работы с различными видами интеграций и информационных систем; Подготовка прототипов экранных форм; Опыт работы с BPMN и UML-схемами; Опыт использования различных методологий ведения проектов; Уверенное владение JIRA/Confluence Своим сотрудникам мы предоставляем: Современные проекты в сферах Fintech, Healthcare, Education, где есть возможность реализовать свой потенциал и поучаствовать в создании центра компетенций; Ежегодное профессиональное ревью с выявлением сильных и слабых сторон и разработкой плана профессионального развития; Сплоченное SA-коммьюнити; Конкурентная заработная плата; Атмосферу взаимоуважения и доверия, стимулирующую личное развитие, и помощь в реализации новых идей; Индивидуальный план развития и регулярные performance review; Новый комфортный офис с оборудованной кухней, велопарковкой, душем и лаунж-зоной в самом центре Минска по адресу Интернациональная 20А (8 минут пешком от станций Октябрьская, Немига и Купаловская); Гибкий и удобный режим работы в офисе или удаленно; Регулярные внутренние митапы и knowledge sharing внутри компании; Материальная поддержка и оплачиваемые выходные в дни значимых событий (свадьба, рождение ребенка и т.п.); Денежные бонусы за рекомендации специалистов в рамках реферальной программы; Корпоративное обучение английскому языку; 25 календарных дней отпуска; Отсутствие бюрократии и микроменеджмента. Заинтересовало? Тогда откликайся! Будем рады рассказать больше о компании на встрече с нами!",
  "keywords" : [ "RabbitMQ", "ООП", "BPMN", "Системный анализ", "СУБД", "UML", "Atlassian Jira", "Apache Kafka", "Системная интеграция", "Atlassian Confluence", "SQL" ]
}, {
  "url" : "https://rabota.by/vacancy/110418964?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Бэлл Интегратор",
  "textContent" : "Вакансия: Automation QA Engineer Формат работы: удаленный формат работы Компания: BELL INTEGRATOR – крупный системный интегратор страны. На текущий момент с нами работает более 2500 высококлассных аналитиков, руководителей проектов, разработчиков, тестировщиков и специалистов по сопровождению крупных информационных систем. Bell Integrator активно реализует проекты по всей России, среди наших заказчиков – ведущие системообразующие финансовые, телеком и ритейл компании страны. Офисы Bell Integrator расположены в Москве, Нижнем Новгороде, Пензе, Саратове, Уфе, а также в Минске. Проект: финтех проект в ондом из крупнейших банков Основные требования: • Опыт в автоматизации тестирования от 2-3х лет • Опыт в автоматизации тестирования клиент-серверных приложений (обязательно - API, WEB, MQ, DB); • Знание в Java stream api + functional interfaces + модификаторы +- реализацию ООП концепций; • Опыт разработки тестовой документации (чек-листы, планы, отчеты); • Умение находить/формулировать/предлагать решения; Условия: • Конкурентоспособная заработная плата • Удаленный формат работы • Корпоративное обучение и сертификацию в технических и бизнес областях • Широкие возможности для карьерного роста и профессионального развития • Корпоративные развлекательные программы • Корпоративная программа частичной компенсации занятий по английскому языку (партнер Skyeng) • Корпоративная программа частичной компенсации занятий спортом (партнер All Sports) Откликайтесь, и мы с радостью рассказажем вам больше о компании, а также подробее расскажем об этом и других проектах нашей компании :) Будем рады видеть вас в нашей команде!",
  "keywords" : [ "RabbitMQ", "Java", "MQ", "Apache Kafka", "SQL" ]
}, {
  "url" : "https://rabota.by/vacancy/108613407?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Альфа-Банк: IT-направление и цифровой бизнес",
  "textContent" : "Альфа Банк – один из ведущих частных банков, который входит в число системно значимых банков Беларуси. Мы работаем как финтех-компания, интегрируя в свою бизнес-модель успешные практики в области мобильных платежей, онлайн-кредитования, цифровых транзакций и других передовые технологии. Сейчас в Альфе более 60 тысяч бизнес-клиентов и почти миллион клиентов-физлиц. Сегодня в команде Альфа Банка более 2500 профессионалов. Мы объединяем людей с разным опытом, взглядами и интересами. Присоединяйся к команде. Вместе мы способны на большее! Ключевые задачи: разработка логики бизнес-процессов в рамках облачной системы; разработка модульных и интеграционных автотестов; проектирование Solution-архитектуры; разработка микросервисных приложений; Пожелания к кандидатам: опыт разработки приложений на Java от 4 лет; опыт разработки Enterprise-решений с использованием Spring framework; опыт реализации микросервисных приложений; опыт в автоматизации тестирования на unit и integration уровнях; Стек технологий: Java, Spring, PostgreSQL, MongoDB, Redis Что предлагаем для твоего комфорта: работу в команде с высокой экспертизой; современный стек технологий, масштабные проекты и сильную команду; мощное железо для работы; формат работы на выбор (удаленный/гибкий график); сочетание стабильности банка и гибкости ИТ; Альфа Среду (серию митапов о цифровой трансформации банка).",
  "keywords" : [ "Java", "Maven", "PostgreSQL", "Spring Framework", "Scrum", "Разработка ПО" ]
}, {
  "url" : "https://rabota.by/vacancy/108610108?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО ПлатформИО / ULTRALAB",
  "textContent" : "О нас: Platform.io - это продукт для рекламных сетей, позволяющий быстро выводить на рынок новые форматы рекламы. В 2018 на нем мы запустили сеть, позволяющую разместить рекламу в push-уведомлениях. В 2020 мы превратили ее в мультиформатную рекламную сеть. Наш фокус - нестандартные (инновационные рекламные каналы, основной из которых - пуш-уведомления. Сегодня мы в топе сетей по охвату аудитории в пушах. Мы помогаем: Рекламодателям - получать новых клиентов, эффективно расходуя рекламный бюджет. Площадкам - максимизировать прибыль со своего контента. Сегодня мы ищем Product Manager, который будет развивать с нами новое направление внутри компании. Ожидаем от вас: Опыт работы на схожих позициях от 2-х лет; Уверенный математический фундамент (алгебра, статистика, теория вероятностей); Python, MySQL (или опыт с любой другой реляционной БД), Druid/ClickHouse (или опыт с любой другой БД колоночного типа для больших объемов данных); Знание основных алгоритмов и метрик ML; Английский язык (нужен для понимания статей, чтения документации, общения со стейкхолдерами задач); Готовность к постоянному совершенствованию навыков, обучению; Будет плюсом: Опыт работы в digital marketing сфере; Владение Airflow; Основы Java; Опыт подготовки и выведения моделей в production; Опыт работы с Data Warehouses и Data Lakes любого типа. Задачи на проекте: Поиск инсайтов в данных, формулирование и проверка гипотез, выбор, обучение и проверка модели оптимизации рекламных метрик; Дизайн экспериментов, их запуск, оценка результатов, выводы, предоставление рекомендации для бизнеса; Подготовка модели для использования в production; Что мы предлагаем: Работайте удаленно из дома, из офиса в Минске; Мы компенсируем занятия спортом, медицинское обслуживание, языковые курсы, персональное развитие(курсы/митапы);",
  "keywords" : [ "PostgreSQL", "MySQL", "Clickhouse", "Python", "SQL" ]
}, {
  "url" : "https://rabota.by/vacancy/109877762?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО НитСофт",
  "textContent" : "NeatSoft - IT-компания, специализирующаяся на разработке веб- и мобильных приложений с 2016 года. Мы работаем с клиентами из различных стран мира и успешно реализовали проекты в странах СНГ и Западной Европы. Наши проекты включают как продуктовую разработку (например, logtime.me и mybase.pro), так и аутсорсинг разработки. Работаем с такими технологиями как: Angular; React; VueJS; NodeJS; NestJS; Yii2; Laravel; DevOps Tools; Flutter, Java. Мы находимся в постоянном развитии и ищем Vue.js developer для нашей команды. Что мы ожидаем: Знание и опыт разработки на Vue. Отличные знания JavaScript, HTML, CSS, SCSS (HTML5, CSS3). Уверенные знания TypeScript. Умение работать с REST API и другими веб-сервисами. Понимание ООП и основных паттернов проектирования (SOLID, DRY, KISS и т.д.). Опыт работы с Git, продуктами Atlassian (Jira). Базовые навыки использования Docker, сред контейнеризации. Будет плюсом: Опыт коммерческой разработки на Vue.js от 1 года. Знание и опыт работы с Angular/React. Опыт работы с базами данных, включая SQL и NoSQL. Знание и опыт работы с XML. Опыт работы с Vuex и Vue Router. Понимание принципов построения SPA. Опыт написания тестов с использованием Jest или Mocha. Знание и опыт работы с WebSocket и GraphQL. Ценные для нас навыки: Хорошо развитые коммуникативные и аналитические способности. Умение работать в команде и брать на себя ответственность. Английский язык уровня B2 и выше. Мы предлагаем: Дружественную и уютную атмосферу, удобное расположение офиса. Комфортное рабочее место с чаем, кофе и печеньем. Нескучные задачи без бюрократии и формализма. Заработную плату, привязанную к курсу USD. Гибкий график работы с плавающим началом рабочего дня. Бонусы и премии по результатам работы и значимым событиям. Если вы заинтересованы в этой вакансии и соответствуете указанным требованиям, мы будем рады видеть вас в нашей команде!",
  "keywords" : [ "TypeScript", "Vue.js", "Git", "JavaScript", "Vue", "React", "Английский — B2 — Средне-продвинутый", "Angular", "Английский язык" ],
  "addressString" : "Минск, Грушевка, Михалово, Петровщина, улица Карла Либкнехта, 66"
}, {
  "url" : "https://rabota.by/vacancy/108955928?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "IDF Technology",
  "textContent" : "IDF Technology – успешная IT-компания, специализирующаяся на кредитном скоринге, Data Science и финансовых цифровых технологиях. И мы приглашаем Java developer стать частью нашей компании! Задачи: Разработка нового функционала; Переписывать монолит на микросервисную архитектуру; Проводить аудит текущих решений на предмет идей улучшений; Профайлинг, оптимизация и рефакторинг существующих решений. Требования: Java; Spring Framework; Hibernate ORM; Gradle; JPA; MySQL. Для нас важно: Глубокое понимание ООП и шаблонов проектирования; Понимание концепции микросервисов и умение писать масштабируемые системы; Коммерческий опыт на Java от 3-х лет. Стек проекта: JAVA 17; Kotlin; Spring Framework; Infrastructure - Docker, ELK, Netflix stack (Swarm, Consul, Vault, Hystrix, Kibana, Grafana, Prometheus, Haproxy); Mongo, GridFS, Redis, ElasticSearch, RabbitMQ, Kafka, MySql, JavaEE (JPA, JAX-RS), Glassfish; ORM - Hibernate, Jooq; Testing - on Spock, JUnit, Mockito, RestAssured; Build - Gradle, Maven. Условия: Заработная плата, привязанная к курсу валют; Годовой бонус; Оплата участия в профильных конференциях, митапах и т.д.; Компенсация занятий иностранным языком и спортом; ДМС после испытательного; Режим работы, уважающий биоритмы каждого отдельного сотрудника; Отпуск 28 дней + 5 sick days; Оплата анализов/лекарств/врачей на ковид; Адекватный менеджмент, отсутствие бюрократии; сильная и действительно дружная команда; Весёлая корпоративная жизнь (тимбилдинги, мероприятия и корп.подарки). Присоединяйтесь к нашей команде!",
  "keywords" : [ "Java", "MySQL", "Spring Framework", "Kotlin" ]
}, {
  "url" : "https://rabota.by/vacancy/107773038?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "SaM Solutions Самсолюшнс",
  "textContent" : "Приглашаем на работу опытного системного администратора Линукс с разговорным английским А2-В1 и выше. В задачи будет входить проектирование, создание и поддержка инфраструктуры и инструментов, включая облачные и локальные решения; реализация мониторинга и фреймворков для обнаружения и предотвращения проблем, использование инструментов, таких как Prometheus, Grafana и Zabbix для метрик состояния и производительности системы; разработка и управление протоколами реагирования на инциденты, анализ инцидентов и проведение послеинцидентных ревью; автоматизация инфраструктуры и рабочих процессов с использованием Ansible. Требования: Опыт работы более 5 лет в администрировании Linux и использовании Ansible или аналогов Глубокие знания написания скриптов и программирования на Bash и Python Опыт работы с технологиями контейнеризации (Docker) и инструментами оркестровки(например, Docker Swarm или Kubernetes) Опыт запуска сложных Java-приложений в продакшн (Tomcat), понимание JVM и Java memory management. Мы предлагаем для Вас: Высокий уровень заработной платы, возможность карьерного роста Курсы иностранных языков, тренинги Обучение и повышение квалификации Возможность командировок и деловых поездок Организованные обеды в офисе Собственный тренажёрный зал и другие корпоративные бенефиты Бесплатную медицинскую страховку для обслуживания в лучших мед. центрах Возможна удаленная занятость.",
  "keywords" : [ "Системный администратор Linux", "Linux", "Английский язык" ]
}, {
  "url" : "https://rabota.by/vacancy/108041578?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Клеркгрупп",
  "textContent" : "Находимся в поиске QA Engineer (Fullstack) уровня Middle! Чем предстоит заниматься: Проводить ручное тестирование функционала системы (front, back + интеграция); Составлять необходимую тестовую документацию; Писать UI и API автотесты; Поддерживать и актуализировать существующие автотесты; Анализировать результаты автоматизированного тестирования; Взаимодействовать с командой разработки и смежными командами; Участвовать в улучшениях флоу работы команды. Требования: Опыт работы в ручном тестировании - от 1 года; Знание базовой теории тестирования и процессов разработки ПО; Опыт тестирования микросервисной архитектуры; Опыт подготовки тестовых артефактов (тест-кейсы, чек-листы); Опыт работы с любой TMS; Опыт работы с инструментами тестирования (Chrome DevTools, Postman, Swagger); Опыт составления простых запросов в SQL (PostgreSQL); Опыт разработки автотестов на Java - от 1 года; Опыт работы с Selenide/Selenium - от 1 года; Опыт работы с RestAssured - от 1 года; Опыт работы с XPath - от 1 года; Опыт работы с Git - от 1 года; Понимание и умение применять на практике паттерн проектирования PageObject; Понимание HTTP/REST. Будет плюсом: Поддержка CI/CD в части автоматизации; Опыт работы с Allure / AllureTestOps; Опыт работы с Docker/ Rabbit MQ. Мы предлагаем: Оформление по ТК Республики Беларусь; Стабильную официальную заработную плату; Комфортный, современный офис в Минске либо удаленное сотрудничество; Расширенный социальный пакет.",
  "keywords" : [ "XPath", "Java", "Git", "PostgreSQL", "Swagger", "Selenium", "Postman", "Автоматизированное тестирование" ]
}, {
  "url" : "https://hh.ru/vacancy/109870762?query=java",
  "textContent" : "We are a niche software consulting company and a long-time MuleSoft partner. We provide best-in-class API Management solutions in the Middle East and Europe. Our team of 50 like-minded professionals combines technical expertise with domain knowledge in digital banking, finance, and e-commerce. We embrace proactiveness, continuous learning, team spirit, and commitment to customer success. Responsibilities: CI/CD configuration and setup of testing and production environment, automation using ansible powerful language, Implement modern DevOps tools (at all stages - from infrastructure to service) Create automatic backup systems and maintain infrastructure security Direct and independent communication with a Customer’s DevOps team to ensure the mentioned above Job Requirements: Minimum of 1 year of experience in administering Linux systems - CentOS/RHEL Experience working with monitoring and project statistics visualization systems such as NewRelic / Grafana / Dynatrace etc Setup of DevOps pipelines in Jenkins, Gitlab, Github, ArgoCD Minimum of 1 year experience in writing deployment scripts on Ansible Experience with deploying and supporting applications based on Java stack Proficient use of Docker / Docker Swarm / Docker Compose Proficient use of Kubernetes/OpenShift, Istio Intermediate level of English proficiency in written and oral communication skills Will be a plus: Experience working with Splunk or Elasticsearch Experience working with AWS (EC2, LB, VPC, RDS) Experience in setting up and supporting NFSv4 Nice to have the knowledge of Nginx Proficient in Bash scripting and/or Python We offer: Full-remote mode and flexibility in terms of location to work from 21 days of vacation + 10 days of national holidays’ day offs An exciting project with on-the-edge technology in one of the most dynamic industries A community of professionals to work and have fun together Competitive salary 5 sick days",
  "keywords" : [ "Jenkins", "Docker", "GitHub", "Ansible", "Gitlab", "Английский — B2 — Средне-продвинутый", "Kubernetes" ]
}, {
  "url" : "https://rabota.by/vacancy/108731957?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Софтмакс системы телеметрии",
  "textContent" : "Софтмакс Системы Телеметрии — международная IT-компания с центрами разработки в России и Беларуси. Мы более 15 лет специализируемся на услугах консалтинга и автоматизации для государственных и корпоративных заказчиков нефтегазовой сферы. Приглашаем QA automation на масштабный проект в энергетической отрасли. Обязанности: Настройка окружения, инфраструктуры и скриптов для внутренней автоматизации; Разработка сценариев автоматизированного тестирования; Внедрение процесса автоматизированной проверки кода (включая проверку по ИБ) (SonarQube. SonarScanner, Allure, Junit, Jenkins, Groovy); Автоматизация мониторинга и контроль работоспособности сервисов; Мониторинг производительности приложений и состояния инфраструктуры; Функциональное, интеграционное и нагрузочное тестирование конфигураций 1С; Взаимодействие с командой разработки, проработка совместных решений. Требования: Опыт работы с 1С (1С:Предприятие 8) от 3-х лет; Разработка и поддержка инструментов СI/CD (Jenkins, EDT, Git, OneScript, gitsync, Java, Bash, Shell, Gherkin, Groovy); Администрирование и поддержка окружений (Dev, Test/Stage, Prod); Контроль и автоматизация в тестовой среде; Автоматизация развертывания в боевой среде; Автотестирование проектов (xUnitFor1C, Vanessa-ADD, BDD, Vanessa Automation Gherkin). - очень желательно, если нет, готовы обучать. Условия: Официальное оформление по ТК РБ (контракт) с полностью \"белой\" зарплатой; Возможность взять больничный без больничного: 5 дней в году; Формат работы: удаленный, офис или гибрид в Минске; Пятидневная рабочая неделя, с 9.00 до 18.00; Уровень заработной платы обсуждается индивидуально с успешными кандидатами.",
  "keywords" : [ "Jenkins", "Java", "DevOps", "Git", "Работа с базами данных", "Тестирование", "1С программирование", "CI/CD", "Vanessa-AAD" ]
}, {
  "url" : "https://rabota.by/vacancy/110335664?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Будущее технологий",
  "textContent" : "ИТ-Холдинг Т1 — один из лидеров российского ИТ-рынка, партнёр ключевых производителей и разработчиков в сфере ИТ. По версии аналитических агентств CNews Analytics, TAdviser и RAEX, мы входим в топ-3 крупнейших российских ИТ-компаний. В нашем портфеле уже 70+ востребованных на рынке ИТ‑продуктов и услуг, ключевые – внесены в ЕРРП (реестр российского ПО). В Т1 стабильность и финансовая надежность, а также социальные гарантии гармонично сочетаются с преимуществами ИТ‑компании — открытостью, инновациями и гибридным форматом работы. Мы стремительно растём, масштабируемся и ищем новых специалистов в команду! В рамках финтех‑направления мы разрабатываем инновационные решения для цифровизации финансового сектора: современные финтех‑продукты, системы работы с большими данными и комплексные решения для фронт‑ и бэк‑офисов. В продуктовом портфеле — создание современных высоконагруженных фронтальных систем, омниканальных продуктов и высоконадежных платформ для поддержки банковского бизнеса. Ищем Java разработчиков в департамент Розничного Бизнеса - одно из самых крупных направлений Иннотех, которое занимается разработкой Омниканальной платформы (обслуживание клиентов - физических лиц). Обязанности: разрабатывать новые миĸросервисы, поддерживать и дорабатывать теĸущие; разрабатывать интеграционные сервисы, внутренние сервисы; подготавливать релиз плана перед обновлением сервиса или первого вывода в прод; участвовать в ĸод ревью; участвовать в принятии техничесĸих и архитеĸтурных решениях; участвовать в планировании спринтов, оценĸе и деĸомпозиции задач. Cтек: Java 8-11; Spring/Springboot; PostgreSQL/Oracle, Kafka, Redis; Maven/Gradle; Docker/Kubernetes(или OpenShift). Требования: уверенное владение Java, понимание принципов работы JVM. Знание основных библиотек и шаблонов проектирования; опыт использования Spring Framework (boot, mvc, data, secutity...); опыт работы с многопоточностью и асинхронностью; опыт работы с базами данных, умение писать и оптимизировать запросы; опыт работы с распределёнными хранилищами и системами; знание HTTP, REST, SOAP; понимание особенностей микросервисной архитектуры; опыт работы с фреймворками и инструментами автоматического тестирования (junit, postman, jmeter); высшее образование (физико-математическое или техническое) Мы предлагаем: Интересную работу в стабильной и развивающейся компании; У нас удаленная работа, но есть комфортный и уютный офис в шаговой доступности от ст.м. Купаловская/Октябрьская; Официальное трудоустройство и своевременная оплата труда 2 раза в месяц; Достойный оклад по итогам интервью и система премирования; Добровольное медицинское страхование по окончанию испытательного срока; Материальная помощь к значимым событиям в жизни работника; Дружную и нацеленную на успех команду.",
  "keywords" : [ ]
}, {
  "url" : "https://rabota.by/vacancy/104877818?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ОАО Банковский процессинговый центр",
  "textContent" : "Банковский процессинговый центр - уникальный специализированный центр по информационно-технологическому обеспечению операций с банковскими платежными картами, крупнейший поставщик банковского оборудования, создатель и владелец платежной системы Белкарт - лидер в своем направлении бизнеса приглашает на работу специалиста по развитию и сопровождению программного обеспечения. Обязанности: администрирование и техническое сопровождение Low-code/No-code системы; доработка существующего и разработка нового функционала системы на основе принципов Low-code/No-code; разработка технической документации; консультирование пользователей по вопросам работы существующего функционала системы. Требования: опыт работы от 1 года в области сопровождения информационных систем или разработки ПО; опыт моделирования бизнес-процессов, работы с BPM-инструментами; базовый уровень знаний С# или Java/Groovy, реляционных СУБД; понимание устройства систем на основе принципов Low-code/No-code, систем электронного документооборота; навыки разработки технической документации; умение общаться с внутренним заказчиком и внешним разработчиком, процессное мышление, аналитические способности. Будет плюсом: опыт работы с Directum RX, Naumen Service Desk Условия: гибридный формат работы, график работы с 8.30 до 17.30 пн-чт, пт - до 16.15; работа в стабильной Компании, лидере в Республике; возможность постоянно повышать свой профессиональный уровень; дополнительные поощрительные бонусы и выплаты, квартальная премия; отпуск продолжительностью 28 календарных дней; медицинское страхование; яркая и насыщенная корпоративная культура; бесплатное посещение бассейна; частичная компенсация спортивных увлечений; бесплатное посещение курсов английского языка; вкусный кофе/чай в офисе; команда профессионалов; комфортабельный офис, удобное территориальное расположение (БЦ \"Красавик\"). Присоединяйтесь к нам!",
  "keywords" : [ ]
}, {
  "url" : "https://rabota.by/vacancy/108671030?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО БалинаСофт",
  "textContent" : "Компания BalinaSoft развивается и растет, появляются новые проекты, число необходимых для них сотрудников увеличивается. У нас работают как опытные разработчики, так и джуниоры. К нашей команде можете присоединиться и вы, если именно сейчас просматриваете актуальные вакансии на позицию Python or React Native developer Обязанности: создавать элегантные, удобные, отзывчивые и интерактивные интерфейсы на нескольких устройствах писать повторно используемый код и библиотеки (с соответствующей документацией) в соответствии со стандартом, что позволяет быстро и легко поддерживать код в будущем оптимизировать приложения для максимальной скорости и масштабируемости сотрудничать с back-end разработчиками и веб-дизайнером для повышения удобства использования и устранения неполадок Hard skills: для Python: уверенные знания apache2, nginx, wsgi, REST API, git, отличное владение фреймворками Flask и FastAPI; понимание современных возможностей Python, включая работу с декораторами, генераторами и контекстными менеджерами; знание принципов работы с модулями и пакетами, а также умение создавать собственные модули; умение применять принципы ООП на практике, опыт работы с абстрактными классами и интерфейсами; опыт работы с популярными библиотеками, такими как NumPy, Pandas, Requests, Flask или Django; знание принципов работы с ORM (например, SQLAlchemy или Django ORM); умение проектировать и оптимизировать базы данных, опыт работы с реляционными (например, PostgreSQL, MySQL) и NoSQL (например, MongoDB) базами данных; для React Native: Углубленные знания современных возможностей JavaScript, включая стрелочные функции, деструктуризацию, spread/rest операторы и модули, и ES6+; знание принципов асинхронного программирования (Promises, async/await); умение создавать и управлять функциональными и классовыми компонентами, знание жизненного цикла компонентов и хуков (useState, useEffect, useContext и т.д.), понимание контекста (Context API) и его применения для управления состоянием; опыт работы с библиотеками для управления состоянием (например, Redux, MobX или Recoil), понимание принципов работы с middleware (например, Redux Thunk или Redux Saga); опыт работы с библиотеками для навигации (например, React Navigation); Знание Docker, умение интегрировать RESTful и GraphQL API в приложения, опыт работы с библиотеками для выполнения HTTP-запросов (например, axios, fetch) умение писать integration и unit-тесты знание особенностей iOS и Android платформ, включая различия в дизайне и функциональности, опыт работы с нативными модулями и интеграцией с нативным кодом (Java/Kotlin для Android, Objective-C/Swift для iOS) несомненным плюсом будут: Опыт работы с асинхронным программированием (например, с использованием asyncio или библиотек типа FastAPI) Знание основ DevOps и опыт работы с облачными платформами (например, AWS, Azure, Google Cloud) Опыт работы с системами мониторинга и логирования (например, Prometheus, ELK Stack) Soft skills: Реальное планирование сроков выполнения задач, самостоятельность и инициативность в их решении, неукоснительное следование дедлайнам Ответственность, нацеленность на результат, желание и умение доводить дело до конца, внимательность и внимание к деталям; Собранность, организованность, интеллигентность, порядочность; Умение работать в команде; У кандидатов мы ожидаем увидеть: умение преобразовать бизнес-требования в технические задачи законченное или завершаемое высшее образование в области программирования инициативность, умение представлять свои идеи, самостоятельно находить информацию и решать проблемы; интерес к IT-сфере, желание развиваться и обучаться удовольствие от участия в сложных технических проектах и предоставления оптимальных решений на каждом этапе разработки Условия: Уникальная возможность для профессионального развития и роста; Комфортные условия труда; Возможность совмещать учёбу и работу Заработная плата по результатам собеседовании Просьба указывать в резюме или сопроводительном письме стек технологий, с которым Вы работаете, и ожидания по заработной плате",
  "keywords" : [ "REST API", "Git", "Linux", "PostgreSQL", "JSON API", "Agile", "Оптимизация кода", "React Native", "Python" ],
  "addressString" : "Минск, Молодежная, Фрунзенская, Кальварийская улица, 16"
}, {
  "url" : "https://rabota.by/vacancy/109872191?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО IDT Technologies",
  "textContent" : "We are looking for a Middle Automation QA Engineer to join the Net2Phone Unite Platform team, which develops Core and Back-End parts of applications for corporate call centers/enterprise calling plans. As a part of the Platform team, you will work in the international team, testing full product, API’s, real calls and work with SIP/VoIP technologies. Net2phone product is a large complex system with a lot of components inside and with complex logic of interaction between them. The QA team also needs to take care of all integrations within Net2Phone family products. As AQA Engineer in our Team you will: Design, develop, and maintain automated CRUD and e2e API tests for backend services. Automate e2e Calls tests for application. Active participation in execution reviews and problems investigations. Conduct thorough release and regression testing to ensure the quality and stability of the product. Actively participate in scrum team activities, including sprint planning, daily stand-ups, and retrospectives. Document identified defects in Jira, manage the lifecycle of tickets, and ensure timely resolution. Work closely with the development team and the product owner to understand requirements and provide feedback. We would like to see: Proven 2+ years of experience as an Automation QA Engineer in Java. Strong knowledge of Java theory above you daily routine. Experience implementation automating tests with different optimizations. Has understanding how tests are integrated into CI/CD. Understanding of QA methodologies, best practices, and tools. Understanding of REST API and how to test it. Good level of English – A2 or higher. Nice to have: You already work with CRUD API automation cases. You know how to build a Jenkins pipeline. Have an experience to work with complicated object comparison. Have an experience with stream API in Java. Have an experience with Splunk logs. SIP/VoIP knowledge is a plus but not required. Our benefits: Remote work as b2b contractor or hybrid full-time in Belarus Really good hardware. An exciting and challenging job with talented people around. Great learning and growth opportunities. Compensation for professional training, seminars, and conferences. First-class English lessons. More perks for the Minsk office full-time employees. About us: IDT Technologies is a part of IDT Corporation – American telecommunications company founded in 1990 and headquartered in New Jersey. It is an industry leader in prepaid communication and payment services and one of the world's largest international voice carriers. We are listed on the NYSE, employ over 1700 people across 20+ countries and have revenues in excess of $1.5 billion. Net2Phone is a rapidly growing global provider of unified cloud communications solutions. It was named ‘VoIP Supplier of the Year’ by the Telecom Consulting Group in 2018. Its cloud communication solution provides an integrated communications suite featuring powerful collaboration tools such as voice, messaging, chat, unlimited domestic and international calling to 23+ countries.",
  "keywords" : [ "Java", "Monolith", "Production Experience", "Spring", "Microservices", "Английский — B1 — Средний" ]
}, {
  "url" : "https://hh.ru/vacancy/109334233?query=java",
  "companyName" : "Secreate",
  "textContent" : "Привет! Мы Secreate - ИТ-компания с подходом 360° - закрываем цифровые задачи бизнеса, от аналитики и разработки любой сложности до проектного консалтинга и поддержки готового решения. Среди наших клиентов такие компании как: Suzuki, Росгосстрах, Ростелеком, LG, Skyeng, OZON, Kaspersky, ИТМО, МИСИС и другие. Мы открыты новому, и даем свободу действовать, меняться и строить свой профессиональный путь. Среди наших принципов: Отсутствие бессмысленной бюрократии и излишнего формализма; Безграничные возможности развития (60% ТОПов выросли в компании); Гибкость к изменениям. А еще у нас полная удаленка, программа бенефитов для команды и ламповая атмосфера. У нас огромные амбиции в росте компании, потому усиливаем ключевой отдел - отдел Рекрутинга :) Чем предстоит заниматься: Активный поиск ИТ-специалистов для аутсорсинга и аутстаффинга (разработчики, тестировщики, аналитики, бэк-офис и т.д.) с использованием различных источников: HeadHunter, LinkedIn, GitHub, Telegram, Habr и других специализированных платформ. Формирование и развитие базы кандидатов, обеспечение качественного потока резюме в воронку. Проведение первичного скрининга кандидатов и оценка их соответствия требованиям позиций. Взаимодействие с рекрутерами и аккаунт-менеджерами для уточнения требований по вакансиям и согласования профилей кандидатов. Анализ рынка труда и разработка рекомендаций по поиску редких специалистов. Поддержание связи с потенциальными кандидатами, создание и поддержка базы пассивных кандидатов. Обеспечение своевременного и точного учета данных в системе отслеживания кандидатов (CRM/ATS). Требования: Опыт сорсинга IT-специалистов от 1 года в аутсорсинговых или аутстаффинговых компаниях. Знание современных инструментов и техник сорсинга: Boolean Search, X-Ray, LinkedIn Recruiter, Habr, GitHub. Опыт поиска кандидатов на сложные позиции (Senior/Lead, редкие стеки технологий). Понимание основных технологий, популярных стеков и их применений (Java, Python, QA и др.). Ключевая особенность: Для нас критически (!!) важен фокус на качественном сервисе для кандидата, разговоре на одном языке со специалистом и желании строить долгосрочные отношения. Сорсеры-спамеры и сорсеры-игнорщики - мимо. Условия: Оформление по ТК/ГПХ; 28 дней оплачиваемого отпуска, 4 sick-days в год; Полная удаленка; Заинтересован(-а) - ждем твой отклик. Если человеческий подход в найме это про тебя - мы 100% сконнектимся :)",
  "keywords" : [ ]
}, {
  "url" : "https://rabota.by/vacancy/109049026?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Сампад",
  "textContent" : "ООО \"Сампад\" в связи с расширением приглашает в свою команду Middle Android Developer! Чего мы ждем от специалиста? Опыт коммерческой разработки от 3 лет; Отличные знания в области Computer Science (Структуры данных, Паттерны и Архитектура (MVVM/MVI и Clean Architecture); Уверенные знания Kotlin/Java для Android; Хорошие знания Android SDK, Kotlin Flow + coroutines; Знание Git и умение работать в команде; Опыт работы с Compose; Понимание REST API для взаимодействия с backend; Опыт в написании unit тестов; Умение построить сложный UI; Опыт работы с англоговорящими клиентами. Уровень владения английским языком В2 или выше. Чем предстоит заниматься: Разработка приложений под Android на языке Kotlin; Активное обучение в процессе работы и внутренних митапов. Будет плюсом: Знание DI-инструментов (Hilt/Koin/Dagger); Опыт работы с базами данных, знание SQLite, Room. Мы предлагаем: Удаленный формат работы или офис в центре Минска по адресу Интернациональная 20А (8 минут пешком от станций Октябрьская, Немига и Купаловская); Индивидуальный план развития и регулярные performance review; Гибкий и удобный режим работы в офисе или удаленно; Регулярные внутренние митапы и knowledge sharing внутри компании; Материальная поддержка и оплачиваемые выходные в дни значимых событий (свадьба, рождение ребенка и т.п.); Денежные бонусы за рекомендации специалистов в рамках реферальной программы; Корпоративное обучение английскому языку; 25 календарных дней отпуска. Заинтересовало? Тогда откликайся! Мы рассматриваем резюме сроком до 14 дней. Если по прошествии 14 дней с вами не связались, это значит, что на данный момент вы не подошли на эту вакансию. Тем не менее вы всегда можете откликаться на наши новые предложения, ведь в любой момент может появиться вакансия, которая идеально вам подойдет! Будем рады рассказать больше о компании на встрече с нами!",
  "keywords" : [ "Compose", "Coroutines", "MVVM", "Clean Architecture", "Android SDK", "Android", "Kotlin", "Английский язык" ]
}, {
  "url" : "https://rabota.by/vacancy/109138527?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО НитСофт",
  "textContent" : "NeatSoft - IT-компания, специализирующаяся на разработке веб- и мобильных приложений с 2016 года. Мы работаем с клиентами из различных стран мира и успешно реализовали проекты в странах СНГ и Западной Европы. Наши проекты включают как продуктовую разработку (например, logtime.me и mybase.pro), так и аутсорсинг разработки. Работаем с такими технологиями как: Angular; React; VueJS; NodeJS; NestJS; Yii2; Laravel; DevOps Tools; Flutter, Java. Мы находимся в постоянном развитии и ищем Системного аналитика в нашу дружную команду. Что мы ожидаем: Знание SQL языка. Понимание интеграционных интерфейсов (БД, очереди сообщений, веб-сервисы). Опыт работы и понимание брокеров сообщений Kafka или Rabbit MQ. Знание и опыт работы с инструментами сборки приложений. Понимание принципов построения реляционных баз данных. Умение подготовки спецификаций (описание форматов взаимодействия) для SOAP и REST; Будет плюсом: Опыт работы в должности системного аналитика от 1 года. Понимание форматов данных JSON, XML, CSV. Опыт работы с монолитной и микросервисной архитектурами. Знание методов и инструментов анализа бизнес-процессов. Опыт администрирования Linux. Понимание основных подходов к тестированию – функциональные, интеграционные, нагрузочные, smoke, регрессионные тесты Опыт описания логики работы интерфейса web или мобильного приложения. Ценные для нас навыки: Хорошо развитые коммуникативные и аналитические способности. Умение работать в команде и брать на себя ответственность. Английский язык уровня B1 и выше. Мы предлагаем: Дружественную и уютную атмосферу, удобное расположение офиса. Комфортное рабочее место с чаем, кофе и печеньем. Нескучные задачи без бюрократии и формализма. Заработную плату, привязанную к курсу USD. Гибкий график работы с плавающим началом рабочего дня. Бонусы и премии по результатам работы и значимым событиям. Если вы заинтересованы в этой вакансии и соответствуете указанным требованиям, мы будем рады видеть вас в нашей команде!",
  "keywords" : [ "Анализ рисков", "Системный анализ", "Микросервисная архитектура", "SQL" ],
  "addressString" : "Минск, Грушевка, Михалово, Петровщина, улица Карла Либкнехта, 66"
}, {
  "url" : "https://rabota.by/vacancy/108653135?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ГИПК ГАЗ-ИНСТИТУТ",
  "textContent" : "Обязанности: - помощь пользователям программного обеспечения; - совершенствование уровня автоматизации процессов; - разработка нового и поддержание готового функционала программного обеспечения; Требования: – знание Python; – знание Java и принципов ООП, Swing, паттернов и антипаттернов проектирования ПО; Tomcat, HTML, CSS; – опыт работы с реляционными базами данных, СУБД MySQL, ORM (Hibernate и др.); – плюсом будет знание Docker, REST; – умение оценивать плюсы и минусы различных инструментов в контексте их применения для решения конкретных задач; - практическое знакомство с Unix-подобными операционными системами, понимание их отличий от операционных систем семейства Windows; – знание английского языка на уровне \"чтение со словарем\"; – аналитические способности, умение работать в команде, ответственность; – желание развивать вышеперечисленные навыки, не бояться изучать новое. Условия: – стабильная з/п + расширенный социальный пакет; – заключение контракта; – комфортное рабочее место; график работы: полный день, пн.-чт. 8.30-17.00, пт.8.30-15.00, обед 13.00-13.30 - возможно оформление трудовых отношений по совместительству",
  "keywords" : [ ],
  "addressString" : "Минск, Академия наук, 1-й Твёрдый переулок, 8"
}, {
  "url" : "https://rabota.by/vacancy/108172571?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Испаер Системс ЛТД",
  "textContent" : "Компания Ispirer Systems с 1999 года специализируется в двух основных областях: миграция баз данных и преобразование приложений. Мы помогаем компаниям по всему миру идти в ногу с лучшими практиками разработки программного обеспечения и хранения данных. Ищем перспективного разработчика в команду для работы над основным продуктом компании. Вам предстоит познакомиться с уникальной технологией, искать способы улучшения существующих решений и внедрять наиболее оптимальные для новых задач, стать частью команды и принять непосредственное участие в развитии продукта. Что мы ждем от кандидата: высшее ИТ/техническое образование либо также последний курс (!) технического ВУЗа знание технологий XML/XSLT навыки работы с Git знания SQL на уровне написания простых запросов (DDL, DML, запросы) опыт работы с любым языков программирования, таких как Java, C# и др. ЯП технический английский язык (чтение документации) Чем предстоит заниматься: усовершенствование существующих и разработка новых решений в продукте участие в разработке новых продуктов компании Будет преимуществом: понимание и опыт применения паттернов проектирования опыт работы с Atlassian Jira и BitBucket знание классических алгоритмов и структур данных владение SQL на начальном уровне (знание операторов языка, навыки в написании простейших запросов, хранимых процедур) Что мы хотим видеть в кандидатах: аналитический склад ума способность работать как самостоятельно, так и в команде хорошие коммуникативные способности Что мы можем предложить: - гибкий график работы; - возможность работать удаленно (после испытательного срока); - материальная помощь к датам; - медицинская страховка; - отпуск 22 рабочих дня / 3 sick days/ 2 day off. ! После первичного отбора необходимо будет выполнить небольшое тестовое задание. !! В CV должно быть подробно расписано, на каком уровне и с чем вы знакомы ( в том числе и лабораторные) *стажировка 4 недели на условиях обучения, далее при успешном прохождении - оформление в штат",
  "keywords" : [ "ООП", "Java", "Git", "СУБД", "XML", "XSLT", "XML/Xslt", "Английский — B1 — Средний", "SQL", "Python" ],
  "addressString" : "Минск, Каховская улица, 70А"
}, {
  "url" : "https://rabota.by/vacancy/110263088?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Itransition",
  "textContent" : "We are looking for experienced developers that are willing to solve complex technical issues while developing high quality software systems using modern technologies. Responsibilities: Develop and enhance cross-platform mobile applications using React Native, ensuring high performance and quality on both iOS and Android; Collaborate with design and product teams to create seamless, intuitive, and visually appealing user interfaces; Optimize applications for maximum performance and scalability; Integrate third-party APIs and native libraries as needed; Conduct code reviews, write unit tests, and debug applications to ensure code quality and functionality; Maintain up-to-date knowledge of React Native advancements and apply best practices in coding, architecture, and development methodologies; Provide technical expertise to guide product development and offer solutions for complex issues; Participate in Agile ceremonies, including daily stand-ups, sprint planning, and retrospectives. Requirements: Minimum of 3 years of proven experience as a RN Developer; Expertise in React Native, React is essential; Comprehensive understanding of both front-end and back-end development processes; Strong collaboration skills, enabling effective teamwork and communication within cross-functional teams; Ability to adapt quickly to emerging technologies and evolving project requirements;In-depth understanding of React Native architecture, component lifecycle, state management, and hooks, familiarity with native build tools (Xcode, Android Studio) and native app design; principles, including offline storage, threading, and performance tuning; Experience with RESTful APIs, GraphQL, and third-party integrations; Sound knowledge of HTML, CSS, and associated technologies for front-end development; Experience in code testing and debugging, leveraging tools such as Jest; Firm grasp of software development principles and methodologies, encompassing Agile, Scrum, and Waterfall; Outstanding communication skills and adeptness in collaborative teamwork; Strong organizational acumen and meticulousness to deliver top-notch work. Nice to have: Familiarity with GraphQL and its fusion with frontend applications; Experience in creating native modules using Swift/Kotlin/Java; Knowledge of CI/CD pipelines. We can offer: Projects for such clients as PayPal, Wargaming, Xerox, Philips, adidas and Toyota Competitive compensation that depends on your qualification and skills Career development system with clear skill qualifications Options to work remotely Compensation for medical expenses English courses online Corporate parties and events for employees and their children Internal conferences, workshops and meetups for learning and experience sharing Gym membership compensation, corporate sport competitions (cybersport included) 5 days of paid sick leave per year with no obligation to submit a sick-leave certificate",
  "keywords" : [ "CSS", "HTML", "React Native", "Английский — B2 — Средне-продвинутый", "Английский язык" ]
}, {
  "url" : "https://rabota.by/vacancy/109147325?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО НитСофт",
  "textContent" : "NeatSoft - IT-компания, специализирующаяся на разработке веб- и мобильных приложений с 2016 года. Мы работаем с клиентами из различных стран мира и успешно реализовали проекты в странах СНГ и Западной Европы. Наши проекты включают как продуктовую разработку (например, logtime.me и mybase.pro), так и аутсорсинг разработки. Работаем с такими технологиями как: Angular; React; VueJS; NodeJS; NestJS; Yii2; Laravel; DevOps Tools; Flutter, Java. Мы находимся в постоянном развитии и ищем DevOps-инженера в нашу дружную команду. Что мы ожидаем: Опыт администрирования и конфигурации операционных систем на базе Linux. Понимание работы систем баз данных, таких как SQL и NoSQL. Практический опыт в настройке мониторинга с использованием таких инструментов как Grafana, Prometheus, систем сбора. Знание основ контейнеразации и оркестрации (Docker, Kubernetes, и т.п.) Базовое понимание сборки проектов на языках: Java (Maven, Gradle), Golang, C#. Знание сетевых протоколов (TCP/IP, HTTP, Websockets). Будет плюсом: Опыт работы DevOps инженером от 1 года. Понимание процессов и принципов разработки ПО. Умение диагностировать инфраструктурные и локальные ошибки. Понимание практик DevOps, принципов CI/CD и опыт применения в реальных инфраструктурах. Понимание микросервисной архитектуры. Опыт администрирования gitlab. Ценные для нас навыки: Хорошо развитые коммуникативные и аналитические способности. Умение работать в команде и брать на себя ответственность. Английский язык уровня B1 и выше. Мы предлагаем: Дружественную и уютную атмосферу, удобное расположение офиса. Комфортное рабочее место с чаем, кофе и печеньем. Нескучные задачи без бюрократии и формализма. Заработную плату, привязанную к курсу USD. Гибкий график работы с плавающим началом рабочего дня. Бонусы и премии по результатам работы и значимым событиям. Если вы заинтересованы в этой вакансии и соответствуете указанным требованиям, мы будем рады видеть вас в нашей команде!",
  "keywords" : [ "Linux", "Docker", "CI/CD", "Bash", "Gitlab", "Python" ],
  "addressString" : "Минск, Грушевка, Михалово, Петровщина, улица Карла Либкнехта, 66"
}, {
  "url" : "https://rabota.by/vacancy/105648826?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Таленс БАЙ",
  "textContent" : "SoftMaster - активно растущая IT-компания, реализующая международные проекты и инновационные решения в сфере iGaming. Наша команда насчитывает уже более 600 сотрудников, работающих как из основных офисов в России и Беларуси, так и из других локаций по всему миру. Продукты, разработанные SoftMaster, активно применяются крупнейшими мировыми онлайн-казино и позволяют нам уже не один год занимать лидирующие позиции в индустрии. Мы активно развиваем наш продукт и расширяем команду. В данный момент мы находимся в поиске Middle Node.JS-developer. Чем предстоит заниматься: разработкой web-приложений с использованием Nest, Postgres, RabbitMQ и т.д.; решением интересных и нестандартных задач; работой с highload проектом; работой с микросервисной архитектурой. В задачи разработчика не входит прямое общение с заказчиками. Мы ждем коллег, которые: имеют опыт работы в веб-разработке от 2-х лет на позиции программиста на любом из следующих языков программирования: PHP, Java, Python, Golang и им подобным; знают JavaScript/TypeScript, имеют опыт работы с Node.JS; понимают и умеют применять принципы ООП; знают реляционные базы данных: PostgreSQL/MySQL; имеют реальный опыт работы с системами контроля версий (GIT). Дополнительным плюсом будет наличие опыта в: front-end фреймворках: Angular, Vue, React (любой из перечисленных); разработке асинхронных приложений (принципы асинхронного программирования и того, как работает event-loop); брокерах сообщений: RabbitMQ, Kafka; распределенных блокировках: Zookeeper; микросервисной архитектуре; высоконагруженных, распределенных приложениях; контейнеризации приложений и принципах CI/DI. Мы предлагаем: официальное трудоустройство по ТК РБ с первого дня, оплачиваемый отпуск и полный социальный пакет; фиксированную заработную плату в размере от 1500 евро на руки (точная сумма определяется по итогам технического интервью и зависит от уровня ваших навыков), с возможностью ежегодного повышения по результатам работы; нормированную 40-часовую рабочую неделю, график 5/2 и гибкое начало рабочего дня; комфортный офис с современным рабочим пространством и возможностью улучшить свое рабочее место по запросу (например, выбрать удобное кресло, клавиатуру, мышь); 3 оплачиваемых sick days в год; доступ к внутренней библиотеке курсов, а также возможность прохождения внешнего обучения за счет компании; всегда доступный выбор ароматного чая, бодрящего кофе, полезных снеков, свежих фруктов и других вкусных перекусов на уютной офисной кухне, чтобы поддерживать энергию и оставаться продуктивными в течение дня; пятничные обеды из лучших ресторанов города за счёт компании; возможность удаленной работы; тимбилдинги, корпоративы, настольные игры — мы умеем не только работать, но и классно отдыхать вместе! В компании поддерживается атмосфера, где можно развиваться, делиться знаниями и работать в комфортных условиях без строгих правил и дресс-кода. Чтобы стать частью нашей команды, вам нужно будет пройти следующие этапы: 1. Письменный тест удаленно (Google Meet). 2. Онлайн-собеседование с тимлидом и HR. Мы рассматриваем все отклики и свяжемся с подходящими кандидатами. Спасибо за ваш интерес к SoftMaster!",
  "keywords" : [ ]
}, {
  "url" : "https://rabota.by/vacancy/108854179?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Andersen",
  "textContent" : "The international IT сompany Andersen invites a Java Developer to work on large-scale projects. Andersen is a pre-IPO software development company providing a full cycle of services. For over 17 years, we have been helping enterprises and middle-sized firms worldwide transform their businesses by creating effective digital solutions using innovative technologies. Today, we are working with organizations from various parts of the world, including North America, Western Europe, Israel, Australia, and the UAE. Our expertise covers FinTech, Healthcare, Retail, Telecom, Media & Entertainment, Logistics, Travel & Hospitality, eCommerce, and other industries. Must-haves: Commercial development experience as a Java Developer for 4+ years. Strong knowledge and experience with Java 11+, Spring, Spring Boot. Experience with SQL/NoSQL DB. Confident knowledge and experience with microservice architecture. Level of English – from Intermediate+ and above. Nice-to-have: Experience with AWS cloud infrastructure. Knowledge of Docker and Kubernetes containerization technology. Experience with Kafka. Reasons why this job would be interesting to you: Experience in teamwork with leaders in FinTech, Healthcare, Retail, Telecom, and others. Andersen cooperates with such businesses as Samsung, Siemens, Johnson & Johnson, BNP Paribas, Ryanair, Mercedes, TUI, Verivox, Allianz, T-Systems, etc.; The opportunity to change the project and/or develop expertise in an interesting business domain; Job conditions – you can work both fully remotely and from the office or can choose a hybrid variant; Guarantee of professional, financial, and career growth! The company has introduced systems of mentoring and adaptation for each new employee; The opportunity to earn additional up to 1,700 EUR per month by participating in the company's activities; Access to the corporate training portal, where the entire knowledge base of the company is collected and which is constantly updated; Bright corporate life (parties / pizza days / PlayStation / fruits / coffee / snacks / movies); Certification compensation (AWS, PMP, etc); Referral program; English courses; Private health insurance and compensation for sports activities. Join us!",
  "keywords" : [ "Java", "Spring Framework", "Spring Boot", "Английский — B1 — Средний" ]
}, {
  "url" : "https://rabota.by/vacancy/105717949?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Таленс БАЙ",
  "textContent" : "SoftMaster - активно растущая IT-компания, реализующая международные проекты и инновационные решения в сфере iGaming. Наша команда насчитывает уже более 600 сотрудников, работающих как из основных офисов в России и Беларуси, так и из других локаций по всему миру. Продукты, разработанные SoftMaster, активно применяются крупнейшими мировыми онлайн-казино и позволяют нам уже не один год занимать лидирующие позиции в индустрии. Мы активно развиваем наш продукт и расширяем команду. В данный момент мы находимся в поиске Middle PHP-developer. В команде back-end более 50 человек, разделенных на несколько подкоманд, каждая из которых занимается своим направлением, например, разработкой интеграций с внешними системами, созданием нового функционала в различных системах, или решением других задач в рамках разработки высоконагруженного продукта. У нас ты найдешь не только интересные задачи, но и поддержку, мотивацию и возможности для роста. Чем предстоит заниматься: разработкой API и интерфейсов для высоконагруженных проектов; доработкой и поддержкой имеющегося функционала; при желании — работать со смежными проектами на Node.JS, Java, Python, Go. В задачи разработчика не входит прямое общение с заказчиками. Мы ждем коллег, которые: уверенно владеют PHP 7+; знают JavaScript, HTML5, CSS3, ООП; имеют хорошее знание SQL-подобных СУБД (желательно MySQL, но подойдёт и MSSQL, PostgreSQL); имеют опыт решения сложных задач; знают основы Debian/Ubuntu Linux на уровне пользователя. Будет плюсом: знание Node.js, Java, ClickHouse, CMS WordPress, Bootstrap 3, Angular JS, Redis; опыт оптимизации структуры баз данных и запросов к ней; опыт работы с Laravel; реальный опыт работы с высоконагруженными системами. Что мы предлагаем: официальное трудоустройство по ТК РБ с первого дня, оплачиваемый отпуск и полный социальный пакет; фиксированную заработную плату в размере от 1400 евро на руки (точная сумма определяется по итогам технического интервью и зависит от уровня ваших навыков), с возможностью ежегодного повышения по результатам работы; нормированную 40-часовую рабочую неделю, график 5/2 и гибкое начало рабочего дня; комфортный офис с современным рабочим пространством и возможностью улучшить свое рабочее место по запросу (например, выбрать удобное кресло, клавиатуру, мышь); 3 оплачиваемых sick days в год; доступ к внутренней библиотеке курсов, а также возможность прохождения внешнего обучения за счет компании; всегда доступный выбор ароматного чая, бодрящего кофе, полезных снеков, свежих фруктов и других вкусных перекусов на уютной офисной кухне, чтобы поддерживать энергию и оставаться продуктивными в течение дня; пятничные обеды из лучших ресторанов города за счёт компании; возможность удаленной работы; тимбилдинги, корпоративы, настольные игры — мы умеем не только работать, но и классно отдыхать вместе! В компании поддерживается атмосфера, где можно развиваться, делиться знаниями и работать в комфортных условиях без строгих правил и дресс-кода. Чтобы стать частью нашей команды, необходимо пройти следующие этапы: 1. Удаленный письменный тест (вопросы PHP, SQL — основные; HTML, CSS, JS — дополнительные). 2. Онлайн-собеседование с тимлидом и HR. Мы рассматриваем все отклики и свяжемся с подходящими кандидатами. Спасибо за ваш интерес к SoftMaster!",
  "keywords" : [ "ООП", "СУБД", "PHP7+", "PostgreSQL", "MySQL", "JavaScript", "PHP", "Laravel" ]
}, {
  "url" : "https://rabota.by/vacancy/108714295?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО МэпДэйта",
  "textContent" : "Mapbox Minsk R&D center (OOO MapData) enables navigation for people, packages and vehicles. Our underlying maps represent the ever-evolving world, accessing, aggregating, and adapting anonymous data from millions of sensors and phones in real-time. What You'll Do You will review large volumes of data, create various content for our map, navigation services and products; You will detect and mark different objects on satellite images according to needed requirements; You will analyze, fix and enrich large volumes of data (e.g. up to several tens of roads kilometers per week); You will make cartographic edits using Java OpenStreetMap Editor or contribute to enrichment of map data by using specialized tools What We Believe are Important Traits for This Role Proficiency in English, ability to communicate clearly in written and verbal communication, read and write documentation (A2+ and above). Please, indicate the level of English proficiency in your CV Ability to execute monotonous work in large volumes on a high level of personal efficiency; Ability to stay focused on a repetitive work during a working day, keeping high quality and accuracy of data processing; Presence of logic, ability to reason and act independently; Analytical mindset and ability to identify common patterns in large volumes of information; Resistant to stress in a rapidly changing situation; A quick learner, ability to switch between projects with different workflow or instructions, multi-tasking; Ability to work in a team and high communicative skills Welcomed General knowledge of traffic rules for qualitative analysis of traffic situations and modeling driver behavior or use-cases (ideally, driving license or completed driving school); Understanding OpenStreetMap service and an interest in cartography (if you have an account with OSM edits, please, specify in your CV); Experience working in GIS, cartography or geodesy; Experience working in IT-sphere or completed IT-courses for understanding communication culture and processes in high-technology international company; Interest in developing their skills and expanding their competencies within the working domain.",
  "keywords" : [ "GIS", "Английский — A2 — Элементарный", "OSM", "Mapping", "Английский язык" ],
  "addressString" : "Минск, улица Кирова, 8"
}, {
  "url" : "https://rabota.by/vacancy/109877231?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ЗАО МАПСОФТ",
  "textContent" : "МАПСОФТ — ТОП-10 разработчиков программного обеспечения для белорусского рынка. Компания специализируется на разработке мобильных приложений, создании цифровых платформ и сервисов с применением облачных технологий, машинного обучения и искусственного интеллекта. Мы ищем в команду специалиста по созданию отчетов! Требования к кандидату: - глубокое знание и опыт работы с генератором отчетов Stimulsoft; - продвинутые знания SQL; - плюсом будет знание Java Script. Условия: • интересная работа в стабильной IT-компании; • дружный коллектив; • достойный уровень заработной платы; • полный социальный пакет; • бонусы и \"плюшки\".",
  "keywords" : [ ],
  "addressString" : "Минск, улица Толбухина, 2"
}, {
  "url" : "https://rabota.by/vacancy/108672670?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Itransition",
  "textContent" : "About us: Leading QA Provider: a1qa boasts a team of over 1000 specialists, offering end-to-end QA solutions. Comprehensive QA Expertise: Our services include automated testing, QA management, and coordination of distributed teams for integrative projects. Client-Centric Approach: Specializing in pre-project services, acceptance testing, and IT security auditing, we prioritize customer satisfaction and risk mitigation. Responsibilities: Develop and enhance test automation frameworks for Mobile, Web, and backend systems. Integrate automation into the SDLC process. Increase automation coverage. Review code and mentor junior automation engineers. Requirements: Java: Proficiency in Java programming for writing and maintaining automation scripts. TestNG & Selenium: Strong experience with TestNG for test management and Selenium for automating web applications. Appium: Experience with Appium or any other mobile automation framework for testing mobile applications. Postman: Knowledge of Postman for API testing and automation. CI/CD Pipelines: Experience in configuring and maintaining CI/CD pipelines, preferably using GitLab actions. SQL: Basic understanding of SQL for database validation during testing. Experience: 2-3+ years in test automation, with a proven track record of creating and maintaining automated tests. Experience in the banking or fintech industry is a significant plus. If you're excited about working in a dynamic and fast-paced environment with opportunities to innovate, we would love to have you on our team!",
  "keywords" : [ "Java", "Appium", "Selenium", "Postman", "Автоматизированное тестирование", "Английский — B1 — Средний", "SQL" ]
}, {
  "url" : "https://rabota.by/vacancy/110095611?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Будущее технологий",
  "textContent" : "В Т1 стабильность и финансовая надежность, а также социальные гарантии гармонично сочетаются с преимуществами ИТ‑компании — открытостью, инновациями и гибридным форматом работы. Мы стремительно растём, масштабируемся и ищем новых специалистов в команду! В рамках финтех‑направления мы разрабатываем инновационные решения для цифровизации финансового сектора: современные финтех‑продукты, системы работы с большими данными и комплексные решения для фронт‑ и бэк‑офисов. В продуктовом портфеле — создание современных высоконагруженных фронтальных систем, омниканальных продуктов и высоконадежных платформ для поддержки банковского бизнеса. Мы работаем с крупнейшими организациями банковского сектора, ведущими финансовыми компаниями и активно выстраиваем партнерскую работу на Ближнем Востоке, в Африке и Юго‑Восточной Азии. Охват пользователей продуктов составляет более 15 миллионов человек. Обязанности: Реализация функционала (анализ функционала по требованию) Поддержка и улучшение кодовой базы Покрытие функционала модульными тестами Оптимизация бизнес логики и повышение стабильности системы (выявление \"узких мест\" системы) Выявление тех долга Проведение код ревью Проработка бэклога Планирование и подготовка релизов Написание документации Требования: Работа с Jira/Confluence, Bitbucket, Teamcity, понимание работы CI/CD конвейера Опыт проектирования и реализации интеграционных взаимодействий, очереди (ibm mq, activemq, kafka) Навыки поиска причин ошибок в коде, понимание работы микросервисов,понимание и желание работы в скрам-команде, уметь коммуницировать с коллегами Тех стек (Java 8/11, Spring boot 2/3, JPA: Hibernate +CriteriaApi + Spring Data Jpa, MQ: Kafka/Ibm Mq, БД: Postrges, Тесты: Junit, Mockito) Хорошее понимание REST и SOLID; Плюсом будет знакомство с Kubernetes и Docker; Дополнительным плюсом будет знание Spring Cloud, Lombok, Mapstruct, Liquibase. Почему именно Т1? Мы создадим комфортные условия для работы, предложим интересные и масштабные задачи, а также поможем профессионально расти и развиваться, участвовать в кросс‑командных проектах и определять собственную траекторию развития. Преимущества работы в Т1: Комфортные офисы и гибкий рабочий день В офисе, удаленно или в гибридном формате. Главный офис у м. Динамо в Москве — победитель в номинации «Гибкий офис» Best Office Awards 2023 ДМС и комплексные программы поддержки ДМС с телемедициной и возможностью подключения родственников и Добросервис для психологической, юридической и финансовой поддержки Участие в конференциях и профессиональное обучение Бесплатное обучение, LMS платформа с 70+ курсами для развития технических и коммуникационных навыков, программа наставничества, а также 12+ активных сообществ и техногильдий Интересные задачи, производительное железо и софт для работы Востребованные на рынке ИТ‑продукты, ключевые ‑ уже внесены в ЕРРП (реестр российского ПО) Насыщенная корпоративная жизнь и нетворкинг Масштабные таунхоллы и яркие неформальные события, регулярные митапы, корпоративная библиотека, активные сообщества и многое другое Скидки и партнерские программы Сервис привилегий от 100+ партнёров на покупку техники, занятия спортом и иностранными языками, концерты, отели, SPA и др. А также развитая программа компенсации и маркетплейс мерча с собственной корпоративной валютой Конкурентная заработная плата Достойный оклад по итогам интервью и система премирования. Оформление по ТК и эксклюзивный зарплатный проект для сотрудников в банке ВТБ Дополнительные выходные и материальная помощь Рождение ребёнка, поддержка многодетных семей и одиноких родителей, смерть членов семьи и др. Дополнительный оплачиваемый отпуск (3 календарных дня)",
  "keywords" : [ ]
}, {
  "url" : "https://rabota.by/vacancy/108753685?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "СИСТЕМНЫЕ ТЕХНОЛОГИИ",
  "textContent" : "Приглашаем в нашу команду рекрутера для привлечения IT-специалистов (PM, BA, UX/UI дизайнеры, QA Engineer, DevOps, разработчики: iOS, Android, Flutter, .Net, Java, С++, Frontend, Fullstack). Чем предстоит заниматься: Организовывать полный цикл поиска и подбора специалистов (от сбора требований по заявке на подбор до выхода специалиста на работу). Также включая оценку Soft Skills и формирование развернутых фидбеков по кандидатам (рекомендации для руководителей и обозначение возможных рисков). Выстраивать отношения с нанимающими менеджерами, обеспечивать прозрачность поиска и подбора. Курировать процесс адаптации новых сотрудников. Проводить Exit-интервью. Участвовать в оптимизации существующих процессов. Какие навыки пригодятся: Опыт работы рекрутером от 1 года. Опыт оценки Soft Skills с формированием фидбека по кандидатам. Самостоятельность в организации процесса найма и адаптации сотрудников в компании. Умение мыслить в долгосрочной перспективе (быть нацеленным не только на фактическое закрытие вакансии, но и на долгосрочное сотрудничество специалиста с компанией). Хорошие коммуникативные навыки для взаимодействия с другими сотрудниками. Умение взаимодействовать с руководителями управлений. Умение аргументированно отстаивать свою точку зрения, предвидеть возможные риски и информировать заинтересованных лиц. Знание английского языка будет плюсом. Что вам даст работа в нашей компании? Работа в большой ИТ компании с грамотно выстроенными процессами, которые дают прозрачность работы. Сплоченный коллектив, который уже на протяжении нескольких лет работает над сложными задачами. На время адаптационного периода у вас будет ментор, который поможет вам быстро адаптироваться в задачах, команде и проекте. Расширенный социальный пакет, о котором мы расскажем вам на встрече :)",
  "keywords" : [ "Проведение собеседований", "Exit Interviews", "Подбор персонала", "Адаптация", "Рекрутинг", "Сорсинг", "Interviews" ],
  "addressString" : "Минск, улица Академика Купревича, 3"
}, {
  "url" : "https://rabota.by/vacancy/107225975?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ОАО Банковский процессинговый центр",
  "textContent" : "Банковский процессинговый центр - уникальный специализированный центр по информационно-технологическому обеспечению операций с банковскими платежными картами, крупнейший поставщик банковского оборудования - лидер в своем направлении бизнеса приглашает на работу Senior Java Developer Наш стек: Java 17/21; Spring/SpringBoot; PostgreSQL; RabbitMQ; Docker; Gitlab; REST Ты нам подходишь, если: опыт разработки на Java от 5 лет; понимание принципов ООП; понимание принципов микросервисной архитектуры; опыт использования шаблонов проектирования; опыт code review. Будет плюсом: опыт разработки высоконагруженных отказоустойчивых приложений; опыт работы с RabbitMQ, Kafka, Kubernetes, ELK Stack, Prometheus, Grafana, eSXi (vSphere). Условия: гибридный офис (2 раза в неделю дома, 3 раза в неделю в офисе нанимателя), график работы с 8.30 до 17.30 пн-чт, пт - до 16.15; возможность постоянно повышать свой профессиональный уровень; дополнительные поощрительные бонусы и выплаты; отпуск продолжительностью 28 календарных дней; медицинское страхование; яркая и насыщенная корпоративная культура; команда профессионалов; комфортабельный офис, удобное территориальное расположение (БЦ \"Красавик\"); Присоединяйтесь к нам!",
  "keywords" : [ ]
}, {
  "url" : "https://hh.ru/vacancy/86726886?query=java",
  "companyName" : "Яндекс",
  "textContent" : "Вертикали — это бизнес-юнит Яндекса, в который входят несколько крупных продуктов, объединённых одним вектором: развитием классифайдов (досок объявлений) в важных для жизни областях. Внутри мы создали буткемп Java-разработки, который поможет на старте выбрать именно ту команду, которая вам подходит. В рамках этой программы вы проведёте по две недели в трёх разных командах, чтобы лучше понять их процессы и подходы к разработке, и приземлитесь в приоритетную для вас. Немного о нас Путешествия – сервис, который помогает пользователям самостоятельно организовать себе отдых или командировку под ключ. Недвижимость помогает не только купить, продать, снять квартиру или коммерческую недвижимость, но и предоставляет достоверную информацию об объектах. Аренда — удобный городской сервис, где специалисты помогают собственникам быстро сдать в аренду квартиры, а арендаторам — найти новый дом. Какие задачи вас ждут Активное развитие по-настоящему масштабного бизнеса, понятного каждому, кто хоть раз ездил в отпуск или снимал (приобретал) жильё Проектирование, разработка и масштабирование микросервисов Решение продуктовых и инфраструктурных задач Создание и поддержка программного обеспечения от написания до выкладки в продакшн Обеспечение стабильной работы компонентов и оперативное решение проблем Мы ждём, что вы Имеете более трёх лет опыта коммерческой разработки на Java или готовы перейти с другого языка программирования Знаете классические алгоритмы и структуры данных Разрабатывали сложные веб-приложения или системы обработки данных Умеете проектировать системы Будет плюсом, если вы Создавали и разрабатывали проекты с нуля Разрабатывали высоконагруженные системы Что мы предлагаем Возможность работы в Москве (БЦ «Аврора», ст. М. «Павелецкая»), Санкт-Петербурге (БЦ «Бенуа», Калининский район), Екатеринбурге (БЦ «Палладиум») или Минске (БЦ Rubin Plaza) в офисном или гибридном формате Объёмный полис ДМС со стоматологией, коррекцией зрения, регулярным чекапом и помощью при критических заболеваниях (онкологии, болезнях сердца), а также с компенсацией психотерапевтической помощи ДМС также можно купить и для близких родственников — компания оплатит 80% Стараемся сократить регулярные расходы сотрудников: у нас сотни вариантов корпоративных скидок во всех областях жизни, компенсация оплаты питания в офисе и многие другие сопутствующие бенефиты",
  "keywords" : [ "Java", "PostgreSQL", "Logbrocker", "Spring Framework", "Kotlin", "GRPC" ]
}, {
  "url" : "https://rabota.by/vacancy/108969537?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Innowise Group / Фабрика инноваций и решений",
  "textContent" : "Innowise Group на рынке с 2007 года. За это время наша команда реализовала 850+ проектов для заказчиков из 60+ стран мира — и эти показатели постоянно растут. Для тебя это возможность интенсивно развиваться, пробовать себя в разных направлениях и технологиях, стать ментором и реализовывать свои самые смелые карьерные ожидания. Основа нашего успеха — крутая команда. У нас сформировалось профессиональное комьюнити, которое поможет тебе расти, общаться с экспертами и поддерживать компетенции на высоком уровне. Информация о проекте: Мы занимаемся разработкой информационной системы для управления транспортным сообщением в одном из крупных городов. Система включает мобильное приложение, веб-платформу, информационные дисплеи на остановках и в других общественных местах. Мы интегрируем данные о маршрутах и времени прибытия транспорта в реальном времени, предоставляя пользователям возможность легко планировать поездки, получать уведомления о изменениях маршрутов и пополнять проездные карты. Система использует внешние данные о маршрутах и добавляет GPS-треки транспорта в реальном времени для обновления информации о движении. Наше решение активно используется разными сервисами для планирования поездок, информационными дисплеями и операторами общественного транспорта. Наши ожидания: Коммерческий опыт работы от 2-ух лет. Опыт работы с микросервисной архитектурой и высоконагруженными системами. Уверенное владение .Net, C#, ASP.NET Core, Razor Pages. Знание JavaScript, Typescript, React, Node.js. Опыт работы с облачными решениями (Azure, Firebase) и инструментами (Azure DevOps). Гибкий график с обязательной работой 4 часа ночью для коммуникации с клиентами и командой. Будет плюсом: Опыт работы с CMS (например, Umbraco) и AngularJS будет плюсом. Чем предстоит заниматься: Разработка и поддержка микросервисной архитектуры на разных языках программирования (C#, .Net, Java, Node.js). Интеграция с внешними источниками данных о транспортных маршрутах и управление GPS-треками. Реализация нотификаций для пользователей о изменениях маршрутов и других событиях. Разработка UI для веб-приложений, мобильных платформ и публичных информационных дисплеев. Оптимизация и поддержка системы, которая уже несколько лет в продакшене. Мы предлагаем: Обучение и развитие: Большой пул разноплановых проектов в таких сферах, как FinTech, Medicine, Entertainment, eCommerce, Gaming, Artificial Intelligence и пр.; Минимум легаси; короткий бенч; Широкий стек технологий, возможность перехода между ними; Индивидуальные карты роста и регулярный пересмотр условий (роли на проекте, уровня ЗП) Подготовка к собеседованиям с зарубежными заказчиками на английском языке. Рабочая среда: Формат работы: офис; Просторные и комфортные рабочие места; Подробный онбординг: знакомство с командой, процессами и правилами, экскурсия по офису, welcome card; Уютные кухни, игровые комнаты, коворкинги, лаунж-зоны. Дополнительные бонусы: Добровольное медицинское страхование. Cкидки у компаний-партнеров (от пиццерий и книжных до магазинов бытовой техники). Ну что, ты с нами? Ждем тебя в нашей дружной команде!",
  "keywords" : [ "Razor Pages", "Umbraco CMS", "Tailwind CSS" ]
}, {
  "url" : "https://hh.ru/vacancy/107877858?query=java",
  "companyName" : "Т-Банк",
  "textContent" : "Ищем QA-инженеров, которые будут тестировать backend. У нас много проектов и интересных задач — вам понравится. В Т-Банк мы создаем и развиваем десятки высоконагруженных сервисов. А QA-команда делает так, чтобы все работало без сбоев 24/7. Каждый день мы проводим сотни тестов и проверяем десятки гипотез, чтобы создавать продукты, которые нравятся клиентам. Мы ищем QA-backend-инженеров, которые разделяют наши главные ценности: высокое качество и безопасность продуктов. Среди проектов — внутренние и внешние платформы, обеспечивающие работу сервисов. Мы тестируем приложения в связке с брокерами сообщений: Kafka, MQ, а также с базами данных: Oracle, PostgreSQL, Ignite. А еще тестируем API продуктов и сервисов, используя Postman, Swagger и автотесты. Что нужно будет делать: Проводить функциональное и автоматизированное тестирование. В том числе анализировать и тестировать требования; Работать в продуктовой команде; Разрабатывать тестовую документацию и приемочные критерии, готовить тестовые данные; Сопровождать релизы. Что мы ждем от нашего кандидата: Знаете теорию тестирования, есть опыт работы в тестировании от 2 лет; Знаете тест-дизайн: умеете применять основные техники, составлять чек-листы и тест-планы под задачи; Знаете один из языков программирования: Java, Kotlin или Go; Знаете SQL (джойны, группировки); Умеете работать с API (rest/soap); Умеете работать с системами логирования: отчетами, алертами и дашбордами; Разбираетесь в Gitlab, работаете с пайплайнами и логами. Мы предлагаем: Возможность работы в аккредитованной ИТ-компании; Комфортную для тебя заработную плату (обсудим ее на собеседовании); Полис ДМС со стоматологией и страховка от несчастных случаев для тебя, а также льготные условия страхования для близких; Компенсация спорта и фитнеса по системе AllSports (золотая карта); Компенсация питания и такси; Мощную технику на выбор (MAC/WIN); Профессиональное развитие. Проводим митапы, тренинги и мастер-классы, дадим доступ к огромной технической библиотеке; Оплата конференций, курсов и много чего еще.",
  "keywords" : [ ],
  "addressString" : "Минск, проспект Победителей, 110"
}, {
  "url" : "https://rabota.by/vacancy/108745406?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Софтвейл",
  "textContent" : "Softwhale is a young dynamic outstaffing company that brings together the best features for your product. The Softwhale team is engaged in the integrated development of IT products. We are offering favorable conditions for our clients and employees, which ensure highly productive collaboration. The Softwhale team is helping with: building up new projects from scratch integrate an existing AEM-based site with third-party services implementation: OSGi module, AEM components migration: version to version, non-AEM to AEM consulting and expertise: security, accessibility, performance Now we are looking for an AEM developer to join our team, with whom we will grow and develop the products of our clients. We expect you to have experience with: HTL AEM Components Clientlibs Sling Models OSGi Components/Services OSGi Configurations Sling Servlets Event Listeners DAM AEM Search ACL Dispatcher configurations We invite you to join our team!",
  "keywords" : [ "Английский — B1-B2", "Java", "AEM" ]
}, {
  "url" : "https://hh.ru/vacancy/107877890?query=java",
  "companyName" : "Т-Банк",
  "textContent" : "Ищем тимлидов для развития проектов: — мобильный банк для физлиц, бизнеса и инвестиций; — нефинансовые сервисы внутри банка с помощью кросс-платформенных решений; — машинное обучение в продуктах и внутренние процессы компании, вкладываемся в долгосрочные исследования. Развиваем сервис телефонного ассистента Олега для защиты от спамеров и мошенников; — высоконагруженная и отказоустойчивая система Т-Инвестиций, которая управляет активами пользователей, принимает запросы на операции с активами, обрабатывает информацию от биржи; — развитие ИТ в России: делимся опытом и приглашаем выступать экспертов из других компаний; — масштабируем существующие и создаем новые продукты на международном рынке. Вам предстоит: управление командой разработки (аналитики, разработчики, QA-инженеры), участие и принятие решений в найме определение стека разработки для новых сервисов найм сотрудников обсуждение требований и участие в планировании развития продукта проектирование архитектуры решений проработка архитектуры со смежными подразделениями Что ждем от кандидата: опыт работы в роли TeamLead команды разработки > 1 года опыт управления полноценной командой (аналитика-разработка-тестирование-delivery от аналитики до production) хорошее знание используемого стека разработки (нужно пройти собеседования по соответствующим секциям найма : .NET, Java, Python, Go, Frontend) опыт построения решений в микросервисной архитектуре опыт в проектировании систем (хорошая оценка в секции Дизайна) Мы предлагаем: Работу в офисе в Минске. График работы — гибридный Оформление по ТК РБ Платформу обучения и развития «Т‑Банк Апгрейд». Курсы, тренинги, вебинары и базы знаний. Поддержку менторов и наставников, помощь в поиске точек роста и карьерном развитии Заботу о здоровье. Оформим полис ДМС со стоматологией и страховку от несчастных случаев. Компенсацию обедов и транспорта После окончания испытательного срока — частичную компенсацию затрат на спорт и 5 sick days в год 31 календарный день отпуска в год Программу лояльности для сотрудников от партнеров Достойную зарплату — обсудим ее на собеседовании",
  "keywords" : [ "Разработка", "Teamleading" ]
}, {
  "url" : "https://rabota.by/vacancy/108105033?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Национальный центр электронных услуг, РУП",
  "textContent" : "Обязанности: Объектная область: электронные услуги и электронное провительство. Разработка и внедрение прикладного программного обеспечения; поддержка существующего ПО и разработка нового; участие в разработке технической документации; формирование технических требований к разрабатываемому ПО. Требования: - высшее профессиональное (математическое, инженерно-математическое, техническое) образование; - знание языка программирования Java 8+, Spring Framework, Spring Boot; - знание SQL; - опыт работы с REST API; - навыки работы с Postman; - понимание бизнес-процессов, разработка бизнес-логики; - знание swagger; - коммуникабельность, системное мышление и ориентированность на результат; - стремление к профессиональному росту, желание осваивать и применять новые технологии; - умение самостоятельно оценивать, контролировать и планировать свою работу в установленные дедлайны; - умение и желание работать в команде. Будет плюсом: - опыт работы с ПО таможенных органов; - опыт работы с Kubernetes; - опыт работы Kafka. Обязательное выполнение тестового задания. Условия: - испытательный срок 3 месяца; - режим работы: пн-чт с 9.00 до 18.00, пт с 9.00 до 16.45, перерыв для отдыха с 13.00 до 13.45; - возможность лично поучаствовать в процессе разработки и реализации перспективных технологических и организационных решений, позволяющих значительно упростить (перевести в удобное удаленное цифровое взаимодействие) повседневную жизнь граждан и организаций, как в части взаимодействия с государственными структурами, так и в части предоставления единых универсальных технологических платформ и сервисов для повседневной жизни; - фициальное трудоустройство, своевременная и стабильная заработная плата; - озможность профессионального роста (обучение, посещение семинаров и конференций); - оплачиваемый отпуск от 28 календарных дней; - дополнительные поощрительные бонусы и выплаты по результатам работы (квартальные и годовая премии, материальная помощь на оздоровление к отпуску); - медицинское страхование; - яркая и насыщенная корпоративная культура; - комфортный, современный офис и его удобное расположение (шаговая доступность от ст.м. Кунцевщина).",
  "keywords" : [ "Системное мышление", "REST API", "Анализ бизнес-процессов", "Swagger", "Kafka", "Spring Framework", "Spring Boot", "Postman", "SQL", "Java 8+", "Kubernetes" ],
  "addressString" : "Минск, Кунцевщина, улица Притыцкого, 64"
}, {
  "url" : "https://rabota.by/vacancy/110036563?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Innowise Group / Фабрика инноваций и решений",
  "textContent" : "Innowise Group на рынке с 2007 года. За это время наша команда реализовала 850+ проектов для заказчиков из 60+ стран мира — и эти показатели постоянно растут. Для тебя это возможность интенсивно развиваться, пробовать себя в разных направлениях и технологиях, стать ментором и реализовывать свои самые смелые карьерные ожидания. Основа нашего успеха — крутая команда. У нас сформировалось профессиональное комьюнити, которое поможет тебе расти, общаться с экспертами и поддерживать компетенции на высоком уровне. Наши ожидания: Уверенное знание Java Core; Минимум 2+ проекта в карьере; Опыт в Microservices; Опыт в Spring ecosystem(Spring boot, Spring Data, Spring Cloud and etc); Опыт в Message Brokers(Kafka, ActiveMQ, RabbitMQ); Опыт в Nosql/SQL базах данных на продвинутом уровне; Разговорный уровень английского языка от B1+; Разговорный уровень немецкого языка от В1. Будет плюсом: Опыт в разбиении монолита на микросервисы; Опыт в качестве Full stack разработчика(React/Angular); Опыт в прохождении интервью на английском языке; Опыт в Cloud(Aws, Azure, GCP) Опыт управления командой от 3 человек, желание принимать участие в настройке процессов компании. Мы предлагаем: Обучение и развитие: Большой пул разноплановых проектов в таких сферах, как FinTech, Medicine, Entertainment, eCommerce, Gaming, Artificial Intelligence и пр.; Минимум легаси; короткий бенч; Широкий стек технологий, возможность перехода между ними; Индивидуальные карты роста и регулярный пересмотр условий (роли на проекте, уровня ЗП); Подготовку к собеседованиям с зарубежными заказчиками на английском языке. Рабочая среда: Формат работы в офисе; Просторные и комфортные рабочие места; Подробный онбординг: знакомство с командой, процессами и правилами, экскурсия по офису, welcome card; Уютные кухни, игровые комнаты, коворкинги, лаунж-зоны. Дополнительные бонусы: Добровольное медицинское страхование; Cкидки у компаний-партнеров (от пиццерий и книжных до магазинов бытовой техники). Если ты ищешь реальные возможности реализовать себя, управлять профессиональным и карьерным ростом – будем рады видеть тебя в нашей дружной команде!",
  "keywords" : [ "Java" ]
}, {
  "url" : "https://hh.ru/vacancy/110445256?query=java",
  "companyName" : "Aston",
  "textContent" : "Мы — российская аккредитованная ИТ-компания, четырехкратный обладатель премии «Работодатель года» по версии Habr. C 2007 года разрабатываем цифровые решения для b2b-клиентов. Мы работаем с топовыми российскими и иностранными компаниями и знаем, какие специалисты востребованы на рынке. Поэтому приглашаем вас на стажировку Java-разработчик. Лучшие получат свою первую работу в ИТ! Ежегодно мы обучаем 900+ человек, 75% стажеров с первого раза проходят интервью на проекты. Требования к кандидатам: понимание принципов ООП, понимание алгоритмов и структур данных, знание Java Core; обязательное знание основ Java EE (Servlets, jsp); представление о реляционных базах данных (Oracle, MySQL, PostgreSQL и др.); опыт написания unit-тестов, знания систем контроля версий (git или svn), Spring Framework, а также ORM (Hibernate Framework); готовность к командировкам; знание английского языка на уровне Pre-Intermediate и выше; высшее образование. Что мы предлагаем? Оформление по ТК РБ; Официально устраиваем на работу; Даём доступ к корпоративной программе обучения; Берём на работу также лучших стажёров; После выхода на проект регулярно пересматриваем и повышаем зарплату; Обеспечиваем классические IT-плюшки: офис в центре города, бесплатный английский, корпоративные ивенты, частичная компенсация стоимости спортивных абонементов. Условия стажировки: Обучение 3-4 месяца 5 дней в неделю с 9:00 до 18:00 с перерывом на обед; Изучение теории с еженедельными проверками изученного материала; Практика на учебных проектах под руководством опытного техлида; Подготовка к собеседованию и самопрезентации; Пройти обучение удаленно. Приходи в ASTON и расти вместе с нами!",
  "keywords" : [ "Java EE", "Java Servlets", "Java", "Unit Testing", "PostgreSQL", "JSP", "SVN", "ORACLE", "ООП", "Git", "MySQL", "Hibernate ORM", "Spring Framework" ]
}, {
  "url" : "https://hh.ru/vacancy/107877873?query=java",
  "companyName" : "Т-Банк",
  "textContent" : "Ищем QA-инженеров, которые будут тестировать backend. У нас много проектов и интересных задач — вам понравится. В Т-Банк мы создаем и развиваем десятки высоконагруженных сервисов. А QA-команда делает так, чтобы все работало без сбоев 24/7. Каждый день мы проводим сотни тестов и проверяем десятки гипотез, чтобы создавать продукты, которые нравятся клиентам. Мы ищем QA-backend-инженеров, которые разделяют наши главные ценности: высокое качество и безопасность продуктов. Среди проектов — внутренние и внешние платформы, обеспечивающие работу сервисов. Мы тестируем приложения в связке с брокерами сообщений: Kafka, MQ, а также с базами данных: Oracle, PostgreSQL, Ignite. А еще тестируем API продуктов и сервисов, используя Postman, Swagger и автотесты. Что нужно будет делать: Проводить функциональное и автоматизированное тестирование. В том числе анализировать и тестировать требования; Работать в продуктовой команде; Разрабатывать тестовую документацию и приемочные критерии, готовить тестовые данные; Сопровождать релизы. Что мы ждем от нашего кандидата: Знаете теорию тестирования, есть опыт работы в тестировании от 2 лет; Знаете тест-дизайн: умеете применять основные техники, составлять чек-листы и тест-планы под задачи; Знаете один из языков программирования: Java, Kotlin или Go; Знаете SQL (джойны, группировки); Умеете работать с API (rest/soap); Умеете работать с системами логирования: отчетами, алертами и дашбордами; Разбираетесь в Gitlab, работаете с пайплайнами и логами. Мы предлагаем: Возможность работы в аккредитованной ИТ-компании; Комфортную для тебя заработную плату (обсудим ее на собеседовании); Полис ДМС со стоматологией и страховка от несчастных случаев для тебя, а также льготные условия страхования для близких; Компенсация спорта и фитнеса по системе AllSports (золотая карта); Компенсация питания и такси; Мощную технику на выбор (MAC/WIN); Профессиональное развитие. Проводим митапы, тренинги и мастер-классы, дадим доступ к огромной технической библиотеке; Оплата конференций, курсов и много чего еще.",
  "keywords" : [ "C#", "Java", "Git", "JavaScript", "Функциональное тестирование", "SQL", "Python" ],
  "addressString" : "Минск, проспект Победителей, 110"
}, {
  "url" : "https://rabota.by/vacancy/110144675?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО ВЭБ Технологии",
  "textContent" : "We are looking for Java Developer Lead to expand our team and to work on Fintech and other external projects. Stack: Java 17+, Spring-Boot, Spring JPA, Spring Security, Cloud, K8S, Helm, GitLab AutoDevOps, Redis, PostgreSQL, JUnit, Mockito, Wiremock, Spock, Pact, Prometheus, Grafana. What will you do: Develop new features and keep existing application healthy; Migrate functionality from legacy applications to new one; Maintain team technical expertise and performance in green area. Experience needed: Minimum 5 years of relevant work experience (as Java Developer); Solid experience with Spring Framework; Hands on experience in development functionality accompanied by unit tests, integration tests, etc; Proficient in Object Oriented Analysis and Design; Familiar with RDBMS including ORM, SQL; Extensive experience in building either SOA applications or system integrated with many 3-rd party dependencies via RESTful API; Extensive experience in building production ready microservice solutions. Will be a plus: Ability to read React and .net code; Ability to justify decisions for non-technical people; Ability to mentor teammates and keep their personal development plans synchronized with strategic project needs. Focus on result. Any activity starts from definition of success or definition of done. Education activities, proof of concepts development, research tasks, all have to converge to tangible result Open-minded but have healthy level of critical thinking. E.g. following common 4 questions every time making a decision regarding new technology/tool/approach: What is the power of technology? What limitations does the technology diminish? What rules enable us to manage this limitation? What new rules will be need? Understand a power of team work. Team work means: using advantage of expertise of many individuals that accelerates solving tricky problems; knowledge sharing, more valuable comments on solution/technology assessing session, etc We offer: Extended social package (medical insurance, significant events benefits, corporate English teachers); Decent salary; Sick leave is paid according to the Laws of Belarus; 29 days of vacation; Possibility to work remotely; Payment for external trainings, seminars, conferences; Office in the center of Minsk (Molodezhnaya station); Small office rooms, not open space.",
  "keywords" : [ ],
  "addressString" : "Минск, Молодежная, улица Скрыганова, 6/3"
}, {
  "url" : "https://rabota.by/vacancy/109138959?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО УайтСнейк",
  "textContent" : "WhiteSnake — активно развивающаяся IT-компания, специализирующаяся на разработке веб-приложений и IT-консалтинге. Мы фокусируемся на развитии в областях Python Backend разработки и Data Science Наш опыт в сочетании с простым и качественным кодом помогает нам реализовывать по-настоящему крутые и глобальные проекты для наших партнёров Мы ищем опытного AQA Engineer в нашу дружную команду Что для нас важно: Знание языка программирования Python Коммерческий опыт создания веб-приложений с использованием Python-фреймворка (Pytest/Selenium/WebDriver/Behave/Appium/Robot) от 1 года. Четкое понимание жизненного цикла проекта и места QA в этом цикле Опыт работы с CI\\CD системами Опыт ведения проектов с различными методологиями разработки ПО (SCRUM, Kanban) Опыт работы с SQL, NoSQL базами данных Опыт тестирования API Понимание принципов работы клиент-серверной архитектуры Опыт работы с VCS Уровень владения английским языком B1 и выше Будет плюсом: Знание других языков программирования (Java, JavaScript и др.) Опыт работы с тестированием мобильных приложений Навыки определения области покрытия тестирования и оценки качества тестового набора Опыт наставничества и обучения других членов команды Опыт работы со скриптовыми языками (powershell, bash) Условия работы и бонусы: Просторный офис А класса в нескольких шагах от метро Оформление по ТК РБ Уютная кухня, где Вас ждут свежие фрукты, чай, кофе, печенье и перекусы Широкий спектр бенефитов, включая частичную компенсацию расходов на спорт, транспорт и медицину Защищённая от инфляции заработная плата Оплачиваемые больничные согласно ТК РБ Молодой и дружный коллектив, где ценятся инновации и совместная работа Гибкий рабочий график, который поможет сохранить баланс между работой и личной жизнью Возможность изучать английский язык с нашим штатным преподавателем",
  "keywords" : [ "QA", "Тестирование API", "Pytest", "CI/CD", "Selenium IDE", "Автоматизированное тестирование", "Английский язык", "Python", "SQL" ],
  "addressString" : "Минск, проспект Дзержинского, 104"
}, {
  "url" : "https://hh.ru/vacancy/109749085?query=java",
  "companyName" : "Т-Банк",
  "textContent" : "Т-Банк — это амбициозные ИТ-проекты и высоконагруженные системы: от мобильного банка и облачного колл-центра до инвестиционных площадок и ML-продуктов. Наша пользовательская аудитория — более 36 млн человек. Важная часть команды — SRE-инженеры, которые отвечают за надежность и отказоустойчивость приложений и инфраструктуры. Мы ищем специалистов от уровня миддл до лидов. Вам у нас понравится, если вы: Понимаете важность стабильной работы приложений Любите анализировать причины сбоев в работе софта и инфраструктуры Разделяете принцип проактивности: лучше предотвратить сбой, чем потом его устранять Хотите автоматизировать рутину, чтобы заниматься более интересными задачами Обязанности Разрабатывать инструменты для повышения надежности информационных систем Участвовать в устранении сбоев и расследовании их причин Повышать Observability приложений Проектировать, внедрять и поддерживать метрики для мониторинга Поддерживать бесперебойную работу сервисов Автоматизировать рутинную работу Проектировать и внедрять отказоустойчивую архитектуру приложений Договариваться с коллегами и находить лучшие решения для проекта Требования Умеете работать с Linux на уровне системного администратора Уверенно владеете одним из языков программирования: Go, C#, Python, Java и другие Понимаете принципы построения CI/CD-пайплайнов и IaC-подхода Ориентируетесь в ИТ: сетях, работе с данными, протоколах интернета, RPC и другом Работали с системами контроля версий Git Работали с системами мониторинга Prometheus и Grafana, агрегаторами логов Splunk, ELK и Graylog Работали с системами контейнеризации и оркестрации Docker и k8s Можете быстро принимать решения во время сбоя, не теряетесь и не сдаетесь Что мы предлагаем? Работу в офисе в Минске. График работы — гибридный Оформление по ТК РБ Платформу обучения и развития «Т‑Банк Апгрейд». Курсы, тренинги, вебинары и базы знаний. Поддержку менторов и наставников, помощь в поиске точек роста и карьерном развитии Заботу о здоровье. Оформим полис ДМС со стоматологией и страховку от несчастных случаев. Компенсацию обедов и транспорта После окончания испытательного срока — частичную компенсацию затрат на спорт и 5 sick days в год 31 календарный день отпуска в год Программу лояльности для сотрудников от партнеров Достойную зарплату — обсудим ее на собеседовании",
  "keywords" : [ "GitLab CI", "Ansible", "Python / Go / Java / C# / TypeScript", "Atlassian Confluence", "Gitlab", "Jira", "Kubernetes" ]
}, {
  "url" : "https://rabota.by/vacancy/109754327?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Бэлл Интегратор",
  "textContent" : "Bell Integrator – один из ведущих системных интеграторов страны. Мы аккредитованная ИТ-компания и являемся частью большой семьи ГК Softline. Bell Integrator активно реализует проекты по всей России, среди наших заказчиков – крупнейшие системообразующие финансовые, телеком и ритейл компании страны. Формат работы: удалённо с территории Беларуси, России, Казахстана. Проект: Универсальный клиентский фронт. На текущий момент у компании есть ряд приложений - Мир Инвестиций, Капитал, локальное приложение для ЮАР (brokstock) и тд. В планах выход на новые рынки. Отсюда потребность быстрого выхода на новые рынки (подразумевается работа с клиентами других стран). У каждого рынка свой бэк, с которым необходимо интегрироваться, свои требования по реализации согласно местному законодательству, особенностям учета и ведения документов и тд. Самый простой вариант – написание каждый раз нового мобильного приложения. Однако это связано для компании с большими временными и финансовыми затратами, а также необходимостью поддержки и развития всей линейки приложений. Принято решение о создании универсальной платформы клиентского фронта, которую можно будет быстро дорабатывать и кастомизировать под новые регионы. Платформа создается как green field, с учетом наработок существующих приложений. В состав системы входят базовые приложения под iOS и Android, веб-интерфейс админки, сама микросервисная платформа. Требования: Глубокое знание Java core Знание принципов ООП и понимание паттернов проектирования Опыт разработки систем в парадигме микросервисной архитектуры. Опыт работы с Camunda Опыт работы со Spring Framework (Spring boot, Spring Cloud) Опыт работы с брокерами сообщений (Kafka) Опыт работы с PostgreSQL Опыт работы с Junit или другим фреймворком для тестов Хорошее понимание принципов Agile разработки Умение читать чужой код, делать ревью Опыт в финтех проектах Желательные требования: Понимание технологий DevOps Опыт работы с Docker, Kubernetes Опыт работы в территориально распределенных командах Условия: Конкурентоспособная заработная плата Корпоративное обучение и сертификацию в технических и бизнес областях Корпоративные развлекательные программы Помощь при релокации Формат работы удаленный на территории РФ, РБ, Казахстана",
  "keywords" : [ ]
}, {
  "url" : "https://rabota.by/vacancy/109076264?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "LeverX",
  "textContent" : "LeverX is seeking a talented SAP BTP Consultant to join our dynamic team. This is an exciting opportunity to work with a global IT partner and gain experience in building business applications using cutting-edge technologies and SAP Business Technology Platform (BTP) services across international projects. REQUIREMENTS: Minimum 5 years of experience working in the SAP environment connected with any of the products: S/4HANA, SAP Cloud Solutions (Ariba, SuccessFactors, CX, etc) Expertise in management of the SAP BTP Services and Tools via Platform Cockpit Expertise in SAP BTP Services setup: Trust, Platform Roles, Destinations, Connectivity (including Cloud Connector), Principal Propagation Expertise with SAP Cloud Identity Services (IAS and IPS), XSUAA. Setup, configuration, administration. Experience with SAP BTP Cloud Foundry environment (CLI and operations) Expertise in solution architecture or willing to grow as solution architect Excellent English communication skills (verbal and written) Desire to learn and explore new cloud technologies and tools RESPONSIBILITIES: Be part of LeverX BTP Community, including engineers, architects, and solution experts. Design, develop, and deploy cloud enterprise solutions using a combination of SAP technologies and solutions, focusing on Automation and Integration. Collaborate with functional analysts and architects to capture requirements, and work with developers to design consumer-grade business applications. Stay updated with the latest SAP BTP features and services, participating in internal meetups and knowledge-sharing sessions. Analyze and resolve significant, complex, high-impact production issues, evaluating alternatives as necessary and implementing solutions. Balance multiple tasks efficiently and switch between different tasks as needed. Work with multi-regional teams across different time zones. ‘Nice to have’ skills: Experience in any solution from SAP Build portfolio: Work Zone, Apps, Process Automation, Code Knowledge of the SAP development standards and methodologies Understanding of multi tenant application development approaches Experience with HANA Cloud (Operations, Development) Understanding of Modern SAP web standards - Web Components, CAP (Node.js / Java) Understanding of Event driven architecture and application within SAP environment (Event Mesh) Expertise with other SAP BTP services and tools Expertise participating in Pre-Sales / Solution Design Makes you stand out: - Expertise with CAP (Node.js or Java) - Expertise in enterprise architecture topics",
  "keywords" : [ ]
}, {
  "url" : "https://rabota.by/vacancy/90897379?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Альфа-Банк: направление массового бизнеса",
  "textContent" : "Альфа Банк – один из ведущих частных банков, который входит в число системно значимых банков Беларуси. Мы работаем как финтех-компания, интегрируя в свою бизнес-модель успешные практики в области мобильных платежей, онлайн-кредитования, цифровых транзакций и других передовые технологии. Сейчас в Альфе более 60 тысяч бизнес-клиентов и почти миллион клиентов-физлиц. Сегодня в команде Альфа Банка более 2500 профессионалов. Мы объединяем людей с разным опытом, взглядами и интересами. Присоединяйся к команде. Вместе мы способны на большее! Ключевые задачи: Ручное и автоматизированное тестирование веб приложений (UI, Integration, API, e2e testing); Опыт работы с TMS (Allure TestOps, TestRail, TestIT); Организация процесса тестирования на проектах; Ведение документации по тестированию проектов; Знания в области обеспечения качества ПО. Пожелания к кандидатам: от 3 лет опыта работы; Хорошее понимание процессов разработки ПО; Уверенное знание процессов тестирования и обеспечения качества; Знания инструментов автоматизированного тестирования для платформ Web; Обширные знания методов/методологий тестирования и умение применять их на практике; Практический опыт проведения различных видов тестирования; Написание тестовой документации (тестовые примеры, контрольные списки, отчеты об ошибках, планы и стратегии тестирования); Опыт использования инструментов управления дефектами (например JIRA); Опыт использования систем управления тестированием (например Allure TestOps, TestRail, TestIT); Система контроля версий (например, Git, SVN); Знание языков TypeScript; Что предлагаем для твоего комфорта: работу в команде с высокой экспертизой; современный стек технологий, масштабные проекты и сильную команду; мощное железо для работы; формат работы на выбор (удаленный/гибкий график); сочетание стабильности банка и гибкости ИТ; Альфа Среду (серию митапов о цифровой трансформации банка).",
  "keywords" : [ "QA", "TypeScript", "AQA", "Atlassian Jira", "JavaScript", "Playwright", "Тестирование", "SQL" ]
}, {
  "url" : "https://hh.ru/vacancy/107877885?query=java",
  "companyName" : "Т-Банк",
  "textContent" : "Ищем в команду специалиста, который будет автоматизировать процессы тестирования и разработки В T-Банк мы создаем и развиваем десятки высоконагруженных сервисов. А QA-команда делает так, чтобы все работало без сбоев 24/7. Каждый день мы проводим сотни тестов и проверяем десятки гипотез, чтобы создавать продукты, которые нравятся клиентам. Наша команда по автоматизированному тестированию растет, и сейчас мы в поиске инженера по автоматизации тестирования с использованием Java/Kotlin. Это вакансия для тех, кто готов большую часть рабочего времени уделять автоматизации и работе с кодом. Что нужно будет делать: Автоматизировать процессы тестирования и разработки; Автоматизировать сбор статистики и составление отчетов по результатам запуска автотестов; Разрабатывать QA-инструменты для команды тестирования; Разрабатывать и поддерживать окружение для запуска автотестов: Gitlab, K8s и так далее; Привлекать функциональных тестировщиков к автоматизации регрессионных сценариев; Участвовать в процессе code review. Что мы ждем от нашего кандидата: У вас есть опыт работы в качестве автоматизатора тестирования/SDET от 2 лет; Хорошо разбираетесь в автоматизированных сценариях на Java/Kotlin, есть опыт их разработки; Есть опыт автоматизации с использованием фреймворка TestNG или JUnit; Умеете работать с REST API, SOAP API, HTTP/HTTPS, gRPC, Avro; Знаете SQL: DML-, DDL-запросы, JOIN, группировки и агрегирующие функции; Есть опыт использования систем сборки: Maven, Gradle и других; Есть опыт настройки CI/CD с помощью TeamCity, Jenkins или GitLab; Умеете работать по гибким методологиям, разделяете их ценности и понимаете процессы. Мы предлагаем: Возможность работы в аккредитованной ИТ-компании; Комфортную для тебя заработную плату (обсудим ее на собеседовании); Полис ДМС со стоматологией и страховка от несчастных случаев для тебя, а также льготные условия страхования для близких; Компенсация спорта и фитнеса по системе AllSports (золотая карта); Компенсация питания и такси; Мощную технику на выбор (MAC/WIN); Профессиональное развитие. Проводим митапы, тренинги и мастер-классы, дадим доступ к огромной технической библиотеке; Оплата конференций, курсов и много чего еще.",
  "keywords" : [ "Java", "Git", "TeamCity", "SQL", "Python" ],
  "addressString" : "Минск, проспект Победителей, 110"
}, {
  "url" : "https://rabota.by/vacancy/110022044?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Бэлл Интегратор",
  "textContent" : "Удаленный формат работы Bell Integrator – аккредитованная ИТ-компания и являемся частью большой семьи ГК Softline. Bell Integrator активно реализует проекты по всей России, среди наших заказчиков – крупнейшие системообразующие финансовые, телеком и ритейл компании страны. Банковский проект. Требования Опыт работы в автоматизации тестирования от 3-х лет Опыт в автоматизации тестирования клиент-серверных приложений (и/или - API, WEB, MQ, DB) Знание Java stream api + functional interfaces + модификаторы +- реализация ООП концепций Опыт разработки тестовой документации (чек-листы, планы, отчеты и тому подобное) Умение находить/формулировать/предлагать решения Высокий уровень самоорганизации и коммуникативные навыки Обязанности Разработка API, WEB, MQ, DB автотестов на Java Тестирование ТЗ на разработку (полнота, непротиворечивость и т.п.) Разработка чек-листов по требованиям (xray) Фиксация дефектов, не проработанных/спорных моментов в Jira/Confluence Разработка вспомогательных общих решений + code review Заведение и контроль исправления дефектов Взаимодействие с командой аналитиков и разработчиков",
  "keywords" : [ "Java", "MQ", "WEB", "API", "Автоматизированное тестирование", "DB" ]
}, {
  "url" : "https://rabota.by/vacancy/109309885?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Иностранное унитарное предприятие Адмитад",
  "textContent" : "Мы ищем Senior DevOps Engineer. Обязанности: Разработка CI/CD решений; Активное участие в переходе сервисов на микросервисную архитектуру; Тесное сотрудничество с отделами разработки, тестирования; Поддержка и развитие инструментов мониторинга сервисов продукта; Автоматизация тестовой среды и задач поддержки производства. Требования: Опыт работы в должности DevOps-инженера не менее 2 лет; Опыт администрирования Linux (знание архитектур Debian, Ubuntu, Centos) не менее 2 лет; Опыт работы с платформами виртуализации (Vmware, KVM, Xen); Опыт работы с контейнерами (LXC, Docker,Containerd) не менее 1 года; Опыт работы на K8S (AWS, GCE, BareMetal) не менее 1 года; Навыки настройки сетевой инфраструктуры; CI/CD (предпочтительно Gitlab); Знание технологий: Web (nginx/php/python/gnodejs/o/ruby/java); Прометей/Grafana, Ansible/Terraform, bash/Python/Go; Опыт работы в проектах с высоким трафиком и понимание принципов отказоустойчивости и масштабируемости сервисов. Условия: Работа в международной компании; Гибридный формат работы (офис/домашний офис); Современный офисс; Корпоративное обучение - курсы и тренинги, встречи и конференции; Добровольное медицинское страхование после испытательного срока; Частичная компенсация расходов на посещение тренажерного зала; Корпоративные мероприятия и тимбилдинги.",
  "keywords" : [ "Ubuntu", "K8S", "GCE", "Go", "Prometheus", "Grafana", "DevOps", "Debian", "Linux", "Docker", "Terraform", "BareMetal", "Ansible", "CI/CD", "CentOS", "AWS", "Python" ]
}, {
  "url" : "https://hh.ru/vacancy/109456016?query=java",
  "companyName" : "Aston",
  "textContent" : "Аутсорсинговая аккредитованная IT-компания Aston приглашает стать частью нашей команды. Мы работаем на рынке с 2007 года, а штат насчитывает 2500+ сотрудников. Aston предоставляет услуги по разработке программного обеспечения и IT-аутсорсинга предприятиям, организациям и стартапам. Компания активно развивается в доменах: Finance, Healthcare, eCommerce, IoT, Media and Entertainment, Big Data, Machine learning, Deep learning. Заказчик входит в топ-10 российских банков по величине активов, кредитного портфеля, размеру средств, привлеченных от клиентов, и нормативного капитала. Банк активно развивает онлайн-сервисы и работает по стратегии Mobile first. В компании есть отдельное подразделение, в котором создаются digital-продукты и внедряются цифровые технологии. Ищем Android Developer в нашу команду профессионалов. Чего мы ждем от специалиста? опыт работы в роли Android Developer от 3-х лет; знание Android SDK; опыт работы с библиотеками RxJava 2, Dagger 2, Retrofit,OkHttp, Android Architecture Components; опыт проведения и прохождения код-ревью; умение работать с Git и знание Git flow; умение писать Unit и UI-тесты; умение читать и работать с кодом Coroutines; знание Kotlin и Java; знание MVP, MVVM, MVI, SOLID; знание гайдлайнов Material Design; понимание принципов работы RESTful API и HTTP; понимание как сделать быстрый и отзывчивый UI. Будет плюсом: опыт работы с Jenkins, Docker или c другими инструментами CI/CD; опыт выступления на конференциях с докладами или написания технических статей; опыт работы с многомодульными gradle-проектами; наличие опубликованных приложений в Google Play; понимание, как оптимизировать приложение и сделать его быстрее; умение влиять на решение при оценке резюме. Что мы предлагаем? Хорошая зарплата размер зарплаты обсуждаем отдельно с каждым кандидатом; доплачиваем за менторство, ведение обучающих курсов, ревью проектов и участие в других профактивностях компании. Развитие в профессии долгосрочные проекты от российских заказчиков; возможность выбирать или менять проект и пробовать себя в новых направлениях; прозрачная система Performance Review; ментор на все время работы в компании. Комфорт и свобода возможность выбирать формат работы: удаленный, из офиса или гибридный; комфортные офисы в городах-центрах разработки; поэтапная система адаптации новых сотрудников. Обучение корпоративный портал с материалами для изучения любого нового стека и повышения уровня по своей специальности и не только; участие в технических митапах и конференциях в качестве гостя и спикера. Социальный пакет оформление по ТК РБ; медицинская страховка (+стоматология); частичная компенсация спортивных абонементов; компенсация расходов на оплату коворкинга; оплачиваемый отпуск 25 дней в году; оплачиваемые больничные. Корпоративная жизнь корпоративы и тимбилдинги; детские праздники и мастер-классы с подарками и сладостями для семей сотрудников. Адреса наших офисов г. Минск, проспект Победителей, 7А, 24 этаж; г. Витебск, Московский проспект, 70-1/улица Строителей, 11А; г. Полоцк, улица Октябрьская, 25; г. Гомель, улица Советская, 41Б. Присоединяйся к нашей команде профессионалов! Ждем твой отклик!",
  "keywords" : [ "RxJava", "Android SDK", "Android" ]
}, {
  "url" : "https://rabota.by/vacancy/103873191?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Группа Компаний Армтек",
  "textContent" : "АРМТЕК – крупнейший поставщик автозапчастей для легковых и грузовых автомобилей на территории Беларуси, России, Казахстана и еще ряда стран! НАША КОМАНДА – это более 10 000 сотрудников по всему миру. IT-подразделение АРМТЕК составляют более 100 высококвалифицированных специалистов по разным направлениям (SAP, Web FrontEnd/BackEnd разработка, Mobile-разработка, HCL Notes и др.). В пул проектов на сегодняшний день входят разработка и внедрение систем на базе: SAP ERP (практически все модули), SAP EWM, SAP CRM, SAP S/4HANA, SAP BW/4HANA, SAP BI, SAP APO SPP, SAP BPA (iRPA), SAP Analytics Cloud, Web&Mobile, HCL Notes. В связи с активным развитием, стартом новых продуктов и большим планом проектов, наша компания ищет на полный рабочий день ПРОГРАММИСТА HCL Notes/Domino ЗАДАЧИ: Тестирование приложений HCL Domino/Notes; Поддержка и обучение пользователей Исправление ошибок в приложениях Domino. НАШИ ОЖИДАНИЯ: Высшее/средне-специальное техническое образование; Знание Formula Language HCL Domino/Notes, LotusScript, Java, XPages; Опыт в поддержке приложений на платформе HCL Domino/Notes. НАШЕ ПРЕДЛОЖЕНИЕ: Работа в стабильной международной Компании; Профессиональный, опытный коллектив; Интересные, разносторонние проекты по автоматизации бизнес-процессов; Официальное трудоустройство (контракт) и своевременная оплата труда; Защищенная от инфляции фиксированная ЗП (устанавливается по результатам собеседования); Повышение оклада по итогам года за результаты и достижения; Комфортабельный офис (БЦ Фортуна) рядом со станцией метро (ст.м. Спортивная); Оплата парковочного места рядом с офисом или проездного билета на общественный транспорт; Медицинская страховка (включая членов семьи для сотрудников со стажем); Широкие возможности для обучения и развития (собственный корпоративный учебный центр и платформа online-обучения с мобильным приложением); Оплата участия в профильных конференциях, семинарах и т.д.; Возмещение расходов на курсы по повышению профессиональных навыков (включая английский язык); Дополнительные льготы и социальные программы для сотрудников АРМТЕК (возможность приобретать продукцию и обслуживать свой автомобиль на партнерских СТО со скидкой, отдых в Усадьбе «Три медведя» и проживание со скидкой, подарок за стаж работы в Компании и пр.); Интенсивный рост команды открывает возможности для карьерного роста; Гибкий график работы (плавающее время прихода\\ухода, ПН-ПТ).",
  "keywords" : [ "Formula language", "Lotus Script", "Java", "XPages", "Lotus Domino", "Lotus Notes" ],
  "addressString" : "Минск, Спортивная, улица Притыцкого, 27А"
}, {
  "url" : "https://rabota.by/vacancy/109205235?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Бэлл Интегратор",
  "textContent" : "Bell Integrator – один из ведущих системных интеграторов страны. Мы аккредитованная ИТ-компания и являемся частью ГК Softline. Bell Integrator активно реализует проекты по всей России, среди наших заказчиков – крупнейшие системообразующие финансовые, телеком и ритейл компании страны. Проекты: Продуктовая банковская команда проекта PEGA SFA. Разработка проектов цифрового бизнеса в сегменте КИБ. В SFA у КМ должна появиться возможность оформлять Бизнес кредит с графиком аннуитетного платежа. В НИБ у клиента должна появится возможность оформить БК с графиком аннуитетного платежа Команда занимается развитием направления страхования, в т.ч. защиты бизнеса, страхования залогового обеспечения и иных рисков на кредитных продуктах поточного кредитования. За счет внедрения Защиты бизнеса Банк частично конвертирует процентный доход в комиссионный Требования: Опыт работы с Pega от 2-3х лет; Умение работать с background процессами в Pega (Agent, Queue Processor) и проектировать асинхронное взаимодействие с внешними системами. Базовые знания Java/Ruby; Понимание процессного подхода, основ BPM, Case Management; Навыки написания запросов SQL, оптимизация запросов; Знание различных методов интеграции систем (синхронное/асинхронное взаимодействие, интеграция через шину), опыт работы с REST/SOAP API, понимание особенностей форматов обмена данными JSON/XML; Задачи: включают в себя полный цикл разработки: проектирование решений, разработка, включение в общую поставку и дальнейшее экспертное сопровождение. Условия: Официальное трудоустройство в аккредитованную компанию Bell Integrator Конкурентная заработная плата Удаленный формат работы Добровольное медицинское страхование Собственное фитнес-приложение Скидки на занятия английским языком через SkyEng Корпоративная техника (по согласованию с руководителем) Корпоративные развлекательные программы",
  "keywords" : [ "REST", "MQ", "pega", "SOAP" ]
}, {
  "url" : "https://rabota.by/vacancy/109482821?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Бэлл Интегратор",
  "textContent" : "BELL INTEGRATOR – крупный системный интегратор страны. Мы являемся аккредитованной ИТ– компанией. На текущий момент с нами работает более 2500 высококлассных аналитиков, руководителей проектов, разработчиков, тестировщиков и специалистов по сопровождению крупных информационных систем. Bell Integrator активно реализует проекты по всей России, среди наших заказчиков – ведущие системообразующие финансовые, телеком и ритейл компании страны. Центральный офис Bell Integrator расположен в Москве, представительства – в Нижнем Новгороде, Пензе, Саратове, Уфе, Минске (Беларусь). ПРОЕКТ: Создание системы сопровождения сделок глобальных рынков с ценными бумагами. Решение позволит сотрудникам максимально автоматизировано: • подтверждать условия сделок с контрагентами • проводить расчёты по сделкам (перемещение денег и ценных бумаг) • контролировать исполнение обязательств • оценивать справедливую стоимость • вести учёт ц. бумаг в разрезе мест хранения Решение строится на собственной платформе банка, что позволяет пользоваться готовыми сервисами/библиотеками, однако выбор реализации остаётся за командой. СТЕК: Java 11, Kafka, PostgreSQL, OpenShift, Spring Boot, React (Typescript), микросервисная архитектура, cloud native подход, интеграция с 20+ различными системами в периметре банка и за его пределами. ЧТО МЫ ОЖИДАЕМ ОТ КАНДИДАТОВ: Специалист по Java 8+, Spring Boot. Опыт более 4 лет в разработке систем промышленного уровня на Java. Опыт более 1 год в роли тимлида разработки. Опыт правильного применения шаблонов проектирования ПО. Опыт разработки микросервисов. Знание протоколов, форматов и технологий HTTP, REST, GRPC, JSON, XML, XSD. Способность создавать решения, обеспечивающие отказоустойчивость систем. Высшее техническое образование. БУДЕТ ПЛЮСОМ: Опыт проектирования межсервисных взаимодействий. Умение применять принципы реактивного программирования. Стремление к максимальному покрытию кода тестами. Опыт работы со Spring Validation, StateMachine, Swagger. Знакомство с OpenShift и Istio. Опыт работы по agile/scrum методологии. Знание и умение работать с Jira и Confluence. Понимание, как устроен бизнес глобальных рынков. ЧЕМ ПРЕДСТОИТ ЗАНИМАТЬСЯ: Разработка бизнес и интеграционной логики. Проектирование технических решений. Подготовка к внедрению. Рецензирование кода, дизайна решения, документации. Написание модульных и интеграционных тестов. МЫ ПРЕДЛАГАЕМ: Возможность участия в интересных проектах. Возможность профессионального и карьерного роста в компании. Опыт работы в команде профессионалов. Уровень заработной платы обсуждается индивидуально. Специальные тарифы для сотрудников в спортивные клубы и языковые курсы и пр. Удаленный формат работы.",
  "keywords" : [ "Java", "Kafka", "Spring Boot" ]
}, {
  "url" : "https://rabota.by/vacancy/109305327?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Бэлл Интегратор",
  "textContent" : "Обязанности: Разработка бизнес и интеграционной логики Проектирование технических решений Подготовка к внедрению Рецензирование кода, дизайна решения, документации Написание модульных и интеграционных тестов Требования: Специалист по Java 8+, Spring Boot Опыт более 4 лет в разработке систем промышленного уровня на Java Опыт более 1 год в роли тимлида разработки Опыт правильного применения шаблонов проектирования ПО Опыт разработки микросервисов Знание протоколов, форматов и технологий HTTP, REST, GRPC, JSON, XML, XSD Способность создавать решения, обеспечивающие отказоустойчивость систем Высшее техническое образование Желательно: Опыт проектирования межсервисных взаимодействий умение применять принципы реактивного программирования Стремление к максимальному покрытию кода тестами Опыт работы со Spring Validation, StateMachine, Swagger Знакомство с OpenShift и Istio Опыт работы по agile/scrum методологии Знание и умение работать с Jira и Confluence Понимание, как устроен бизнес глобальных рынков Условия: Официальное трудоустройство в Bell Integrator Конкурентная заработная плата (по итогам собеседования) Аккредитованная ИТ-компания Формат работы: удаленно Менторство Возможности карьерного роста и получения экспертизы в ведущих проектах страны Скидки на занятия фитнесом и собственное фитнес-приложение Скидки на занятия английским языком",
  "keywords" : [ ]
}, {
  "url" : "https://rabota.by/vacancy/108694168?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Бэлл Интегратор",
  "textContent" : "BELL INTEGRATOR – крупный системный интегратор страны. Мы являемся аккредитованной ИТ– компанией. На текущий момент с нами работает более 2500 высококлассных аналитиков, руководителей проектов, разработчиков, тестировщиков и специалистов по сопровождению крупных информационных систем. Bell Integrator активно реализует проекты по всей России, среди наших заказчиков – ведущие системообразующие финансовые, телеком и ритейл компании страны. Центральный офис Bell Integrator расположен в Москве, представительства – в Нижнем Новгороде, Пензе, Саратове, Уфе, Минске (Беларусь). ПРОЕКТ: Проекты в банковской сфере. ЧТО МЫ ОЖИДАЕМ ОТ КАНДИДАТА: Опыт работы DevOps инженером от 3-4 лет. Знание Linux на уровне системного администратора. Понимание работы систем баз данных, таких как SQL и NoSQL. Опыт работы с PostgreSQL. Опыт работы с RabbitMQ, Kafka. Опыт работы с Docker, Compose, Kubernetes. Опыт работы с инструментами Git, Ansible, Helm. Опыт работы с системами мониторинга Prometheus, Grafana, Zabbix. Опыт работы с ELK стеком. Опыт построения CI/CD пайплайнов Gitlab. Знание языков программирования Bash, Python. Опыт работы с Nginx, HAproxy. Опыт работы с Keycloak, Vault Опыт работы с Harbor, Nexus, Artifactory Опыт работы с SonarQube и SAST. Понимание сборки проектов на языках: java (Maven, Gradle), C#, NodeJS - будет плюсом. ЧЕМ ПРЕДСТОИТ ЗАНИМАТЬСЯ: Развертывание и сопровождение инфраструктуры разработки и конвейеров Ci/Cd. Менторство над DevOps инженерами Junior. Разработка и развитие средств автоматизации процессов сборки, развёртывания. Создание и развитие инструментов мониторинга и логирования. Соблюдение согласованного уровня сервисов (SLA,OLA). Развертывание и поддержка баз данных. МЫ ПРЕДЛАГАЕМ: Возможность участия в интересных проектах. Возможность профессионального и карьерного роста в компании. Опыт работы в команде профессионалов. Уровень заработной платы обсуждается индивидуально. Специальные тарифы для сотрудников в спортивные клубы и языковые курсы. Удаленный формат работы.",
  "keywords" : [ "NoSQL", "Git", "Linux", "Docker", "ELK", "Ansible", "CI/CD", "Prometheus", "Grafana", "SQL", "Kubernetes" ]
}, {
  "url" : "https://rabota.by/vacancy/109471686?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Бэлл Интегратор",
  "textContent" : "Формат работы: удалённо, РБ Компания: BELL INTEGRATOR BELL INTEGRATOR — крупный системный интегратор и аккредитованная ИТ-комания. В нашей команде более 2500 специалистов, включая аналитиков, руководителей проектов, разработчиков и тестировщиков, работающих над крупными информационными системами. Мы реализуем проекты по всей России для ведущих финансовых, телеком и ритейл компаний. Центральный офис находится в Москве, представительства — в Нижнем Новгороде, Пензе, Саратове, Уфе и Минске. Описание проекта: Мы — дружная команда с опытом в автоматизации тестирования. В рамках данного банковского проекта мы используем Java 15 и Maven для написания тестов. Ручным тестированием не занимаемся, что позволяет сосредоточиться на автоматизации. Предлагаем широкий выбор задач по различным проектам, включая API, веб-приложения, очереди сообщений (MQ) и базы данных (DB). Требования Опыт автоматизации тестирования от 3 лет. Знания в тестировании клиент-серверных приложений и/или API, WEB, MQ, DB. Умение работать с Java Stream API, функциональными интерфейсами и ООП. Опыт разработки тестовой документации (чек-листы, планы, отчеты и т. д.). Навыки поиска и предложения решений. Высокий уровень самоорганизации и хорошие коммуникативные навыки. Обязанности Разработка автотестов для API, WEB, MQ и DB на Java. Проверка технических заданий на полноту и непротиворечивость. Создание чек-листов в Xray. Учет дефектов и спорных моментов в Jira/Confluence. Разработка общих решений и участие в code review. Контроль исправления дефектов. Взаимодействие с аналитиками и разработчиками. Условия Конкурентная заработная плата. Корпоративное обучение и сертификация. Развлекательные мероприятия для сотрудников. Возможность удаленной работы. Если вы хотите стать частью команды, мы будем рады видеть вашу кандидатуру!",
  "keywords" : [ "Java" ]
}, {
  "url" : "https://rabota.by/vacancy/110058480?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Бэлл Интегратор",
  "textContent" : "Проект: создание системы сопровождения сделок глобальных рынков с ценными бумагами. Решение позволит сотрудникам максимально автоматизировано • подтверждать условия сделок с контрагентами • проводить расчёты по сделкам (перемещение денег и ценных бумаг) • контролировать исполнение обязательств • оценивать справедливую стоимость • вести учёт ц. бумаг в разрезе мест хранения Проект по построению бэк-офисной и учётной инфраструктуру для торговли ценно-бумажными продуктами (сделки купли/продажи акций/облигаций, РЕПО etc,). Команда состоит из аналитиков, разработчиков, тестировщиков, DevOps. Инфраструктура создается с нуля силами проектных agile-команд на cloud-native платформе банка и плотно интегрируется в информационную инфраструктуру банка, планируется интеграции более чем с 20 целевыми АС Банка в том числе выгрузка данных в облако. Стек: Java 11, Kafka, PostgreSQL, OpenShift, Spring Boot, React (Typescript), микросервисная архитектура, cloud native подход, интеграция с 20+ различными системами в периметре банка и за его пределами Требования: Специалист по Java 8+, Spring Boot Опыт более 4 лет в разработке систем промышленного уровня на Java Опыт более 1 год в роли тимлида разработки Опыт правильного применения шаблонов проектирования ПО Опыт разработки микросервисов Знание протоколов, форматов и технологий HTTP, REST, GRPC, JSON, XML, XSD Способность создавать решения, обеспечивающие отказоустойчивость систем Высшее техническое образование Желательно: Опыт проектирования межсервисных взаимодействий умение применять принципы реактивного программирования Стремление к максимальному покрытию кода тестами Опыт работы со Spring Validation, StateMachine, Swagger Знакомство с OpenShift и Istio Опыт работы по agile/scrum методологии Знание и умение работать с Jira и Confluence Понимание, как устроен бизнес глобальных рынков Обязанности: Разработка бизнес и интеграционной логики Проектирование технических решений Подготовка к внедрению Рецензирование кода, дизайна решения, документации Написание модульных и интеграционных тестов Условия: Официальное трудоустройство в Bell Integrator Конкурентная заработная плата (по итогам собеседования) Аккредитованная ИТ-компания Формат работы: удаленно Менторство Возможности карьерного роста и получения экспертизы в ведущих проектах страны Скидки на занятия фитнесом и собственное фитнес-приложение Скидки на занятия английским языком",
  "keywords" : [ "Java" ]
}, {
  "url" : "https://rabota.by/vacancy/109280878?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Бэлл Интегратор",
  "textContent" : "Стек: Java 11, Kafka, PostgreSQL, OpenShift, Spring Boot, React (Typescript), микросервисная архитектура, cloud native подход, интеграция с 20+ различными системами в периметре банка и за его пределами Требования: Специалист по Java 8+, Spring Boot Опыт более 4 лет в разработке систем промышленного уровня на Java Опыт более 1 год в роли тимлида разработки Опыт правильного применения шаблонов проектирования ПО Опыт разработки микросервисов Знание протоколов, форматов и технологий HTTP, REST, GRPC, JSON, XML, XSD Способность создавать решения, обеспечивающие отказоустойчивость систем Высшее техническое образование Желательно: Опыт проектирования межсервисных взаимодействий умение применять принципы реактивного программирования Стремление к максимальному покрытию кода тестами Опыт работы со Spring Validation, StateMachine, Swagger Знакомство с OpenShift и Istio Опыт работы по agile/scrum методологии Знание и умение работать с Jira и Confluence Понимание, как устроен бизнес глобальных рынков Обязанности: Разработка бизнес и интеграционной логики Проектирование технических решений Подготовка к внедрению Рецензирование кода, дизайна решения, документации Написание модульных и интеграционных тестов Условия: Официальное трудоустройство в Bell Integrator Конкурентная заработная плата (по итогам собеседования) Аккредитованная ИТ-компания Формат работы: удаленно Менторство Возможности карьерного роста и получения экспертизы в ведущих проектах страны Скидки на занятия фитнесом и собственное фитнес-приложение Скидки на занятия английским языком",
  "keywords" : [ "Java", "PostgreSQL", "OpenShift", "Spring Framework", "Apache Kafka", "руководство командой разработчиков" ]
} ]