[ {
  "url" : "https://rabota.by/vacancy/112188203?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Andersen",
  "textContent" : "The international IT сompany Andersen invites a Junior QA Automation Engineer (Java) to work on a large-scale internal project. Andersen is a pre-IPO software development company that provides a full cycle of services, following project management standards and best practices. For over 17 years, we have been helping enterprises and middle-sized firms transform their businesses by creating effective digital solutions using innovative technologies. Today, we are working with businesses from various parts of the world, including Western Europe, the USA, and Asia. Our expertise includes FinTech, Healthcare, Retail, Telecom, Media & Entertainment, Logistics, Travel & Hospitality, eCommerce, and other industries. The project is the development of a CRM system that optimizes business processes related to marketing and customer service improvement. The functions of the system include collecting, analyzing and storing information about customers and their enquiries, as well as notifying employees about the current customer service process. Responsibilities: Creating and executing frontend/backend automated test cases. Maintaining and extending available test suits. Reviewing nightly test execution – fix tests or report bugs. Collaborating actively with other team members toward automation improvements. Participating in the adoption of new tools and technologies. Producing clean and stable code. Must-haves: Experience as a QA Automation Engineer for 6+ months. Hands-on experience with Java. Knowledge of automation testing. Knowledge of OOP principles, data structures, algorithms, and design patterns. Knowledge of CI/CD processes. Experience with Git. Familiarity with API testing (Postman, Rest Assured, or similar). Familiarity with UI testing (Selenium, Playwright). Level of English – from Intermediate and above. Reasons why this job would be interesting to you: Experience in teamwork with leaders in FinTech, Healthcare, Retail, Telecom, and others. Andersen cooperates with such businesses as Samsung, Siemens, Johnson & Johnson, BNP Paribas, Ryanair, Mercedes, TUI, Verivox, Allianz, T-Systems, etc.; The opportunity to change the project and/or develop expertise in an interesting business domain; Job conditions – you can work both fully remotely and from the office or can choose a hybrid variant; Guarantee of professional, financial, and career growth! The company has introduced systems of mentoring and adaptation for each new employee; The opportunity to earn additional up to 1,700 EUR per month by participating in the company's activities; Access to the corporate training portal, where the entire knowledge base of the company is collected and which is constantly updated; Bright corporate life (parties / pizza days / PlayStation / fruits / coffee / snacks / movies); Certification compensation (AWS, PMP, etc); Referral program; English courses; Private health insurance and compensation for sports activities. Join us!",
  "keywords" : [ "Java", "Git", "Automation QA", "Английский — B1 — Средний" ]
}, {
  "url" : "https://rabota.by/vacancy/112385838?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Andersen",
  "textContent" : "Andersen, an international IT сompany, invites an experienced C++ Software Engineer to work on a large-scale project for our USA partners. The customer is a leader in video streaming infrastructure, driving innovation and major developments in the online video streaming industry. They created the first commercial adaptive streaming player and the first software-defined encoding service that operates on any cloud platform. Their solutions are utilized by over 400 customers globally, including prominent names like the BBC, ClassPass, Discovery, fuboTV, and Hulu. The project is a cloud-native microservice architecture on AWS, Google Cloud, and Azure, making architectural decisions to evolve the products, collaborating directly on a product, and supporting the expansion of both the VOD and live coding teams. Tec stack on the project: C++(11 up to 20), Java, Docker, Kubernetes, CircleCI, CI/CD. Responsibilities: Developing of high-quality, high-performance, fault-tolerant, well-tested, reusable, and scalable code that will be used Opportunity to work with a modern tech stack including C++(11 up to 20), Java, Docker, Kubernetes, and CircleCI. Involving in all stages of development, from product ideation through architecture and execution. Developing of new and improvement of existing features as well as opportunity to investigate and resolve issues. Diverse career opportunities and continuous growth.Suggest, plan, and implement improvements to code structure and architecture in service of testability and maintainability. Ensuring quality and stability by writing automated tests and leveraging code reviews for your work and the work of others. Extending and enhancing our monitoring/alerting systems as well as build powerful CI/CD systems. Continually evaluating emerging technologies to stay ahead. Maintaining up-to-date knowledge of technology standards, industry trends, emerging technologies, and software development best practices. Must-haves: Commercial development experience for 4+ years. Significant experience programming in modern C/C++ (20) Knowledge of classic dev tools (Git, CMake, CI/CD) Experienced in concurrent programming (multi-threading, multi-process, etc.) Passion for software craftsmanship, best practices, design patterns, automated testing, and clean code. Good problem-solving and troubleshooting abilities. Level of English – from Intermediate+ and above. Nice-to-haves: Knowledge of Java and/or Kotlin. Reasons why this job would be interesting to you: Experience in teamwork with leaders in FinTech, Healthcare, Retail, Telecom, and others. Andersen cooperates with such businesses as Samsung, Siemens, Johnson & Johnson, BNP Paribas, Ryanair, Mercedes, TUI, Verivox, Allianz, T-Systems, etc.. The opportunity to change the project and/or develop expertise in an interesting business domain. Job conditions – you can work both fully remotely and from the office or can choose a hybrid variant. Guarantee of professional, financial, and career growth! The company has introduced systems of mentoring and adaptation for each new employee. The opportunity to earn an additional up to 1,700 EUR per month by participating in the company's activities. Access to the corporate training portal, where the entire knowledge base of the company is collected and which is constantly updated. Bright corporate life (parties / pizza days / PlayStation / fruits / coffee / snacks / movies). Certification compensation (AWS, PMP, etc). Referral program. English courses. Private health insurance and compensation for sports activities. Join us!",
  "keywords" : [ "Java", "C++", "Git", "CMake", "CI/CD", "Английский — B2 — Средне-продвинутый" ]
}, {
  "url" : "https://hh.ru/vacancy/111985043?query=java",
  "companyName" : "Aston",
  "textContent" : "Аутсорсинговая аккредитованная IT-компания Aston приглашает стать частью нашей команды. Мы работаем на рынке с 2007 года, а штат насчитывает 2500+ сотрудников. Aston предоставляет услуги по разработке программного обеспечения и IT-аутсорсинга предприятиям, организациям и стартапам. Компания активно развивается в доменах: Finance, Healthcare, eCommerce, IoT, Media and Entertainment, Big Data, Machine learning, Deep learning. Заказчик– российский коммерческий банк, один из крупнейших интернет-банков страны. Глобальная цель на данном этапе – уйти от бюрократии, долгих нецелесообразных банковских процессов и заменить их на надежный и удобный мобильный банкинг. Ищем QA Automation Engineer (Java) в нашу команду профессионалов. Чего мы ждем от специалиста? опыт работы QA Automation Engineer (Java) от 3-х лет; опыт разработки автоматизированных сценариев на Java; опыт автоматизации с использованием фреймворка TestNG, JUnit; опыт работы с REST API, SOAP API, HTTP/HTTPS, gRPC, Avro; опыт использования систем сборки: Maven, Gradle и других; опыт настройки CI/CD с помощью TeamCity, Jenkins или GitLab; знание SQL (DML-, DDL-запросы, JOIN, группировки и агрегирующие функции). Что мы предлагаем? Хорошая зарплата размер зарплаты обсуждаем отдельно с каждым кандидатом; доплачиваем за менторство, ведение обучающих курсов, ревью проектов и участие в других профактивностях компании. Развитие в профессии интересные и перспективные проекты; возможность выбирать или менять проект и пробовать себя в новых направлениях; прозрачная система Performance Review; ментор на все время работы в компании. Комфорт и свобода возможность выбирать формат работы: из дома, из офиса или гибридный; комфортные офисы в городах-центрах разработки: Минск, Полоцк, Витебск, Гомель; поэтапная система адаптации новых сотрудников. Обучение корпоративный портал с материалами для изучения любого нового стека и повышения уровня по своей специальности и не только; участие в технических митапах и конференциях в качестве гостя и спикера. Социальный пакет оформление по ТК РБ; медицинская страховка (+стоматология); частичная компенсация спортивных абонементов; компенсация расходов на оплату коворкинга; 3 sick-days в год; оплачиваемый бенч; оплачиваемый отпуск 25 дней в году; оплачиваемые больничные. Корпоративная жизнь корпоративы и тимбилдинги; детские праздники и мастер-классы с подарками и сладостями для семей сотрудников. Адреса наших офисов г. Минск, проспект Победителей, 7А, 24 этаж; г. Витебск, Московский проспект, 70-1/улица Строителей, 11А; г. Полоцк, улица Октябрьская, 25; г. Гомель, улица Советская, 41Б.",
  "keywords" : [ "JUnit", "TestNG", "Автоматизированное тестирование", "SQL" ]
}, {
  "url" : "https://hh.ru/vacancy/112693451?query=java",
  "companyName" : "Aston",
  "textContent" : "Мы — российская аккредитованная ИТ-компания, четырехкратный обладатель премии «Работодатель года» по версии Habr. C 2007 года разрабатываем цифровые решения для b2b-клиентов. Мы работаем с топовыми российскими и иностранными компаниями и знаем, какие специалисты востребованы на рынке. Поэтому приглашаем вас на стажировку Java-разработчик. Лучшие получат свою первую работу в ИТ! Ежегодно мы обучаем 900+ человек, 75% стажеров с первого раза проходят интервью на проекты. Требования к кандидатам: понимание принципов ООП, понимание алгоритмов и структур данных, знание Java Core; обязательное знание основ Java EE (Servlets, jsp); представление о реляционных базах данных (Oracle, MySQL, PostgreSQL и др.); опыт написания unit-тестов, знания систем контроля версий (git или svn), Spring Framework, а также ORM (Hibernate Framework); готовность к командировкам; знание английского языка на уровне Pre-Intermediate и выше; высшее образование. Что мы предлагаем? Оформление по ТК РБ; Официально устраиваем на работу; Даём доступ к корпоративной программе обучения; Берём на работу также лучших стажёров; После выхода на проект регулярно пересматриваем и повышаем зарплату; Обеспечиваем классические IT-плюшки: офис в центре города, бесплатный английский, корпоративные ивенты. Условия стажировки: Обучение 3-4 месяца 5 дней в неделю с 9:00 до 18:00 с перерывом на обед; Изучение теории с еженедельными проверками изученного материала; Практика на учебных проектах под руководством опытного техлида; Подготовка к собеседованию и самопрезентации; Пройти обучение удаленно. Приходи в ASTON и расти вместе с нами!",
  "keywords" : [ "Java EE", "Java Servlets", "Java", "Unit Testing", "PostgreSQL", "JSP", "SVN", "ORACLE", "ООП", "Git", "MySQL", "Hibernate ORM", "Spring Framework" ]
}, {
  "url" : "https://hh.ru/vacancy/112702789?query=java",
  "companyName" : "Aston",
  "textContent" : "Мы — российская аккредитованная ИТ-компания, четырехкратный обладатель премии «Работодатель года» по версии Habr. C 2007 года разрабатываем цифровые решения для b2b-клиентов. Мы работаем с топовыми российскими и иностранными компаниями и знаем, какие специалисты востребованы на рынке. Поэтому приглашаем вас стажировку Android разработчик. Лучшие получат свою первую работу в ИТ! Ежегодно мы обучаем 900+ человек, 75% стажеров с первого раза проходят интервью на проекты. Требования: понимание принципов разработки под Android; знания Kotlin, Android SDK, Android Studio, Gradle, Java; базовые знания паттернов проектирования, UI guidelines и особенностей работы мобильных приложений; высшее образование; опыт создание собственных приложений будет плюсом. Что мы предлагаем: даем доступ к корпоративной программе обучения; берем на работу лучших стажеров; после выхода на проект регулярно пересматриваем и повышаем зарплату; официально устраиваем на работу; возможность выбора формата работы: удаленный, гибридный, в офисе; обеспечиваем классические IT-плюшки: офис в центре города, бесплатный английский, корпоративные ивенты, частичная компенсация стоимости спортивных абонементов. Условия стажировки: успешное прохождение online-интенсива ASTON Android (2 месяца, 2 раза в неделю, по вечерам); после online-интенсива ASTON Android - Лаборатория - теоретико-практическая подготовка к работе на коммерческом проекте: обучение 3 месяца 5 дней в неделю с 9:00 до 18:00 с перерывом на обед; изучение теории с еженедельными проверками изученного материала; практика на учебных проектах под руководством опытного техлида; подготовка к собеседованию и самопрезентации; Стажировка доступна для кандидатов из городов, где есть офисы нашей компании: Минск, Витебск, Гомель, Полоцк. Приходи в ASTON и расти вместе с нами!",
  "keywords" : [ "Java", "Andriod", "UX", "UI", "Android SDK", "Gradle", "Android Studio", "Kotlin" ]
}, {
  "url" : "https://rabota.by/vacancy/112347319?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Expert Soft",
  "textContent" : "Приглашаем на бесплатный практический тренинг Java Web Development for E-commerce. Мы открыли набор и ждем твой отклик! Мы Expert Soft - аутсорсинговая IT компания из Беларуси, резидент ПВТ. С 2014 года мы разрабатываем и поддерживаем сайты западных enterprise клиентов (США и Западная Европа) преимущественно в е-commerce сфере. За время существования компании мы провели 13 выпусков курса по Java Web, и многие наши выпускники продолжают свой путь в Expert Soft. Некоторые из них уже на протяжении 6+ лет работают на коммерческих проектах, получая ценный практический опыт. А позже сами становятся менторами и передают студентам накопленные знания. Таким образом, на тренинге мы даем действительно ценные навыки, которые в будущем помогают уверенно начать работу на первом коммерческом проекте. Мы предлагаем: Тренинг, который готовит к реальным проектам на технологиях Java-стека (изучение Java, Stream API, 3-layer architecture, HTTP basics и др.). Полностью удаленное обучение с гибким графиком - удобно совмещать с учебой. Продолжительность тренинга 1,5 месяца. Обучение в малых группах с постоянной поддержкой ментора. Помощь и поддержка от HR компании на всех этапах для обучения. По итогам тренинга лучшим стажерам мы предоставляем возможность стать сотрудниками Expert Soft, продолжить учебу в компании (последующая стажировка уже в штате компании предполагает выплату “стипендий”) и начать работу на коммерческих проектах. также для студентов бюджетной формы обучения возможно распределение после прохождения испытательного срока в проекте. Мы ожидаем от вас: Знание английского языка не ниже крепкого Intermediate уровня. Отличные базовые знания по программированию и ООП. Уверенное владение основами Java SE. Базовые знания реляционных баз данных и языка SQL. Возможность уделять учебе не менее 4-5 часов в день. Желание стать профессионалом своего дела! Как пройти отбор на тренинг: Откликнуться на вакансию. Вам будет выслана ссылка на отклик, перейдя по которой необходимо будет ввести вашу почту и заполнить подробную анкету. После обработки анкеты системой на указанную почту вам будут высланы приглашения на базовый онлайн-тест по Java и онлайн-тест по английскому языку. В случае успешного написания обоих тестов необходимо будет выполнить небольшое практическое задание, приглашение на которое также придет письмом. При успешном выполнении всех тестовых заданий мы пригласим вас на техническое интервью. Заключительным этапом при успешно пройденном техническом интервью будет HR собеседование. Ждем ваш отклик!",
  "keywords" : [ "ООП", "Java", "CSS", "Spring Framework", "HTML", "Java SE", "SQL", "Английский язык" ],
  "address" : "Минск, улица Мележа, 5к2"
}, {
  "url" : "https://rabota.by/vacancy/110999303?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "GP Solutions",
  "textContent" : "Travel project focused on mountain vacations, from skiing to wellness. This company offers customized packages across top European destinations, delivering unique, nature-driven experiences. We’re looking for a skilled Java (Scala) Developer to help integrate APIs from the travel industry (e.g., hotels, apartments). If you’re proficient in Java and open to working with Scala, this is a great opportunity to expand your skills. Candidate location: remote/in-office or hybrid. Requirements: 3+ years of experience in Java; Experience with Scala; Strong understanding of algorithms and SQL; Intermediate English level or higher. Will be a plus: Familiarity with other programming languages. Your responsibilities would include: Integrate APIs and build a cache of travel products in the database; Work with Java and Scala (with most code written in Scala); Contribute to our search and booking system; Continuously learn and apply new technologies as needed. If you are looking for a place where you’ll tackle challenging projects alongside some of the most talented and dynamic people you’ve ever worked with, GP Solutions might just be the place for you. Join us!",
  "keywords" : [ "Java", "Scala" ]
}, {
  "url" : "https://rabota.by/vacancy/111531385?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "IDF Technology",
  "textContent" : "IDF Technology – успешная IT-компания, специализирующаяся на кредитном скоринге, Data Science и финансовых цифровых технологиях. И мы приглашаем Java developer стать частью нашей компании! Задачи: Разработка нового функционала; Переписывать монолит на микросервисную архитектуру; Проводить аудит текущих решений на предмет идей улучшений; Профайлинг, оптимизация и рефакторинг существующих решений. Требования: Java; Spring Framework; Hibernate ORM; Gradle; JPA; MySQL. Для нас важно: Глубокое понимание ООП и шаблонов проектирования; Понимание концепции микросервисов и умение писать масштабируемые системы; Коммерческий опыт на Java от 3-х лет. Стек проекта: JAVA 17; Kotlin; Spring Framework; Infrastructure - Docker, ELK, Netflix stack (Swarm, Consul, Vault, Hystrix, Kibana, Grafana, Prometheus, Haproxy); Mongo, GridFS, Redis, ElasticSearch, RabbitMQ, Kafka, MySql, JavaEE (JPA, JAX-RS), Glassfish; ORM - Hibernate, Jooq; Testing - on Spock, JUnit, Mockito, RestAssured; Build - Gradle, Maven. Условия: Заработная плата, привязанная к курсу валют; Годовой бонус; Оплата участия в профильных конференциях, митапах и т.д.; Компенсация занятий иностранным языком и спортом; ДМС после испытательного; Режим работы, уважающий биоритмы каждого отдельного сотрудника; Отпуск 28 дней + 5 sick days; Оплата анализов/лекарств/врачей на ковид; Адекватный менеджмент, отсутствие бюрократии; сильная и действительно дружная команда; Весёлая корпоративная жизнь (тимбилдинги, мероприятия и корп.подарки). Присоединяйтесь к нашей команде!",
  "keywords" : [ "Java", "MySQL", "Spring Framework", "Kotlin" ]
}, {
  "url" : "https://rabota.by/vacancy/110558252?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Innowise Group / Фабрика инноваций и решений",
  "textContent" : "Innowise Group на рынке с 2007 года. За это время наша команда реализовала 850+ проектов для заказчиков из 60+ стран мира — и эти показатели постоянно растут. Для тебя это возможность интенсивно развиваться, пробовать себя в разных направлениях и технологиях, стать ментором и реализовывать свои самые смелые карьерные ожидания. Основа нашего успеха — крутая команда. У нас сформировалось профессиональное комьюнити, которое поможет тебе расти, общаться с экспертами и поддерживать компетенции на высоком уровне. Наши ожидания: Уверенное знание Java Core; Минимум 2+ проекта в карьере; Опыт в Microservices; Опыт в Spring ecosystem(Spring boot, Spring Data, Spring Cloud and etc); Опыт в Message Brokers(Kafka, ActiveMQ, RabbitMQ); Опыт в Nosql/SQL базах данных на продвинутом уровне; Разговорный уровень английского языка от B1; Разговорный уровень немецкого языка от В1. Будет плюсом: Опыт в разбиении монолита на микросервисы; Опыт в качестве Full stack разработчика(React/Angular); Опыт в прохождении интервью на английском языке; Опыт в Cloud(Aws, Azure, GCP) Опыт управления командой от 3 человек, желание принимать участие в настройке процессов компании. Мы предлагаем: Обучение и развитие: Большой пул разноплановых проектов в таких сферах, как FinTech, Medicine, Entertainment, eCommerce, Gaming, Artificial Intelligence и пр.; Минимум легаси; короткий бенч; Широкий стек технологий, возможность перехода между ними; Индивидуальные карты роста и регулярный пересмотр условий (роли на проекте, уровня ЗП); Подготовку к собеседованиям с зарубежными заказчиками на английском языке. Рабочая среда: Формат работы в офисе; Просторные и комфортные рабочие места; Подробный онбординг: знакомство с командой, процессами и правилами, экскурсия по офису, welcome card; Уютные кухни, игровые комнаты, коворкинги, лаунж-зоны. Дополнительные бонусы: Добровольное медицинское страхование; Cкидки у компаний-партнеров (от пиццерий и книжных до магазинов бытовой техники). Если ты ищешь реальные возможности реализовать себя, управлять профессиональным и карьерным ростом – будем рады видеть тебя в нашей дружной команде!",
  "keywords" : [ "Java" ]
}, {
  "url" : "https://rabota.by/vacancy/112501336?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Innowise Group / Фабрика инноваций и решений",
  "textContent" : "Innowise Group на рынке с 2007 года. За это время наша команда реализовала 850+ проектов для заказчиков из 60+ стран мира — и эти показатели постоянно растут. Для тебя это возможность интенсивно развиваться, пробовать себя в разных направлениях и технологиях, стать ментором и реализовывать свои самые смелые карьерные ожидания. Основа нашего успеха — крутая команда. У нас сформировалось профессиональное комьюнити, которое поможет тебе расти, общаться с экспертами и поддерживать компетенции на высоком уровне. Уверены, что ты сможешь усилить нашу команду! Наши ожидания: От 3-4 лет опыта Опыт 2-3 проектов Уровень владения английским языком от Upper Intermediate Уверенные знания Spring/Spring Boot Практический опыт как с монолитом так и микросервисами Опыт в CI/CD Опыт в Message Brokers (Kafka, Rabbit, Active and etc) Опыт в построении архитектуры Желание роста в менеджмент Желание быть ментором Будет плюсом: Опыт в Java Script Опыт в AWS/Azure/GCP Опыт NoSQL(Mongo/redis) Мы предлагаем: Обучение и развитие: Большой пул разноплановых проектов в таких сферах, как FinTech, Medicine, Entertainment, eCommerce, Gaming, Artificial Intelligence и пр.; Минимум легаси; короткий бенч; Широкий стек технологий, возможность перехода между ними; Индивидуальные карты роста и регулярный пересмотр условий (роли на проекте, уровня ЗП); Подготовку к собеседованиям с зарубежными заказчиками на английском языке. Рабочая среда: Формат работы в офисе; Просторные и комфортные рабочие места; Подробный онбординг: знакомство с командой, процессами и правилами, экскурсия по офису, welcome card; Уютные кухни, игровые комнаты, коворкинги, лаунж-зоны. ⠀Дополнительные бонусы: Добровольное медицинское страхование; Cкидки у компаний-партнеров (от пиццерий и книжных до магазинов бытовой техники). Если ты ищешь реальные возможности реализовать себя, управлять профессиональным и карьерным ростом – будем рады видеть тебя в нашей дружной команде!",
  "keywords" : [ "Java", "Spring Framework" ]
}, {
  "url" : "https://rabota.by/vacancy/110263088?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Itransition",
  "textContent" : "We are looking for experienced developers that are willing to solve complex technical issues while developing high quality software systems using modern technologies. Responsibilities: Develop and enhance cross-platform mobile applications using React Native, ensuring high performance and quality on both iOS and Android; Collaborate with design and product teams to create seamless, intuitive, and visually appealing user interfaces; Optimize applications for maximum performance and scalability; Integrate third-party APIs and native libraries as needed; Conduct code reviews, write unit tests, and debug applications to ensure code quality and functionality; Maintain up-to-date knowledge of React Native advancements and apply best practices in coding, architecture, and development methodologies; Provide technical expertise to guide product development and offer solutions for complex issues; Participate in Agile ceremonies, including daily stand-ups, sprint planning, and retrospectives. Requirements: Minimum of 3 years of proven experience as a RN Developer; Expertise in React Native, React is essential; Comprehensive understanding of both front-end and back-end development processes; Strong collaboration skills, enabling effective teamwork and communication within cross-functional teams; Ability to adapt quickly to emerging technologies and evolving project requirements;In-depth understanding of React Native architecture, component lifecycle, state management, and hooks, familiarity with native build tools (Xcode, Android Studio) and native app design; principles, including offline storage, threading, and performance tuning; Experience with RESTful APIs, GraphQL, and third-party integrations; Sound knowledge of HTML, CSS, and associated technologies for front-end development; Experience in code testing and debugging, leveraging tools such as Jest; Firm grasp of software development principles and methodologies, encompassing Agile, Scrum, and Waterfall; Outstanding communication skills and adeptness in collaborative teamwork; Strong organizational acumen and meticulousness to deliver top-notch work. Nice to have: Familiarity with GraphQL and its fusion with frontend applications; Experience in creating native modules using Swift/Kotlin/Java; Knowledge of CI/CD pipelines. We can offer: Projects for such clients as PayPal, Wargaming, Xerox, Philips, adidas and Toyota Competitive compensation that depends on your qualification and skills Career development system with clear skill qualifications Options to work remotely Compensation for medical expenses English courses online Corporate parties and events for employees and their children Internal conferences, workshops and meetups for learning and experience sharing Gym membership compensation, corporate sport competitions (cybersport included) 5 days of paid sick leave per year with no obligation to submit a sick-leave certificate",
  "keywords" : [ "CSS", "HTML", "React Native", "Английский — B2 — Средне-продвинутый", "Английский язык" ]
}, {
  "url" : "https://hh.ru/vacancy/112237943?query=java",
  "companyName" : "LATOKEN",
  "textContent" : "Вакансия: Продакт Разработчик React/Node.js Full stack LATOKEN, одна из ведущих криптобирж мира, ищет Продакт Разработчика Full stack React/Node.js для работы над платформой запуска комаркетинговых активностей. О компании: LATOKEN входит в ТОП 20 криптобирж мира, является крупнейшей Веб3 компанией из СНГ и входит в Forbes ТОП 30 компаний для удаленной работы в 2022 году. Наша платформа - это супермаркет криптоактивов с более чем 3,000 наименований. Нашей миссией является упрощение процесса узнавания и обмена любого актива с помощью AI, открывая каждому возможность узнать о новых технологиях, рынках и стать участником будущего. React/Node.js Full stack разработчик играет критическую роль в: Разработке платформы запуска комаркетинговых активностей (airdrops & trading competitions). Автоматизации процесса листинга новых токенов на бирже. Ваши обязанности как продакт разработчика: Ответственность за доставку проектов в продакшн и решение кросс-командных проблем Груминг и планирование беклога Понимание клиентских метрик и вашего влияния на них Требования: 2+ года опыта в Node.js и React Увлечение передовыми технологиями в мире веб разработк и AI Трудолюбие и способность работать под давлением 50-60 часов в неделю, стремление вырасти в лида и CTO Опыт написания телеграм ботов на Python, а также опыт работы с Java - большой плюс! Преимущества: Возможность быстрого роста в культуре спортивных достижений Работа с передовыми технологиями AI и Web3 Крупнейшая компания в области Web3 из СНГ Удаленная работа Оплата в твердой валюте Опционы Работа в LATOKEN - это уникальная возможность попасть на передовую технологий, развиться и создать будущее. Мы приглашаем энтузиастов технологий с духом спортивных достижений. Откликнитесь на эту вакансию, если чувствуете, что у нас есть лучшая работа для роста вашего потенциала изменить мир.",
  "salary" : "от 2 500 до 3 200 $ на руки",
  "keywords" : [ "TypeScript", "PostgreSQL", "JavaScript", "Node.js", "React" ]
}, {
  "url" : "https://hh.ru/vacancy/110994457?query=java",
  "companyName" : "RedLab",
  "textContent" : "Hello, Python Developers! RedLab — глобальная ИТ-компания, которая занимается созданием ПО и формированием выделенных команд разработки. Мы входим в ГК Litota Group c 2019 года и объединяем лучших экспертов со всего мира, для которых создание ИТ-продуктов — не просто работа, а дело всей жизни. Для работы на разнообразных трендовых проектах, в том числе, международного уровня наша команда ищет PYTHON-РАЗРАБОТЧИКА для аутстафф направления. Группа компаний \"Литота Лабс\", имеет более 17 лет успешной деятельности на рынке РФ и СНГ. Мы создаем и внедряем уникальные ИТ решения для развития бизнеса ведущих компаний букмекерской и финансовой сфер и других сфер. Последние 9 лет 100% сотрудников Литоты Лабс работают удалённо. Мы считаем, что работать нужно там, где удобно, а не под влиянием внешних факторов - и нам ни разу не пришлось пожалеть о выборе данной модели. Мы ценим нашу команду, поэтому заботимся о том, чтобы сотрудники были полностью удовлетворены работой и приносили реальный результат нашим клиентам. Предлагаем: полную занятость со стабильными выплатами; оплату труда, соответствующую вашим навыкам и ожиданиям, с реальной возможностью роста; разнообразные трендовые проекты, в том числе, международного уровня; полностью удаленный формат работы; стабильный график 5/2 с гибким началом рабочего дня; оформление по ТК или ГПХ с физ. лицом. Ожидаем: Опыт коммерческой разработки на Python от 3-х лет; Владение одним из асинхронных фреймворком: FastAPI, AioHttp. Опыт работы с asyncio, threading. Будет плюсом владение фреймворками: Sanic, Starlette,Django, Flask, etc.; Опыт работы с БД (PostgreSQL/Oracle); Опыт работы с брокерами очередей; Опыт разработки API (RestAPI); Опыт написания SQL-запросов; Опыт работы с микросервисной архитектурой; Опыт работы с Git, Jira; Коммуникабельность, умение продуктивно общаться с коллегами. Будет плюсом: Опыт работы с Docker, GitLab CI, OpenShift либо Kubernetes; Опыт работы с Keycloak; NoSQL (Clickhouse, Mongo, InfluxDB). Сертификаты станут плюсом, но совсем не обязательны, нам важен достойный уровень ваших знаний и умений! Этапы отбора: Анкета; Первичное интервью; Техническое интервью; Оффер. Ждем Вас в нашей дружной команде!",
  "keywords" : [ "Unit Testing", "GitHub", "PostgreSQL", "REST API", "Celery", "JavaScript", "MySQL", "PHP", "Python", "Flask", "Java", "RestAPI", "Redis", "Bash", "SQL", "REST", "Backend", "jQuery", "Git", "Linux", "Frontend", "Django", "Ansible", "Clickhouse", "Django Framework", "API", "FastAPI", "Gitlab" ]
}, {
  "url" : "https://rabota.by/vacancy/112071421?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "SaM Solutions Самсолюшнс",
  "textContent" : "SaM Solutions is an international IT-services and software solutions provider with 30 years of experience. We focus on IT consulting and custom software engineering services for both European and the U.S. markets, leveraging global resources. The geographical presence of SaM Solutions covers the USA, Germany, the Netherlands and countries in the Eastern Europe – Latvia, Lithuania, Poland. SaM Solutions is actively looking a talented Team Lead/Architect Java developer (SAP Commerce Cloud) experience to become an integral part of our dynamic team. This role involves being part of a European project where your skills and experience will play a crucial role in our work together. We have been providing development and support services for SAP Commerce Cloud based solutions to the retail, wholesale and telecoms industries for over 10 years and invite you to join our team of experts. Requirements: Commercial еxperience in SAP Commerce Cloud (Hybris) development from 3 years; Experience in Java, Spring Framework (Core, MVC); Understanding of SAP Commerce Cloud architecture and implementation techniques using SOAP/REST/JSON; OCC is welcome; English - Intermediate level and above. Will be a plus: Confirmed experience with Angular or Spartacus; SAP Commerce Cloud certification. We offer: Opportunity to work on high-tech projects; Official employment; Flexible schedule, possibility of remote work; Paid time off and paid sick days; English and German language classes; Corporate trainings, seminars, events within the framework of internal PMO; More detailed information can be found on the company description page.",
  "keywords" : [ "Java", "REST", "SAP", "Spring Framework", "JSON", "SOAP", "Английский — B2 — Средне-продвинутый", "Angular", "Spartacus", "Hybris" ]
}, {
  "url" : "https://rabota.by/vacancy/112319208?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "SaM Solutions Самсолюшнс",
  "textContent" : "We're looking for a Java Team Lead with a 5 year experience as a Backend Developer to join our e-commerce team. We offer a highly competitive salary and stable income, best opportunities to advance your skills working in community of experienced internationally certified Java team. Your key task will be ensuring compliance with best practices and providing technical guidance to the development team. Remote job and relocation is possible if required. Requirements: a 2 year+ experience in Hybris development 2-3 Hybris enterprise projects implemented as a Team Lead deep understanding of Hybris architecture and SOAP/REST/JSON Hybris Commerce Developer certification is a plus at least 5 years in Java/J2EE development, skilled in SOA, ESB, JMS, Web Services, Groovy, OOAD, ZK Framework, Spring Framework, Search tools integration, CMS hands-on experience with Impex, cronjobs, flexiblesearch, workflow, service layer APls familiarity with Hybris Accelerators in implementation and customization of e-commerce sites practice with Hybris commerce platform, incl. PCM, Order Management, Payment, WCMS, BTG, Vouchers, Mobile Commerce. Why work for SaM Solutions: 100% remote work opportunities flexible engagement models free trainings, seminars, activities within internal PMO possible business trips to customer's location English and German classes paid time off and paid sick leave days free and discounted health services in medical centers for you and your family.",
  "keywords" : [ "Java", "Software development Team Lead", "Hybris" ]
}, {
  "url" : "https://rabota.by/vacancy/112320411?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "SaM Solutions Самсолюшнс",
  "textContent" : "We are inviting Architect with a 2+ year experience in SAP Commerce Cloud development (former Hybris) to join our e-commerce team. Your key responsibilities associated with design of technical architecture, work with various stakeholders to define nonfunctional requirements, providing technical guidance to the development team. Remote job is possible if required. Requirements: a 2 year+ experience in Hybris development 2-3 Hybris enterprise projects implemented as a Lead/Architect deep understanding of Hybris architecture and SOAP/REST/JSON Hybris Commerce Developer certification is a plus at least 5 years in Java/J2EE development, skilled in SOA, ESB, JMS, Web Services, Groovy, OOAD, ZK Framework, Spring Framework, Search tools integration, CMS hands-on experience with Impex, cronjobs, flexiblesearch, workflow, service layer APls familiarity with Hybris Accelerators in implementation and customization of e-commerce sites practice with Hybris commerce platform, incl. PCM, Order Management, Payment, WCMS, BTG, Vouchers, Mobile Commerce. Why work for SaM Solutions: Official employment; A flexible schedule, the possibility of remote work; Paid time off and paid sick leave days; English and German language classes; Сorporate trainings, seminars, activities within internal PMO; Possible business trips to customer's location; For more information see our company description page.",
  "keywords" : [ "Java", "E-Commerce", "SAP Commerce Cloud (former Hybris)", "Software Aechitect" ]
}, {
  "url" : "https://rabota.by/vacancy/112493122?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "SaM Solutions Самсолюшнс",
  "textContent" : "SaM Solutions приглашает Java программиста c опытом 2 года+ и хорошим знанием немецкого (B2 и выше) в проект разработки ПО для крупного автопроизводителя. Предлагаем возможность быстрого профессионального роста, работу в дружном коллективе единомышленников, проекты на самых последних технологиях для извесных брендов. Важное преимущество - выстроенная программа обучения и работа на реальном проекте с первой недели. Требования: Разговорный немецкий B2. Минимум 2 года опыта в Java-разработке, Spring Boot, Hibernate. Integration Testing, GIT (Pull Request, Code Review). Мы предлагаем для Вас: Высокий уровень заработной платы, возможность карьерного роста Курсы иностранных языков, тренинги Возможность командировок и деловых поездок Организованные обеды в офисе Собственный тренажёрный зал и другие корпоративные бенефиты Медицинскую страховку для обслуживания в лучших мед. центрах (бесплатная для сотрудников и по льготным ценам для членов их семей) Возможна удаленная занятость.",
  "keywords" : [ "Java", "Немецкий язык" ]
}, {
  "url" : "https://hh.ru/vacancy/111235572?query=java",
  "companyName" : "Sapiens solutions",
  "textContent" : "Sapiens Solutions - команда экспертов, специализирующаяся на разработке решений в области хранилищ данных, аналитической отчетности, мобильных приложений, системах планирования и прогнозирования. Опыт команды и её безупречная репутация - гарантия успешного сотрудничества с нашими клиентами. «Мы ценим красивые технические решения и создаем приложения, которыми пользуются». Мы предлагаем участие в проектах по реализации корпоративной системы распределения расходов на open-source решениях: Postgres, Clickhouse, Airflow, Superset, JS/Python (пилотная функциональность). Заказчик: Крупный банк РФ. Наш стек: REST, Java, JMS, Apache Kafka, Kubernetes, PostgreSQL, Istio, Spring, SpringBoot Что нужно делать: разработка бэкэнд-части высоконагруженной банковской системы на Java разработка интеграционных сервисов и микросервисных компонентов на Java написание Unit-тестов рефакторинг и оптимизация кода,Code review участие в тестировании разработанных компонентов и исправлении дефектов. Что мы ждём: высшее техническое образование опыт коммерческой разработки на Java от 6 лет уверенное знание Java, знание основ Java EE знание и опыт использования Spring Framework (в т.ч. Spring Boot, Spring Security) базовое знание SQL, опыт написания DDL/DML скриптов опыт написания Unit-тестов (Junit/TestNG) опыт командной разработки с использованием Confluence, Jira опыт разработки многопоточных приложений опыт работы с Git, Maven, Gradle знание, опыт работы с Kubernetes/Openshift Что мы предлагаем: Работа в аккредитованной IT компании; Дистанционный формат работы; Оформление по ИП; Оформление по ГПХ (налоги мы компенсируем и вы платите их самостоятельно) Стабильный и прозрачный доход; Развитая корпоративная культура; Обучение и сертификация. Будем рады видеть вас в нашей команде :)",
  "keywords" : [ "Java EE", "Maven", "Junit/TestNG", "PostgreSQL", "DDL/DM", "Istio", "SpringBoot", "Spring", "SQL", "Code review", "JMS", "REST", "Git", "OpenShift", "Apache Kafka", "Gradle", "Kubernetes" ],
  "address" : "Москва, Бауманская, Курская, набережная Академика Туполева, 15к22"
}, {
  "url" : "https://hh.ru/vacancy/112423035?query=java",
  "companyName" : "Selsup",
  "textContent" : "Наша компания SELSUP - это аккредитованная IT-компания, которая разрабатывает облачную программу для автоматизации онлайн торговли и на маркетплейсах (Ozon, Wildberries, Яндекс Маркет, Мегамаркет, АлиЭкспресс). Мы входим в Росреестр ПО и с 2023 года являемся официальным партнером Wildberries. Наша программа является ведущей программой по объемному функционалу для селлеров. Сейчас компания находится на стадии активного роста и расширяет штат команды, в связи с этим открыта вакансия Java разработчика. Важно: сейчас мы в поисках разработчика уровня middle. Плюсы работы именно у нас: Полностью удаленная работа. Не нужно ездить в офис, соблюдать дресс-код, тратить деньги и время на проезд Официальное трудоустройство Компания входит в Реестр аккредитованных IT-организаций Минцифры! Лояльное и адекватное руководство Достойная и своевременная оплата труда - 2 раза в месяц Возможность самореализации. Любая инициатива приветствуется Оплачиваемый отпуск (28 календарных дней) Карьерный рост (профессиональный и финансовый) Талантливая молодая команда, отсутствие бюрократии, поддержка и быстрое решение любых вопросов Что нужно делать: разработка backend в тесной взаимосвязи с продуктовой командой; взаимодействие с frontend разработчиками; находить простые решения сложным и интересным задачам; предлагать возможности оптимизации и свежие идеи; читать задачи в Трекере так, чтобы правильно понять задачу. А еще формулировать правильные вопросы, если задача не ясна); развитие бэкенда веб-сервиса: Spring Boot; работа с базами данных MySQL / Liquebase; поддержка системы и добавление новой функциональности; расширение интеграции с сервисами; устранять технические сбои. Мы ждем от вас: опыт работы от 1 года; бизнес-мышление - не просто писать код, а проверять работает ли новая функция; умение балансировать качеством и скоростью работы; решать задачи наиболее оптимальным путем; знания Java; умение разбираться в чужом коде и улучшать его; знания и навыки использования MySQL; взвешенный подход между новым инструментом и скоростью разработки; технический английский; выполнение тестового задания после отклика. Приветствуем, если у вас есть опыт: разработки SAAS сервисов; хорошего стиля написания кода. Условия: График работы с понедельника по пятницу с 09:00 до 18:00 (по московскому времени) Если вы заинтересовались вакансией, отправляйте отклик и будьте готовы пройти следующие этапы отбора: Анкетирование Телефонное интервью с HR Техническое интервью с руководителем",
  "salary" : "от 100 000 до 200 000 ₽ на руки",
  "keywords" : [ "TypeScript", "JavaScript", "MySQL", "HTML", "React", "SQL" ]
}, {
  "url" : "https://rabota.by/vacancy/111947474?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Syberry CIS",
  "textContent" : "Project DaVinci is a product that aims to make software engineering teams 10 times more efficient than recently formed startup teams. Already, 20+ teams and clients use the product. Our immediate goal is to deliver 96% of MVPs within 6 months after the initial client contact. We also aim to deliver the first unique features to production just 4 days after project launch. To achieve this goal, we experiment and implement new processes in 20+ engineering teams. For instance, we start development during the pre-sale process. Inside the team, we work in weekly sprints, releasing to production several times per day. Our goal is for every team member to classify as elite or high performer according to DORA metrics. We work without traditional BAs and manual QAs, meaning that engineers learn requirements from users directly and test features themselves. We work by TDD, and 80% of the project’s code is currently covered with automated tests. Stack: Java 17, Spring Boot, Camunda BPMN engine, ReactJS (TypeScript), Docker, AWS ECS, RDS, KMS, S3, STS, ECR, SQS, Lambda, Terraform, MySQL 5.7, DynamoDB, Gradle, GitLab CI, CI/CD, JUnit, Mockito, Cypress, Spring Boot test, and Hibernate. Team: Product Owner, Project Manager, Tech Lead, QA Lead, 2 Systems Analysts, 5 Software Engineers. Responsibilities: Create high-quality code using CI/CD and TDD practices, Design and build self-testing cloud-native software using AWS services, Write technical documentation, such as design documents, user guides, API specifications, etc., Collaborate with stakeholders and systems analysts to define the business requirements and maximize the value of the delivered changes, Design and implement functional behavior of software based on user needs, such as UI, business logic, data processing, etc., Perform code and design reviews, provide constructive feedback and suggestions to improve the quality and performance of software. Requirements: 5+ years of experience in software engineering on Java or Kotlin, At least a B1 level of English, Solid knowledge of the Test Pyramid and TDD, Strong skills in algorithms and design, Experience in implementing new practices in engineering teams. Will be a plus: You worked with TBD, React JS, or AWS.",
  "keywords" : [ "Java", "Amazon Web Services", "TDD", "Английский — B1 — Средний" ]
}, {
  "url" : "https://rabota.by/vacancy/112344316?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "TouchSoft",
  "textContent" : "TouchSoft is hiring! We are a worldwide software service provider and currently looking for a Middle/Middle+ Java Developer to join our team. Project Description: An innovative solution that analyzes internal corporate processes. Requirements: At least 4 years of experience in Java programming; Proficiency with Spring, Spring Boot; Experience with SQL; Understanding of OOP, SOLID; English: B1 or higher; Strong problem-solving skills; Technical background is a plus; Any experience with AI, NLP, LLM is a plus. Responsibilities: New functionality development; Integration of third-party services; Design and modernization of IT solutions; Working in a software development team; Рerformance optimization; Contribution to architecture design; Supporting of existing codebase. Benefits: Official employment; Corporate events; Remote or hybrid work; Flexible work schedule; Professional growth and development with friendly team.",
  "keywords" : [ "Java", "Git", "Spring Boot", "SQL" ],
  "address" : "Минск, Московская, улица Олешева, 1"
}, {
  "url" : "https://rabota.by/vacancy/90897379?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Альфа-Банк: направление массового бизнеса",
  "textContent" : "Альфа Банк – один из ведущих частных банков, который входит в число системно значимых банков Беларуси. Мы работаем как финтех-компания, интегрируя в свою бизнес-модель успешные практики в области мобильных платежей, онлайн-кредитования, цифровых транзакций и других передовые технологии. Сейчас в Альфе более 60 тысяч бизнес-клиентов и почти миллион клиентов-физлиц. Сегодня в команде Альфа Банка более 2500 профессионалов. Мы объединяем людей с разным опытом, взглядами и интересами. Присоединяйся к команде. Вместе мы способны на большее! Ключевые задачи: Ручное и автоматизированное тестирование веб приложений (UI, Integration, API, e2e testing); Опыт работы с TMS (Allure TestOps, TestRail, TestIT); Организация процесса тестирования на проектах; Ведение документации по тестированию проектов; Знания в области обеспечения качества ПО. Пожелания к кандидатам: от 3 лет опыта работы; Хорошее понимание процессов разработки ПО; Уверенное знание процессов тестирования и обеспечения качества; Знания инструментов автоматизированного тестирования для платформ Web; Обширные знания методов/методологий тестирования и умение применять их на практике; Практический опыт проведения различных видов тестирования; Написание тестовой документации (тестовые примеры, контрольные списки, отчеты об ошибках, планы и стратегии тестирования); Опыт использования инструментов управления дефектами (например JIRA); Опыт использования систем управления тестированием (например Allure TestOps, TestRail, TestIT); Система контроля версий (например, Git, SVN); Знание языков TypeScript; Что предлагаем для твоего комфорта: работу в команде с высокой экспертизой; современный стек технологий, масштабные проекты и сильную команду; мощное железо для работы; формат работы на выбор (удаленный/гибкий график); сочетание стабильности банка и гибкости ИТ; Альфа Среду (серию митапов о цифровой трансформации банка).",
  "keywords" : [ "QA", "TypeScript", "AQA", "Atlassian Jira", "JavaScript", "Playwright", "Тестирование", "SQL" ]
}, {
  "url" : "https://rabota.by/vacancy/111488967?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ЗАО Водород",
  "textContent" : "Мы, VADAROD – IT компания, которая специализируется на разработке ПО в сфере финтех. Сейчас мы в поиске QA Automation Engineer (Java) на проект интернет-банкинга для физических лиц (мобильная и web-версия). Чем предстоит заниматься: анализ требований; разработка позитивных/негативных/граничных сценариев; настройка тестовых окружений; подготовка тестовых данных; анализ тестового покрытия, результатов тестирования; создание отчетов по результатам тестирования; автоматизированное тестирование, выполнение автоматических тестов; интеграция с системами автоматического запуска; поддержка работоспособности уже написанных тестов; написание документации. Мы ожидаем: опыт работы в тестировании от 2 лет; опыт разработки автотестов от 1 года; знание SQL, Espresso/KIF, Appium, Java, Selenium, TestNG,Jenkins, GIT, Atlassian JIRA & Adaptavist Test Management, XML, Rest, SOAP, MQ. Мы предлагаем: просторный, комфортабельный офис в центре города с видом на парк; гибкий график работы и гибридный формат работы; отпуск 29 дней и выплата к отпуску; расширенная ДМС и курсы английского языка; оплата профильных курсов, участие в конференциях, семинарах; подарки и выплаты сотрудникам/детям сотрудников на значимые даты; спортивная зона и душевые в офисе. Откликайся! Мы ждем твое сиви!",
  "keywords" : [ "Java", "Автоматизированное тестирование", "SQL" ],
  "address" : "Минск, Купаловская, Октябрьская, Площадь Победы, проспект Независимости, 32А"
}, {
  "url" : "https://rabota.by/vacancy/112510938?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ЗАО Водород",
  "textContent" : "VADAROD – IT компания, наша команда специализируется на разработке и сопровождении программных продуктов в финтех домене. Приглашаем в команду Java разработчиков для развития текущих масштабных финтех проектов :) Задачи: Разработка функционала для приложений банка, интеграция с системами банка, разработка архитектурных решений; Мы ожидаем: Высшее техническое образование; От 3-х лет коммерческой разработки; Знание и опыт работы с Spring Boot, Data, Oracle, PostgreSQL, Liquibase, JMS, Docker, Kubernetes, Apache Camel, Keycloak, OAuth2, REST, ELK; Мы предлагаем: Комфортный, современный офис в центре города; Гибкое начало рабочего дня; Формат работы - офис, гибрид; Медицинская страховка с включенной стоматологией; Курсы английского языка; Отпуск 29 дней и материальная помощь на оздоровление; Обеспечиваем необходимой техникой для комфортной работы. Откликайся, мы будем рады познакомиться с тобой!)",
  "keywords" : [ "REST", "Docker", "ELK", "PostgreSQL", "Apache Camel", "Spring Boot", "Keycloak", "ORACLE", "Kubernetes" ],
  "address" : "Минск, Купаловская, Октябрьская, Площадь Победы, проспект Независимости, 32А"
}, {
  "url" : "https://rabota.by/vacancy/112405781?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ЗАО ТГТ",
  "textContent" : "В связи динамичным развитием и ростом компании мы ищем сотрудника на новую позицию - Java Backend Developer. Стек технологий: Spring Boot, ORM: JOOQ, PostgresSQL, Apache SOLR, Keycloak, Git, Maven, Docker. Обязанности: участие в принятии технических решений совместно с командой; разработка бизнес-логики, отвечающей за ключевые функциональные возможности; выявление и устранение ошибок и дефектов в программном коде, проведение анализа возникновения багов и разработка эффективных решений по их устранению; разработка интеграционных тестов; оптимизация приложения. Требования: опыт коммерческой разработки от 2-5 лет; знание и понимание принципов ООП, SOLID, основных паттернов проектирования; уверенные знания Java (8/11/17); понимание архитектуры Spring Framework, Spring Boot; опыт работы с Git; знание SQL и реляционных баз данных; знание REST и HTTP. Условия: официальное оформление согласно ТК РБ; заработная плата от 3000 BYN (подробно оговаривается во время собеседования); график работы: ПН-ПТ с 9:00 до 18:00 (час обеденный перерыв); комфортный новый офис с отличной инфраструктурой и парковкой у ст. м. Петровщина (пр-т Дзержинского, 90); персональное рабочее место со всей необходимой техникой; лояльное руководство, дружная команда и корпоративная жизнь. Приветствуется: опыт работы с Docker; опыт автоматизации поставки, настройки CI/CD; опыт работы с Keycloak; опыт работы c ELK.",
  "salary" : "от 3 000 Br на руки",
  "keywords" : [ "PostgresSQL", "Java", "Maven", "Git", "Docker", "Apache Solr", "Spring Boot", "ORM: JOOQ", "Keycloak" ],
  "address" : "Минск, Малиновка, Михалово, Петровщина, проспект Дзержинского, 90"
}, {
  "url" : "https://rabota.by/vacancy/112349934?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ИП Медведев Фёдор Яковлевич",
  "textContent" : "Обязанности: Участие в разработке серверной части SaaS платформы. Взаимодействие с командой разработчиков. Написание качественного поддерживаемого кода. Требования: Уверенные знания: Java core, Spring, SQL, Git. Понимание как работает HTTP, принципов REST Самостоятельность, ответственность, самоорганизованность. Рассматриваем кандидатов в том числе без коммерческого опыта разработки, но с крепкими теоретическими знаниями и высокой мотивацией. В отклике хотим видеть ссылку на ваш Github Условия: Гибкий график. Удаленная работа.",
  "keywords" : [ "Java", "REST", "Spring Framework", "SQL" ]
}, {
  "url" : "https://rabota.by/vacancy/110976810?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Модсен // MODSEN",
  "textContent" : "Modsen постоянно ищет талантливых инженеров для присоединения к нашей команде, занимающейся разработкой программного обеспечения для наших клиентов со всего мира. Наша миссия — помочь компаниям любого размера выйти на новый уровень и достичь наилучших результатов. Наша экспертиза охватывает огромное количество сфер бизнеса, таких как: FinTech, MedTech, социальные сети, логистика, путешествия, IoT, HealthCare и т. д. В настоящей момент мы находимся в поиске талантливого JDE Developer, который сможет присоединиться к нашей дружной команде! Обязанности: Опыт поддержки и разработки системы JD Edwards Enterprise One (версии 8 или выше); Будет заниматься как разработкой нового функционала, так и улучшения в платформе JDE; Также будет выполнять различные модификации/настройки отчетов, а также знакомиться с любыми/всеми модификациями кода, внесенными компанией в JDE; Будет участвовать в мероприятиях по планированию проекта, включая определение подробных задач проекта. Требования: 1–5 лет опыта работы с приложениями JDE Enterprise One (версия 8 или выше); Опыт проектирования, кодирования и тестирования пользовательских модулей и отчетов; Опыт поддержки приложений JDE Enterprise One предпочтителен; Сильный финансовый опыт (главная книга (GL), счета дебиторов (AR) и счета кредиторов (AP) и т. д.) будет плюсом; Требуются навыки письменного английского языка (хорошие навыки разговорного английского языка будут плюсом); Знакомство с JDE CNC будет плюсом, но не обязательно. Условия: Официальное оформление; Отпуск 25 календарных дней; Корпоративный английский для сотрудников (online/offline); \"Sick-days” в количестве 5-ти дней в году; Подарки ко дню рождения сотрудников, годовщине работы и другим значимым дням; Современные и уютные офисы, с зонами отдыха и кухней.",
  "keywords" : [ "Oracle DB", "Java", "ERP", "ERP Systems", "JDEdwards" ]
}, {
  "url" : "https://rabota.by/vacancy/112708469?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ОАО АСБ Беларусбанк",
  "textContent" : "Обязанности: разработка, доработка программного обеспечения на языке ABAP. участие в проекте разработки и тестирования ПО для международных и межбанковских расчетов Требования: высшее ИТ-образование; опыт работы в разработке программного обеспечения не менее 2 лет; опыт разработки на языке ABAP: опыт функциональной разработки, ABAP Objects, знание объектов репозитория (элементы данных, структуры, таблицы); навыки работы с файлами (загрузка, выгрузка, парсинг данных); умения в использовании технологий: ALV Grid, PDF-Forms, Transformation; навыки оптимизации производительности (ST12, ST05, SAT); анализ ошибок, дампов (ST22); знание объектно-ориентированного программирования; уверенное знание SQL; знание форматов: XML (XSD), JSON готовность к сверхурочной работе (при необходимости) Приветствуется: опыт разработки на языках Java, Python; опыт работы с веб-сервисами; опыт разработки ПО, участие в проектах по направлению международных и межбанковских расчетов; опыт работы с прикладным ПО SAP Условия: должность и условия оплаты труда по результатам собеседования; удобное расположение офиса (шаговая доступность от ст.м.); работа в офисе, 5/2",
  "salary" : "от 2 450 до 4 000 Br на руки",
  "keywords" : [ "ST05", "ALV grid", "Java", "Transformation", "SAP", "ST12", "SAT", "ST22", "Xsd", "JSON", "PDF-Forms", "работа с файлами", "ABAP", "SQL", "разработка", "ABAP Objects", "ООП", "XML", "веб-сервисы", "программирование", "Тестирование ПО", "функциональная разработка", "объекты репозитория", "Python" ]
}, {
  "url" : "https://rabota.by/vacancy/112436302?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ОАО Приорбанк",
  "textContent" : "Приорбанк на рынке уже 35 лет и мы являемся ведущим коммерческим банком страны. Мы первыми запустили Интернет-Банкинг и разработали приложения для мобильных устройств Android и Apple iOS. Сегодня более 200 000 человек пользуются системами дистанционного обслуживания банка и ценят их простоту и функциональность. И мы хотим сделать наш продукт еще лучше! Сейчас в команде 5 Java разработчиков, и мы с нетерпением ждем еще двух #JavaDeveloper (Middle) для работы над нашим проектом Интернет-банкинг :) Локация г.Минск. Основные задачи: разработка ПО; работа над проектом интернет-банкинга; Java 8+ Database: SQL, Relation Database, Normalization Transaction, ACID Spring, Hibernate Maven ООП, SOLID, Паттерны проектирования Multithreading Git JUnit, TDD HTTP, SOAP RPC, REST Security Пожелания к кандидатам: Высшее инженерно-экономическое, техническое, математическое образование. Уверенные знания и опыт коммерческой разработки на Java от 3 лет (в идеале Java 8). Системное мышление, способность к освоению новых технологий, умение ясно и четко излагать свои мысли, инициативность, ответственность, коммуникабельность. Обязательна готовность к сотрудничеству в роли инженера-программиста на долгосрочной основе (от 2-х лет). Как дополнительное преимущество, рассматривается: знания и опыт работы с WSO2, Spring, Unit-tests, Https, Apache POI; опыт работы в банковской сфере. Мы предлагаем:",
  "keywords" : [ "Java", "Hibernate", "Middle+", "Spring", "SQL" ],
  "address" : "Минск, Площадь Якуба Коласа, улица Кропоткина, 91Б"
}, {
  "url" : "https://rabota.by/vacancy/112577950?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ОАО Сбер Банк",
  "textContent" : "В связи с открытием проекта по созданию единого хранилища данных ищем в команду Архитектора данных. Ключевые задачи: Разработка и сопровождение корпоративной модели данных Актуализация стратегии данных, политик и процессов управления данными Трансформация бизнес требований в модели, структуры и потоки данных Планирование и обеспечение выполнения мероприятий в области архитектуры данных, включая метаданные, мастер-данные, качество данных, безопасность и доступность данных Согласование требований к данным при создании новых продуктов либо изменение существующих продуктов Определение степени влияния новых продуктов на архитектуру данных, с целью выявления и недопущения конфликта данных Контроль жизненного цикла данных Разработка мероприятий при выявлении ошибок, несоответствий данных, проблем с качеством данных Разработка план-графиков и ресурсных планов по миграции данных Взаимодействие с Agile-командами, Data owner, Data Quality Engineer, Data Scientist по вопросам реализации стратегии управления данными Мы ожидаем от кандидатов: Опыт работы в роли корпоративного архитектора данных/ архитектора DWH/ архитектора Data Lake/ архитектора Lake House не менее 2 лет Опыт работы в финтех (приветствуется) Экспертные знания в теории построения баз данных Знание архитектурных аспектов DWH, Data Fabric, Data Lake, Lake House Понимание архитектуры MPP, Client\\Server, Web Server\\Application, Microservice Опыт моделирования баз данных на 3 уровнях: концептуальная модель, логическая модель, физическая модель Владения инструментами моделирования баз данных (ERWin, Draw.io, Lucidchart или другими) Опыт разработки и работы с базами данных под управлением СУБД PostgreSQL/Greenplum Будет плюсом опыт разработки и работы с базами данных под управленим СУБД Oracle, MSSql, Teradata Понимание архитектурных принципов работы векторных и колоночных баз данных Знание технологий для интеллектуального анализа больших данных и машинного обучения (например, на базе Hadoop) Экспертные знания языка SQL Будет плюсом знание Python и/или Java Знание технологий оркестровки и поставки данных (например, Kafka, ActiveMQ) Опыт формирования и ведения каталога данных Знание принципов управления данными (DAMA, Cobit2019) Коммуникационные навыки, которые ставят сотрудничество выше конфликта Вы получите: Работу в одном из самых технологичных банков Беларуси Амбициозные и нестандартные задачи, возможность внедрять инновационные изменения Возможности внешнего и внутреннего обучения, доступ 24/7 к платформе дистанционного обучения Сбербанка СберУниверситет - курсы, лекции, книги, ролики актуальным направлениям Дружную команду с культурой поддержки и сотрудничества Комфортные условия работы в новом современном офисе в центре города",
  "keywords" : [ ]
}, {
  "url" : "https://rabota.by/vacancy/111112280?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ОАО ЦНИИТУ",
  "textContent" : "Frontend developer зарплата по итогам собеседования ОАО ЦНИИТУ Пролетарская, Минск, Партизанский проспект, 2к4 Требуемый опыт работы: 1–2 лет. Полная занятость, полный день. ОАО \"ЦНИИТУ\" приглашает на работу Frontend-разработчика. Обязанности: Frontend JS разработчик (React фреймворк, MongoDB, PostgreSQL, NodeJs, React Native, Redux, Flux, RTK Query). Качественное и своевременное проектирование, разработка кода и рефакторинг. Умение разбираться и поддерживать чужой код. Знания по Java, Sql будут плюсом. Требования: Обязательно Уверенные знания в React, JavaScript, HTML5, CSS3.Опыт работы с React. Понимание основ XML/XSD. Конвертация XML/SOAP в JSON/REST, процессов интеграции средствами WEB-сервисов. Понимание и опыт работы (минимальное проектирование и администрирование, знания SQL-запросов будет преимуществом) с реляционными и документоориентированными базами данных. Понимание микросервисной архитектуры на уровне пользователя. Наш стек: React, Kubernetis, Java, Spring, Maven, Kafka, PostgreSQL, Mongo. Желательно Опыт профессиональной разработки программного обеспечения от 1 года. Понимание протокола HTTP и опыт работы с внешними API (REST). Условия: Полный день, понедельник-пятница с 9 до 18. Проф. обучение, повышение квалификации. Медицинское страхование после 3х месяцев работы.",
  "salary" : "от 2 700 до 4 500 Br на руки",
  "keywords" : [ "Vue.js", "REST", "DOM", "PostgreSQL", "JavaScript", "HTML5", "MongoDB", "JSON", "React Native", "React" ],
  "address" : "Минск, Пролетарская, Партизанский проспект, 2к4"
}, {
  "url" : "https://rabota.by/vacancy/110955292?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО АйФьючер",
  "textContent" : "Привет! Мы находимся в поиске Senior Java Developer в нашу команду. Масштабные решения, культура профессионализма и интересные задачи – это про нас :) iFuture – продуктовая IT-компания, мы разрабатываем собственный международный продукт с многомиллионной аудиторией в сфере спортивной аналитики и развлечений уже на протяжении 27 лет. Ищем опытного Java разработчика в команду, которая разрабатывает сервисы маркетинга. Основные задачи: анализ и обсуждение бизнес-требований; интеграция со сторонними сервисами и системами; поддержка и развитие существующей функциональности; разработка и добавление новых сервисов. Наши технологии: Java 17/21; Spring Boot; JPA/Hibernate; Redis; Apache Kafka, RabbitMQ; Docker; REST / JSON-RPC; PostgreSQL / Oracle DB; JUnit, Mockito; Maven; Atlassian, микросервисная архитектура. Вы нам подходите, если имеете: высшее техническое образование (преимуществом будет профильное - \"прикладная информатика\", \"программная инженерия\" и др.); опыт в разработке распределённых систем от 5 лет; опыт работы со Spring экосистемой, Spring Boot, Hibernate; опыт работы с реляционными БД (желательно PostgreSQL, Oracle); опыт работы с MessageBroker-ми (желательно RabbitMQ, Kafka); Мы предлагаем: отсутствие овертаймов: мы за баланс работы и отдыха! гибкое начало рабочего дня (присутственные часы с 11 до 17 GMT+3), 5-дневная рабочая неделя; возможность выбрать удобный формат работы – из дома, в офисе или гибридно; 5 оплачиваемых Sick Days в дополнение к отпуску (25 дней); комфортный офис в центре города с зонами отдыха, кикером, открытыми и закрытыми зонами для проведения совещаний и stand-up митингов, оборудованную кухня со всем необходимым для лёгкого перекуса и обеда; корпоративную рабочую технику и аксессуары; компенсацию оплаты обучений и конференций по профилю специализации, чтобы каждый сотрудник мог расти и развиваться, а также доступ к корпоративной библиотеке; расширенную ДМС со стоматологией и медикаментами; корпоративные скидки у компаний-партнеров; внутренние курсы английского языка в онлайн и оффлайн формате; классные тимбилдинги и дружную команду; оформление по ТК Республики Беларусь с 1-го рабочего дня (испытательный срок – не более 3-х месяцев).",
  "keywords" : [ "Java", "Maven", "Hibernate", "PostgreSQL", "Redis", "JSON-RPC", "RabbitMQ", "Oracle DB", "REST API", "REST", "Docker", "JUnit", "Mockito", "Spring Framework", "Apache Kafka" ],
  "address" : "Минск, Институт Культуры, Площадь Ленина, Могилёвская улица, 39А"
}, {
  "url" : "https://rabota.by/vacancy/112319738?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Белорусские облачные технологии",
  "textContent" : "Обязанности: постановка задач разработчикам и контроль их исполнения; построение моделей процессов, данных, объектов предметной области; сбор, анализ и формализация требований, с использованием типовых методов и техник для определения границ ИТ-проекта; участие в приемке (испытаниях) вместе с заказчиком/ пользователями/ исполнителями; взаимодействие с исполнителями по: модернизации ИС; модификациям ПО; доработкам адаптации, интеграции, настройкам ПО (ИС); корректировке документации. развитие архитектуры ИТ-решений, реализуемых в АИС УСФ, в соответствии с развитием бизнеса; разработка и внедрение структуры технической части подразделения и ИТ процессов обеспечения работы подразделения Общества; формирование команд: найм, онбординг, развитие, командообразование; выполнение функций представителя заказчика при разработке, развертывании, ввода в эксплуатацию модернизируемой АИС УСФ и внедрении ее программного обеспечения. Требования: высшее техническое или инженерное образование; опыт в разработке автоматизированных (информационных) систем и (или) комплексам программ (программ /компонентов) в качестве системного аналитика/разработчика/архитектора от 3-х лет; понимание современного технологического стэка; умение разбираться в чужом коде и проводить code review; экспертные знания большинства технологий, релевантных стеку; Domain-Driven Design (DDD), знание паттернов; Java экспертные знания и лучшие практики; Фреймворки: Spring, Apache Camel, Hibernate, опыт разработки; Инструменты мониторинга (ELK, Zabbix, Prometheus); DevOps: Основы, контейнеризация (Docker, Gitlab, CI/CD); оптимизация и профилирование кода; испытания: юнит (автономные) и функциональные (комплексные) тесты; процессы и оценка (Scrum/ Kanban); базы данных: PostgreSQL, Clickhouse, Cassandra; глубокое знание нотаций и опыт работы с BPMN и IDEF0; знание архитектурных принципов построения автоматизированных (информационных) систем и (или) комплексов программ (программ /компонентов): микросервисной архитектуры; принципов построения клиент-серверных систем; знание различных видов интеграций систем, в том числе асинхронных; понимание архитектуры REST и принципов построения RESTful-сервисов. знание форматов XML, JSON и SQL; глубокие знания HTTP (методы, коды состояний, идемпотентность) и SOAP, понимание UML; глубокое знание принципов построения репозиториев (Git); аккуратность, внимательность, обязательность при выполнении задач; умение находить общий язык с людьми для достижения результатов; Условия: работа в центре города; официальное трудоустройство; добровольное медицинское страхование; абонемент в бассейн/тренажерный зал; оплата мобильной связи; официальная стабильная заработная плата; бонусы по результатам работы; возможности для профессионального роста (обучение и тренинги); хорошо оборудованное рабочее место; пн.-чт. с 9:00-18:00, (отпуск от 28 календарных дней).",
  "keywords" : [ ],
  "address" : "Минск, улица Клары Цеткин, 24"
}, {
  "url" : "https://rabota.by/vacancy/112056210?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Блокчейн Лабс",
  "textContent" : "Проект NDA активная стадия разработки и реализации децентрализованной системы на базе технологии блокчейн. Стек проекта: Go, HyperLedger Fabric, Node.js, Express, MongoDB, Redis, Swagger, JavaScript/TypeScript, React.js, CSS, styled-components, Webpack, ether.js. Чем предстоит заниматься: Разработка и работа с библиотеками для интеграции приложений с блокчейн, работа со смарт-контрактами. Работа с HyperLedger Fabric. Разработка, интеграция и документирование API. Создание микросервисной архитектуры и работа с контейнерами. Unit Testing и интеграционное тестирование. Кого мы хотим видеть в команде: У тебя от 4-х лет опыта разработки. Уверенные знания и навыки Go. Большим преимуществом будет владение JavaScript/TypeScript или Java и его фреймворков. Опыт работы с различными типами баз данных (NoSQL (MongoDB), SQL). Базовое понимание принципов работы блокчейн технологий. Опыт работы или базовые знания фреймворка HyperLedger Fabric будет преимуществом. Опыт разработки и интеграции API, знание RESTful и/или GraphQL. Знание и опыт создания микросервисной архитектуры и работы с контейнерами (например, Docker). Опыт написания юнит-тестов и интеграционного тестирования. Знание принципов CI/CD и опыт работы с инструментами для автоматизации процессов разработки. Что мы предлагаем: Возможность реализации и поддержки собственного приватного блокчейна на Hyperledger Fabric, которая позволяет взглянуть на применение концепции блокчейна с других сторон и получить новые идеи его использования. Гибкое утро и комфортный формат работы (удаленка/гибрид по желанию). Оплачиваемые sick days и дополнительные дни к отпуску. Официальное оформление по ТК РБ. Эффективный менеджмент и дружная команда.",
  "keywords" : [ "Golang", "CSS", "Unit Testing", "GraphQL", "Go", "Node.js", "HyperLedger Fabric", "SQL", "TypeScript", "REST API", "NoSQL", "Docker", "JavaScript", "CI/CD", "MongoDB", "API", "styled-components", "Webpack", "RESTful" ],
  "address" : "Минск, Зыбицкая улица, 2"
}, {
  "url" : "https://rabota.by/vacancy/110095611?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Будущее технологий",
  "textContent" : "В Т1 стабильность и финансовая надежность, а также социальные гарантии гармонично сочетаются с преимуществами ИТ‑компании — открытостью, инновациями и гибридным форматом работы. Мы стремительно растём, масштабируемся и ищем новых специалистов в команду! В рамках финтех‑направления мы разрабатываем инновационные решения для цифровизации финансового сектора: современные финтех‑продукты, системы работы с большими данными и комплексные решения для фронт‑ и бэк‑офисов. В продуктовом портфеле — создание современных высоконагруженных фронтальных систем, омниканальных продуктов и высоконадежных платформ для поддержки банковского бизнеса. Мы работаем с крупнейшими организациями банковского сектора, ведущими финансовыми компаниями и активно выстраиваем партнерскую работу на Ближнем Востоке, в Африке и Юго‑Восточной Азии. Охват пользователей продуктов составляет более 15 миллионов человек. Обязанности: Реализация функционала (анализ функционала по требованию) Поддержка и улучшение кодовой базы Покрытие функционала модульными тестами Оптимизация бизнес логики и повышение стабильности системы (выявление \"узких мест\" системы) Выявление тех долга Проведение код ревью Проработка бэклога Планирование и подготовка релизов Написание документации Требования: Работа с Jira/Confluence, Bitbucket, Teamcity, понимание работы CI/CD конвейера Опыт проектирования и реализации интеграционных взаимодействий, очереди (ibm mq, activemq, kafka) Навыки поиска причин ошибок в коде, понимание работы микросервисов,понимание и желание работы в скрам-команде, уметь коммуницировать с коллегами Тех стек (Java 8/11, Spring boot 2/3, JPA: Hibernate +CriteriaApi + Spring Data Jpa, MQ: Kafka/Ibm Mq, БД: Postrges, Тесты: Junit, Mockito) Хорошее понимание REST и SOLID; Плюсом будет знакомство с Kubernetes и Docker; Дополнительным плюсом будет знание Spring Cloud, Lombok, Mapstruct, Liquibase. Почему именно Т1? Мы создадим комфортные условия для работы, предложим интересные и масштабные задачи, а также поможем профессионально расти и развиваться, участвовать в кросс‑командных проектах и определять собственную траекторию развития. Преимущества работы в Т1: Комфортные офисы и гибкий рабочий день В офисе, удаленно или в гибридном формате. Главный офис у м. Динамо в Москве — победитель в номинации «Гибкий офис» Best Office Awards 2023 ДМС и комплексные программы поддержки ДМС с телемедициной и возможностью подключения родственников и Добросервис для психологической, юридической и финансовой поддержки Участие в конференциях и профессиональное обучение Бесплатное обучение, LMS платформа с 70+ курсами для развития технических и коммуникационных навыков, программа наставничества, а также 12+ активных сообществ и техногильдий Интересные задачи, производительное железо и софт для работы Востребованные на рынке ИТ‑продукты, ключевые ‑ уже внесены в ЕРРП (реестр российского ПО) Насыщенная корпоративная жизнь и нетворкинг Масштабные таунхоллы и яркие неформальные события, регулярные митапы, корпоративная библиотека, активные сообщества и многое другое Скидки и партнерские программы Сервис привилегий от 100+ партнёров на покупку техники, занятия спортом и иностранными языками, концерты, отели, SPA и др. А также развитая программа компенсации и маркетплейс мерча с собственной корпоративной валютой Конкурентная заработная плата Достойный оклад по итогам интервью и система премирования. Оформление по ТК и эксклюзивный зарплатный проект для сотрудников в банке ВТБ Дополнительные выходные и материальная помощь Рождение ребёнка, поддержка многодетных семей и одиноких родителей, смерть членов семьи и др. Дополнительный оплачиваемый отпуск (3 календарных дня)",
  "keywords" : [ ]
}, {
  "url" : "https://rabota.by/vacancy/110811420?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Будущее технологий",
  "textContent" : "Мы стремительно растём, масштабируемся и ищем новых специалистов в команду! Наша компания входит в ГК Иннотех — современная быстроразвивающаяся аккредитованная IT-компания с фокусом на высокие технологии. Мы выросли до 10 000+ человек менее чем за два года. В ГК Иннотех стабильность работы — финансовая надежность, социальные гарантии, бонусы, — сочетается с преимуществами IT-компании — открытость, инновации, гибридный формат работы. В рамках направления разработки ИТ-решений мы помогаем ускорить цифровую трансформацию с помощью гибких и быстроадаптируемых решений мирового уровня: современные ИТ-продукты, системы работы с большими данными и комплексные решения для фронт- и бэк-офисов. Наши разработки повышают гибкость и эффективность работы банковских команд. Вместе с нами тебе предстоит: разработĸа новых миĸросервисов, поддержĸа и доработĸа теĸущих; подготовĸа релиз плана перед обновлением сервиса или первого вывода в прод; участие в ĸод ревью; участие в принятии техничесĸих и архитеĸтурных решениях; участие в планировании спринтов, оценĸе и деĸомпозиции задач. Какие знания и навыки для нас важны: опыт разработки на Java от 3х лет; уверенное владение Java, понимание принципов работы JVM. Знание основных библиотек и шаблонов проектирования; опыт использования Spring Framework (boot, mvc, data, secutity...); опыт работы с многопоточностью и асинхронностью будет преимуществом; опыт работы с базами данных, умение писать и оптимизировать запросы; опыт работы с распределёнными хранилищами и системами; знание HTTP, REST, SOAP; понимание особенностей микросервисной архитектуры. Мы предлагаем: Интересную работу в стабильной и развивающейся компании; Комфортный и уютный офис в шаговой доступности от ст.м. Купаловская/Октябрьская; Официальное трудоустройство и своевременная оплата труда 2 раза в месяц; Достойный оклад по итогам интервью и система премирования; Добровольное медицинское страхование по окончанию испытательного срока; Материальная помощь к значимым событиям в жизни работника; Дружную и нацеленную на успех команду.",
  "keywords" : [ "Java", "PostgreSQL", "Spring Framework", "SQL" ]
}, {
  "url" : "https://rabota.by/vacancy/111985961?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Будущее технологий",
  "textContent" : "Мы стремительно растём, масштабируемся и ищем новых специалистов в команду! Наша компания входит в ГК Иннотех — современная быстроразвивающаяся аккредитованная IT-компания с фокусом на высокие технологии. Мы выросли до 10 000+ человек менее чем за два года. В ГК Иннотех стабильность работы — финансовая надежность, социальные гарантии, бонусы, — сочетается с преимуществами IT-компании — открытость, инновации, гибридный формат работы. В рамках направления разработки ИТ-решений мы помогаем ускорить цифровую трансформацию с помощью гибких и быстроадаптируемых решений мирового уровня: современные ИТ-продукты, системы работы с большими данными и комплексные решения для фронт- и бэк-офисов. Наши разработки повышают гибкость и эффективность работы банковских команд. Вместе с нами тебе предстоит: Поддержка существующего приложения, внедрение новой функциональности. Поддержка кастомных элементов пользовательского интерфейса. Написать Unit Test для существующих модулей. Работать с системой контроля версий Git. Работа в кросс-функциональной команде. Мы ожидаем: Опыт разработки Android от 4х лет. Уверенные знания по Java и Kotlin. Умение разбираться и работать с чужим кодом. Готовность к командной работе и трудиться над общими задачами. Знание и понимание принципов SOLID. Понимание и умение применять архитектурные паттерны (MVP, MVVM, …). Опыт работы с Dagger 2, RxJava 2, Android Architecture Components. Опыт работы с Git. Участие в code review. Опыт разработки клиент-серверных приложений. Jira, confluence. Опыт написания Unit/UI-тестов. Мы предлагаем: Интересную работу в стабильной и развивающейся компании. Комфортный и уютный офис в шаговой доступности от ст.м. Площадь Победы. Официальное трудоустройство и своевременная оплата труда 2 раза в месяц. Достойный оклад по итогам интервью и система премирования. Добровольное медицинское страхование по окончанию испытательного срока. Материальная помощь к значимым событиям в жизни работника. Дружную и нацеленную на успех команду.",
  "keywords" : [ "Java", "Dagger2", "RxJava", "Kotlin" ]
}, {
  "url" : "https://rabota.by/vacancy/111745285?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Бэлл Интегратор",
  "textContent" : "Устройся на «удалёнку» и получи денежный Welcome бонус Да, тебе не показалось! Почему тебе стоит работать именно у нас? БэллИнтегратор — крупнейший/ведущий интегратор, где каждый найдет себе работу по душе! У нас большой выбор проектов. Мы специализируемся на предоставлении технологических услуг и инновационных сервисов. Проект: Импортозамещение КБД (Корпоративной Базы Данных) КБД является одной из ключевых систем, используется для внутреннего учета российских и иностранных ценных бумаг, документов, корпоративных действий, а также формирования отчетности. Технологический стек: .Net C#, MSSQL, микросервисы ASP.Net Core Мы ожидаем от кандидата: Продвинутые знаниями и опыт работы с raw SQL (хранимые процедуры, view, функции и т.д.) Хорошие знания работы ORM (желательно Linq2Db, но не факт, что таких много, пойдёт и EFCore) Опыт работы с LINQ (идеально, если есть опыт переноса raw SQL на LINQ) Создание и сопровождение сложных WebApi Желательно: опыт работы с фронтом (желательно Angular, но подойдёт и другой framework), главное - уметь связывать фронт и api опыт работы с фронтом в плане верстки умение читать чужой код и разбираться в нём если есть опыт по архитектуре приложений, то тоже приветствуется Мы предлагаем: Находиться в балансе между работой и личными увлечениями Корпоративные скидки на образовательные курсы платформ Skill Cup (25%) и \"Синхронизация\" (30%) Насыщенная корпоративная жизнь: онлайн мероприятия. В компании есть бесплатная сертификация, в том числе международная, для тестировщиков, разработчиков Java, руководителей проектов и аналитиков. В честь дня рождения сотрудники могут взять 1 оплачиваемый выходной в течение года за счет компании. Возможность работать удаленно Откликайтесь! С радостью расскажем больше о компании!",
  "keywords" : [ "C#", "LINQ", ".NET Framework", "Angular" ]
}, {
  "url" : "https://rabota.by/vacancy/111746777?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Бэлл Интегратор",
  "textContent" : "Bell Integrator – один из ведущих системных интеграторов России. Мы являемся аккредитованной ИТ-компанией. Центральный офис Bell Integrator расположен в Москве, представительства – в Нижнем Новгороде, Пензе, Саратове, Уфе, Минске (Беларусь). На текущий момент с нами работает более 2500 высококлассных аналитиков, руководителей проектов, разработчиков, тестировщиков и специалистов по сопровождению крупных информационных систем. Bell Integrator активно реализует проекты по всей России, среди наших заказчиков – крупнейшие системообразующие финансовые, телеком и ритейл компании страны. На рынке РБ Bell Integrator 12 лет. Являемся резидентами ПВТ (Парк высоких технологий). Обязанности: автоматизация тестирования клиент-серверных приложений (обязательно - API, WEB, MQ, DB) Требования: Опыт от 2х лет Знание в Java stream api + functional interfaces + модификаторы +- реализацию ООП концепций; Опыт разработки тестовой документации (чек-листы, планы, отчеты и тому подобное); Умение находить/формулировать/предлагать решения; Высокий уровень самоорганизации и коммуникативный навык; Условия: - Конкурентоспособная заработная плата - Корпоративное обучение и сертификация в технических и бизнес областях - Широкие возможности для карьерного роста и профессионального развития - Корпоративные развлекательные программы - Корпоративная программа частичной компенсации занятий по английскому языку (партнер Skyeng) - компенсация спорта AllSports - ДМС.",
  "salary" : "от 190 000 до 260 000 ₽ на руки",
  "keywords" : [ "Java", "Git", "TestNG", "Apache Kafka", "API", "Автоматизированное тестирование", "SQL" ],
  "address" : "Минск, Институт Культуры, улица Фабрициуса, 8"
}, {
  "url" : "https://rabota.by/vacancy/112162033?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Бэлл Интегратор",
  "textContent" : "BELL INTEGRATOR – крупный системный интегратор страны. Мы являемся аккредитованной ИТ– компанией. На текущий момент с нами работает более 2500 высококлассных аналитиков, руководителей проектов, разработчиков, тестировщиков и специалистов по сопровождению крупных информационных систем. Bell Integrator активно реализует проекты по всей России, среди наших заказчиков – ведущие системообразующие финансовые, телеком и ритейл компании страны. Центральный офис Bell Integrator расположен в Москве, представительства – в Нижнем Новгороде, Пензе, Саратове, Уфе, Минске (Беларусь). ПРОЕКТ: Проекты в банковской сфере. ЧТО МЫ ОЖИДАЕМ ОТ КАНДИДАТА: Опыт работы DevOps инженером от 3-х лет. Знание Linux на уровне системного администратора. Понимание работы систем баз данных, таких как SQL и NoSQL. Опыт работы с PostgreSQL. Опыт работы с RabbitMQ, Kafka. Опыт работы с Docker, Compose, Kubernetes. Опыт работы с инструментами Git, Ansible, Helm. Опыт работы с системами мониторинга Prometheus, Grafana, Zabbix. Опыт работы с ELK стеком. Опыт построения CI/CD пайплайнов Gitlab. Знание языков программирования Bash, Python. Опыт работы с Nginx, HAproxy. БУДЕТ ПЛЮСОМ: Базовое понимание сборки проектов на языках: java (Maven, Gradle), C#(.net), NodeJS. Знание языков программирования Java. Опыт работы с SonarQube и SAST. Опыт работы с Keycloak, Vault Опыт работы с Harbor, Nexus, Artifactory Опыт работы с Mongo, Redis, Consul ОБЯЗАННОСТИ КАНДИДАТА Должностные обязанности Развертывание и сопровождение инфраструктуры разработки и конвейеров Ci/Cd. Менторство над DevOps инженерами Junior. Разработка и развитие средств автоматизации процессов сборки, развёртывания. Создание и развитие инструментов мониторинга и логирования. Соблюдение согласованного уровня сервисов (SLA,OLA). Развертывание и поддержка баз данных. ЧЕМ ПРЕДСТОИТ ЗАНИМАТЬСЯ: Развертывание и сопровождение инфраструктуры разработки и конвейеров Ci/Cd. Менторство над DevOps инженерами Junior. Разработка и развитие средств автоматизации процессов сборки, развёртывания. Создание и развитие инструментов мониторинга и логирования. Соблюдение согласованного уровня сервисов (SLA,OLA). Развертывание и поддержка баз данных. МЫ ПРЕДЛАГАЕМ: Возможность участия в интересных проектах. Возможность профессионального и карьерного роста в компании. Опыт работы в команде профессионалов. Денежный Welcome бонус. Специальные тарифы для сотрудников в спортивные клубы и языковые курсы. Удаленный формат работы.",
  "keywords" : [ "ELK", "Kafka", "Prometheus", "Grafana", "SQL", "RabbitMQ", "NoSQL", "Git", "Linux", "Docker", "Ansible", "CI/CD", "Kubernetes", "Python" ]
}, {
  "url" : "https://rabota.by/vacancy/112191871?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Бэлл Интегратор",
  "textContent" : "БэллИнтегратор — крупнейший/ведущий интегратор, где каждый найдет себе работу по душе! У нас большой выбор проектов. Мы специализируемся на предоставлении технологических услуг и инновационных сервисов. Банковский проект. Пишем тесты на Java 15 + maven. Ручным тестированием не занимаемся. Широкий выбор задач по тестируемым проектам (API, WEB, MQ, DB). Все, что нужно для автоматизации, уже есть в нашем многомодульном фреймворке на базе junit5. А если нет — дописываем. Мы ожидаем от кандидата: Опыт работы в автоматизации тестирования от 3-х лет Опыт в автоматизации тестирования клиент-серверных приложений (API, WEB, MQ, DB) Знание Java stream api + functional interfaces + модификаторы +- реализация ООП концепций Опыт разработки тестовой документации (чек-листы, планы, отчеты и тому подобное) Умение находить/формулировать/предлагать решения Высокий уровень самоорганизации и коммуникативные навыки Обязанности: Разработка API, WEB, MQ, DB автотестов на Java Тестирование ТЗ на разработку (полнота, непротиворечивость и т.п.) Разработка чек-листов по требованиям (xray) Фиксация дефектов, не проработанных/спорных моментов в Jira/Confluence Разработка вспомогательных общих решений + code review Заведение и контроль исправления дефектов Взаимодействие с командой аналитиков и разработчиков Мы предлагаем: Находиться в балансе между работой и личными увлечениями Возможность работать удаленно на территории РФ и РБ Корпоративные скидки на образовательные курсы платформ Skill Cup (25%) и \"Синхронизация\" (30%) Насыщенная корпоративная жизнь: онлайн мероприятия. В честь дня рождения сотрудники могут взять 1 оплачиваемый выходной в течение года за счет компании.",
  "keywords" : [ "JUnit", "Apache Kafka", "API" ]
}, {
  "url" : "https://rabota.by/vacancy/112355172?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Бэлл Интегратор",
  "textContent" : "Обязанности: Прогнозирование нагрузки Построение модели для прогнозирования нагрузки на систему на основании текущей статистики промышленной эксплуатации, либо по модели бизнес процесса Проведение нагрузочного тестирования системы с целью определения максимальной производительности системы, проверки соответствия системы требованиям производительности, оценки влияния изменения в системе на ее производительность Оптимизация производительности Подготовка рекомендаций по повышению производительности систем, участие в рабочих группах по решению проблем производительности в промышленной среде  Требования: Опыт работы от 2 лет в нагрузочном тестировании Понимание архитектуры бизнес-систем Понимание методологии нагрузочного тестирования Опыт организации работ с участием нескольких инженеров по нагрузочному тестированию Экспертиза по средствам диагностики проблем производительности в различных компонентах бизнес систем (сеть, оборудование, операционные системы, базы данных, сервера приложения, java performance, .net) Опыт диагностики и оптимизации СУБД (Oracle или MS SQL), плюсом будут опыт разработки и опыт в оптимизации ELK / Mongo Опыт диагностики и оптимизации Приложений (Java - в приоритете или .NET), плюсом будет опыт разработки Знание инструментов нагрузочного тестирования ( HPE Performance Center, LoadRunner ) Опыт диагностики, мониторинга и оптимизации приложений в Docker также приветствуется  Условия: Официальное трудоустройство в аккредитованную компанию Bell Integrator Конкурентная заработная плата Удаленный формат работы Добровольное медицинское страхование Собственное фитнес-приложение Скидки на занятия английским языком через SkyEng Корпоративная техника (по согласованию с руководителем) Корпоративные развлекательные программы Корпоративные скидки до 30% на фитнес в крупнейших клубах России (World Class, X-fit, Fitness House) Корпоративный мерч и крутые подарки",
  "keywords" : [ "Java", "MS SQL", "Нагрузочное тестирование", "ORACLE" ]
}, {
  "url" : "https://rabota.by/vacancy/112663573?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Бэлл Интегратор",
  "textContent" : "Проект: Импортозамещение Аламеда Обязанности: Корректировка кода депозитарной системы на БД Postgres Требования: Высшее образование в области информатики или математики, или специализированные курсы Опыт коммерческой разработки на Postgre не менее 3 лет; Опыт коммерческой разработки на PL/SQL не менее 1 года; Знание основных принципов работы СУБД Postgres; Знание основных принципов работы СУБД Oracle; Знание форматов XML, XSLT, JSON; Знание протоколов REST; Будет плюсом: Умение писать BDD тесты; Опыт разработки на Java; Знание систем управление версиями (git, subversion итд); Знание вики-систем (confluence), трекеров (jira, redmine); Условия: Возможность профессионального и карьерного роста в компании, возможность поучаствовать в разных проектах; Опыт работы в распределенной команде профессионалов; Уровень заработной платы обсуждается индивидуально; Возможность работать удаленно.",
  "keywords" : [ "Git", "PostgreSQL", "ORACLE" ]
}, {
  "url" : "https://hh.ru/vacancy/105276206?query=java",
  "companyName" : "ООО ГК Иннотех | разработка ИТ-решений (Иннотех)",
  "textContent" : "Обязанности: разрабатывать приложения на базе микро-сервисной архитектуры, поддерживать и дорабатывать теĸущие; уметь самостоятельно решать сложные технические задачи; делиться технической экспертизой с менее опытным коллегам; уметь работать с техническим заданием; уметь взаимодействовать с членами команды, а также с другими командами; обеспечивать полный цикл разработки – от анализа требований и проектирования до внедрения; оптимизировать и рефакторить существующие подсистемы; участвовать в ĸод ревью; участвовать в принятии техничесĸих и архитеĸтурных решениях; участвовать в планировании спринтов, оценĸе и деĸомпозиции задач. Требования к кандидату: понимание принципов построения микросервисной архитектуры, разработки высоконагруженных, масштабируемых и отказоустойчивых приложений; понимание принципов stateless-архитектуры; большой опыт создания Rest API на нагруженном проекте (для web, mobile) уверенные знания Java 11+; опыт коммерческой разработки на java от 5 лет; понимание SOLID; опыт работы с Spring Framework (Core, Boot, Security, Web, Data JPA); опыт работы и проектирования реляционных БД (Postgresql, Oracle); знание фреймворков тестирования: Junit, TestNG, Mockito; опыт работы с брокером сообщений Kafka; опыт работы с Redis; понимание CI/CD; понимание принципов работы сред контейнеризации и оркестрации (Docker, K8s, Openshift); уверенные знания Swagger; опыт работы с Git; опыт работы по Scrum.",
  "keywords" : [ ]
}, {
  "url" : "https://hh.ru/vacancy/110955437?query=java",
  "companyName" : "ООО ГК Иннотех | разработка ИТ-решений (Иннотех)",
  "textContent" : "Обязанности: Создание высоконагруженных сервисов, поддержĸа и доработĸа теĸущих; Участие в ĸод ревью; Подготовĸа релиз плана перед обновлением сервиса или первого вывода в прод; Интеграция со смежными системами REST, KAFKA; Хранение/обновление больших объемов данных, масштабирование на потребителей; Работа в тесном сотрудничестве с бизнес-аналитиками, UX/UI дизайнерами, владельцем продукта, а также с другими командами. Требования: Опыт коммерческой разработки Highload приложений на Java; Отличные знания Java Core и опыт работы со стеком Spring, в том числе SpringBoot; Использовали Git; Gradle/Maven; Опыт в построении микросервисной архитектуры; Навыки работы с очередями (Kafka, RabbitMQ, ArtemisMQ); Навыки работы с (Docker, K8s/OpenShift); Опыт работы с СУБД (PostgreSQL, Oracle); Опыт написания unit - тестов; Понимание Reactive Spring (Spring WebFlux, R2DBC, Reactive Spring Data). Будет плюсом: Есть опыт в построении высоконагруженных распределенных систем и понимание проблем многопоточной обработки данных; Есть понимание основ криптографии и практический опыт в использовании TLS; Есть опыт работы c Nexus.",
  "keywords" : [ ]
}, {
  "url" : "https://hh.ru/vacancy/112054770?query=java",
  "companyName" : "ООО ГК Иннотех | разработка ИТ-решений (Иннотех)",
  "textContent" : "Есть офис в г. Минск Трудоустройство по ТК РБ Senior Back-end Java разработчик Стрим - Цифровые документы и решения Мы разрабатываем систему с нуля на современной микросервисной архитектуре и с Agile подходом. Проекты охватывают все процессы кредитования, начиная с заявки и анализа клиента и заканчивая погашением клиентом задолженности по кредиту. На проектах мы работаем в Scrum-командах, в каждой из которых есть Product Owner, TeamLead, аналитики, Back- и Frontend разработчики, QA инженеры. Каждая команда самостоятельно решает, как развивать продукт, с учётом пожеланий пользователей. Вместе с нами ты будешь: развивать общие сервисы автоматизации кредитных процессов в целях повышения эффективности и снижения издержек за счет унификации процессов и разработки общего функционала/ Какие знания и навыки для нас важны: опыт коммерческой разработки на Java от 4-х лет; отличные знания Java SE 8+; опыт проектирования и построения микросервисных архитектур понимание микросервисной архитектуры; понимание методологии DDD, подходов и стратегий к разбиению функционала на уровне бизнес-требований на микросервисы; проектирование интеграционных взаимодействий с использованием RESTfull API; умение работать с вебсокетами, NoSQL БД, GraphQL, Redis, Kafka, SpringCloud решения опыт работы с Kafka или другими брокерами сообщений.",
  "keywords" : [ "Java", "NoSQL", "Apache Kafka", "Spring Cloud" ]
}, {
  "url" : "https://rabota.by/vacancy/108812217?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО ГеймТек",
  "textContent" : "GameTech ищет Java-разработчика для работы над проектом Design Tools. Вам предстоит присоединиться к команде, занимающейся разработкой и поддержкой десктопных графических приложений (редакторов) для создания мобильных игр на основе внутреннего фреймворка и его ресурсов. Проекту Design Tools уже 5 лет. В команде работают 6 разработчиков, 2 специалиста по качеству (QA) и проектный менеджер (PM). В настоящее время мы находимся в поиске Java-разработчика, который сможет усилить нашу команду. Что мы делаем: В настоящее время мы занимаемся разработкой и поддержкой набора графических редакторов для работы с различными типами ресурсов. В наших планах - создание универсального инструмента, аналогичного Unity, Unreal Engine или Godot. Наш продукт является внутренним, и благодаря оперативной обратной связи от гейм-дизайнеров, проект активно развивается и улучшается на глазах. Тебе точно к нам, если тебе нравится: Разрабатывать и поддерживать десктопные приложения; Вносить предложения и инициативы, применять свой богатый опыт; Решать нестандартные технические задачи; Проектировать и реализовывать архитектурные решения. Чего мы ждем от тебя: Базовые знания ООП и готовность их развивать; Желание учиться и разбираться с новыми и сложными системами; Умение работать в команде и открытость к сотрудничеству; Готовность предлагать идеи и решения на уровне задач своей компетенции. Что мы используем: Java 17, Gradle; Dear ImGui, Swing; Asana, GitLab, Grafana. Будет плюсом: Опыт разработки десктопных приложений; Базовые знания работы с многопоточными и асинхронными приложениями; Интерес к программированию графики с использованием OpenGL, Vulkan или других низкоуровневых библиотек; Знание основ скриптовых языков программирования, таких как Ruby или аналогичных. Почему у нас приятно работать? Мы вдохновляемся друг другом! Делимся опытом, обмениваемся крутыми идеями, обсуждаем их и сразу же идем реализовывать. И результаты превосходят все наши ожидания. Наш департамент заботы усиленно работает, чтобы слово «забота» звучало в компании чаще, чем вы успеете о ней подумать. В стартовый набор входит медицинское страхование, компенсация больничного, отпуск, 4 Sick days в год, компенсация спорта, а также психологическая поддержка для сотрудников. Для профессионального развития есть все необходимое: внутренние курсы английского языка, посещение профильных конференций, курсов, воркшопов и многое другое. Конечно же, это не все. Мы всегда ярко празднуем дни рождения компании, новогодние праздники, тимбилдинги, релизы и дни рождения проектов. В копилке приятных бонусов также премии за рекомендации будущих коллег, ко дню рождения и важным событиям вашей жизни. Присоединяйтесь к нам и создавайте будущее игр!",
  "keywords" : [ ]
}, {
  "url" : "https://rabota.by/vacancy/111113606?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО ГеймТек",
  "textContent" : "GameTech в поиске амбициозных Java разработчиков, желающих попасть в Gamedev. Для разработки игр для мобильных платформ (iOS, Android, Amazon) компанией разработан собственный фреймворк. Игровая логика пишется на Java. Затем Java код конвертируется в С++ код и далее компилируется для указанных платформ. Такой подход позволяет добиться высокой скорости разработки за счет того, что для тестирования игровой логики нет необходимости делать сборку для устройства, достаточно запустить desktop Java приложение. Обязанности: Разработка и оптимизация игровой логики. Разработка новой и рефакторинг текущей функциональности игры. Разработка и развитие проектного инструментария разработки (редакторы, валидаторы ресурсов, инструменты сборки). Помощь нетехническим (Гейм Дизайнеры) специалистам в решении возникающих проблем. Мы ожидаем от вас: Опыт разработки игр. Знание особенности работы движка на различных платформах. Опыт разработки на Java. Знание классических алгоритмов и структур данных(списки, графы, поиск пути и д.р.), шаблонов проектирования. Знание современных принципов программирования: SOLID, KISS. Умение писать качественный и понятный код. Самостоятельность в принятии архитектурных решений. Способность и готовность поддерживать и расширять Legacy code. Готовность быть наставником и помощником для начинающих членов команды. Приветствуется: Опыт работы с OpenGLES, Vulkan. Опыт разработки мобильных приложений (iOS, Android). Опыт разработки на Ruby. Опыт работы с другими 3D движками (Unity, Unreal Engine и т.п.). Опыт работы с различными плагинами и сервисами (Firebase, FairBid и т.д.). Почему у нас приятно работать? Мы вдохновляемся друг другом! Делимся опытом, обмениваемся крутыми идеями, обсуждаем их и сразу же идем реализовывать. И результаты превосходят все наши ожидания. Наш департамент заботы усиленно работает, чтобы слово «забота» звучало в компании чаще, чем вы успеете о ней подумать. В стартовый набор входит медицинское страхование, компенсация больничного, отпуск, 4 Sick days в год, компенсация спорта, а также психологическая поддержка для сотрудников. Для профессионального развития есть все необходимое: внутренние курсы английского языка, посещение профильных конференций, курсов, воркшопов и многое другое. Конечно же, это не все. Мы всегда ярко празднуем дни рождения компании, новогодние праздники, тимбилдинги, релизы и дни рождения проектов. В копилке приятных бонусов также премии за рекомендации будущих коллег, ко дню рождения и важным событиям вашей жизни. Присоединяйтесь к нам и создавайте будущее игр!",
  "keywords" : [ "Java" ]
}, {
  "url" : "https://rabota.by/vacancy/112709126?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО ДэвсГруп",
  "textContent" : "Уважаемый соискатель, благодарим Вас за проявленный интерес к нашей компании и приглашаем присоединиться к команде профессионалов ИНЖЕНЕРА ПО ВНЕДРЕНИЮ И СОПРОВОЖДЕНИЮ ПО. Направления деятельности компании: 1. Комплексные системы электронной очереди. 2. Инфокиоски, экраны, мультитач-экраны. 3. Решения для транспортной системы современного города. 4. Умные решения для медицинской отрасли. 5. СКУД. 6. Аудиосистемы для бизнеса. Реальный опыт в указанных направлениях приветствуется. Все наши продукты производятся с учетом пожеланий заказчика. Сейчас ДэвсГруп в поиске талантов. Рассматриваем кандидатов как с опытом, так и мотивированных учиться. Какие задачи нужно решать: Полный цикл внедрения автоматизированных информационных систем: электронная очередь, цифровые табло, вывески и т.д.; Настройка ОС, установка и настройка ПО; Техническая поддержка, устранение неисправностей, возникающих в результате эксплуатации продуктов; Техническая консультация клиентов компании по предлагаемым программно-аппаратным комплексам. От кандидата ожидаем: Уверенные знания Linux и Windows будут большим преимуществом; Опыт работы с Java приложениями; Знание работы и оптимизации POSTGRES и SQL; Знание сетевых технологий (DNS, NAT, DHCP, VPN); Понимание работы протокола TCP\\IP; Настройка сетевого оборудования; Опыт работы с системами виртуализации; Обучаемость, умение разбираться в новом; Готовность к командировкам, наличие ВУ категории В будет плюсом; Знание английского будет хорошим плюсом. Что мы предлагаем: Достойный уровень заработной платы. Хороший фиксированный оклад + оплата переработок при их наличии; Минимум раз в год Performance Review и пересмотр заработной платы; Официальное трудоустройство, отпуск 25 дней, больничные, компенсация топливных затрат (в случае использования личного авто в рабочих целях); График работы 5\\2 с периодическими командировками; Возможность обучаться, расти и развиваться внутри компании; Адекватный коллектив, комфортный офис, чай, кофе. Работа с нами это возможность получить хороший опыт в сфере IT. Для желающих профессионально расти в Компании созданы все условия. Сопроводительное письмо к вашему отклику будет большим плюсом)",
  "salary" : "от 1 700 Br на руки",
  "keywords" : [ "Linux", "Администрирование серверов Linux", "Настройка сетевых подключений", "VPN", "Базы данных", "TCP/IP", "Администрирование серверов", "Настройка ПО", "Настройка DNS", "DHCP" ],
  "address" : "Минск, улица Солтыса, 187"
}, {
  "url" : "https://rabota.by/vacancy/108172571?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Испаер Системс ЛТД",
  "textContent" : "Компания Ispirer Systems с 1999 года специализируется в двух основных областях: миграция баз данных и преобразование приложений. Мы помогаем компаниям по всему миру идти в ногу с лучшими практиками разработки программного обеспечения и хранения данных. Ищем перспективного разработчика в команду для работы над основным продуктом компании. Вам предстоит познакомиться с уникальной технологией, искать способы улучшения существующих решений и внедрять наиболее оптимальные для новых задач, стать частью команды и принять непосредственное участие в развитии продукта. Что мы ждем от кандидата: высшее ИТ/техническое образование либо также последний курс (!) технического ВУЗа знание технологий XML/XSLT навыки работы с Git знания SQL на уровне написания простых запросов (DDL, DML, запросы) опыт работы с любым языков программирования, таких как Java, C# и др. ЯП технический английский язык (чтение документации) Чем предстоит заниматься: усовершенствование существующих и разработка новых решений в продукте участие в разработке новых продуктов компании Будет преимуществом: понимание и опыт применения паттернов проектирования опыт работы с Atlassian Jira и BitBucket знание классических алгоритмов и структур данных владение SQL на начальном уровне (знание операторов языка, навыки в написании простейших запросов, хранимых процедур) Что мы хотим видеть в кандидатах: аналитический склад ума способность работать как самостоятельно, так и в команде хорошие коммуникативные способности Что мы можем предложить: - гибкий график работы; - возможность работать удаленно (после испытательного срока); - материальная помощь к датам; - медицинская страховка; - отпуск 22 рабочих дня / 3 sick days/ 2 day off. ! После первичного отбора необходимо будет выполнить небольшое тестовое задание. !! В CV должно быть подробно расписано, на каком уровне и с чем вы знакомы ( в том числе и лабораторные) *стажировка 4 недели на условиях обучения, далее при успешном прохождении - оформление в штат",
  "keywords" : [ "ООП", "Java", "Git", "СУБД", "XML", "XSLT", "XML/Xslt", "Английский — B1 — Средний", "SQL", "Python" ],
  "address" : "Минск, Каховская улица, 70А"
}, {
  "url" : "https://rabota.by/vacancy/112349366?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Каспи Софтвер",
  "textContent" : "Приглашаем талантливого Android Developer с опытом Kotlin Multiplatform присоединиться к нашей команде! Важен опыт с Kotlin Multiplatform и Swift Что нужно будет делать: • разрабатывать приложения с 0 и дорабатывать существующие приложения • продумывать архитектуру приложения • улучшать аналитику и добавлять события и A/B тесты для проверки гипотез Что мы ожидаем: • от 2 лет коммерческого опыта в качестве Android Developer • желание и умение писать чистый и аккуратный код, который легко поддерживать • знание цикла работы приложения, управления памятью • понимание паттернов проектирования и современных архитектурных подходов • опыт работы с Git • опыт разработки клиент-серверных приложений • технический английский • умение самостоятельно находить ответы на вопросы Что мы предлагаем: • возможность удаленной работы из любой локации и гибкое начало рабочего дня (c 09:00 до 11:00 по GMT+3) • работу над интересными проектами и возможность улучшить свои скилы • дружная команда единомышленников • лояльное и понимающее руководство с фокусом на качестве и результате • испытательный срок 3 месяца (может быть завершен досрочно) • формат: фулл-тайм",
  "keywords" : [ "Java", "Coroutines", "Git", "Kotlin Multiplatform", "MVVM", "Fragments and ViewModels", "Clean Architecture", "MVP", "Swift", "Android", "Kotlin" ]
}, {
  "url" : "https://rabota.by/vacancy/112163402?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Клеркгрупп",
  "textContent" : "Находимся в поиске Site Reliability Engineer в связи с необходимостью выстраивания SRE процессов для продукта. Продукт представляет собой софт для автоматизации работы консультантов первой линии поддержки онлайн площадок, от пользовательского виджета на клиенте до бекофиса на рабочем месте оператора. Задачи: Улучшать систему и процессы мониторинга, повышать Observability системы; Проектировать, внедрять и поддерживать метрики для мониторинга; Улучшать процессы инцидент-менеджмента; Участвовать в устранении сбоев и расследовании их причин; Поддерживать бесперебойную работу сервисов; Договариваться с коллегами и находить лучшие решения для проекта. Требования: Умеешь в Linux на уровне системного администратора; Уверенно владеете одним из языков программирования: Go, C#, Python, Java и другие; Понимание принципов работы сетей и протоколов взаимодействия приложений, навыки диагностики проблем с ними; Работали с системами контроля версий Git; Работали с системами мониторинга и алертинга Prometheus и Grafana, агрегаторами логов; Работали с системами контейнеризации и оркестрации Docker и k8s; Высокий уровень самостоятельности. Мы предлагаем: Оформление по ТК Республики Беларусь; Стабильную официальную заработную плату; Комфортный, современный офис в Минске либо удаленное сотрудничество; Расширенный социальный пакет.",
  "keywords" : [ "Git", "Linux", "Docker", "Prometheus", "Grafana" ]
}, {
  "url" : "https://rabota.by/vacancy/111519252?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Косвик",
  "textContent" : "Паркетная фабрика «Косвик» приглашает на работу Full Stack разработчика Чем предстоит заниматься: поддержка и рефакторинг существующих проектов; разработка новых функций и продуктов, интегрирование их со сторонними сервисами. Необходимые знания и опыт: опыт Full Stack разработки от 3-х лет; уверенные знания: HTML, CSS, PHP (Laravel Framework), JavaScript (Vue js, React); знание MS SQL, PostgreSQL, MySQL (построение и оптимизация сложных запросов); знание и умение применять SOLID принципы; понимание разработки API; опыт работы с веб-сервером Nginx / Apache. МЫ ПРЕДЛАГАЕМ: Стабильная заработная плата: выплачивается своевременно, два раза в месяц на банковскую карточку; График работы: 5/2, выходной - суббота, воскресенье; Оплата проезда: мы заботимся о вашем комфорте на пути на работу и обратно; Оплата питания: 75% стоимости оплачивает предприятие – всегда горячая и вкусная еда; Полный социальный пакет: скидки на продукцию компании, подарки и премии к значимым событиям; Медицинское страхование: мы заботимся о здоровье наших сотрудников; Отличные условия труда: современный офис, удобное рабочее место, чай/кофе; Занятия спортом: волейбол, бассейн, теннис; Скидки на отдых с семьей в нашем Загородном комплексе; Активная корпоративная жизнь. ПОЧЕМУ КОСВИК? Стабильность и уверенность: у нас вы найдете надежную работу и стабильный доход. Развитие и рост: мы поддерживаем ваше профессиональное развитие и предлагаем обучение. Теплая атмосфера: наша Компания – это команда, где каждый сотрудник важен и ценен. Если вы хотите стать частью большой и дружной команды Косвик, звоните нам! Мы с радостью ответим на все ваши вопросы и расскажем больше о вакансии.",
  "keywords" : [ "Nginx", "Vue.js", "CSS", "MySQL", "Java Script", "PHP", "API", "HTML", "Apache", "SOLID", "Laravel", "React" ],
  "address" : "г. Заславль, ул. Я. Коласа 2Б"
}, {
  "url" : "https://rabota.by/vacancy/110639696?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Марк Формэль. Офис",
  "textContent" : "Приглашаем в команду профессионалов Опытного руководителя IT подразделения/ IT директор. Обязанности: Обеспечение эффективности всех информационно-технологических процессов компании; Определение и реализация стратегии развития IT с учётом требований бизнеса; Руководство персоналом - подбор и расстановка кадров, постановка задач, контроль исполнения; Разработка плана мероприятий по автоматизации производства, розницы, онлайн; Бюджетирование и контроль за соблюдением бюджета; Обеспечение полного цикла разработки продуктов компании (анализ, оценка, проектирование, разработка, тестирование, сдача в коммерческую эксплуатацию, поддержка); Управление несколькими продуктами в стадии реализации; Ответственность за информационную безопасность; Сопровождение IT проектов (собственных и внешних), интеграционных проектов, проектов автоматизации, проектов по большим данным; обеспечение стабильной и бесперебойной работы IT-систем, компьютерного и сетевого оборудования, поддержки пользователей; эффективное взаимодействие с подрядчиками и с внутренними заказчиками. Требования: высшее образование, желательно техническое; знание процессов розничной и оптовой торговли, в т.ч. маркетплейсов; стаж работы от 3 лет на должности IT-директора в крупной успешной и структурированной компании, желательно сферы розничной торговли/электронной коммерции; знание современных методик и практик IT-деятельности; знание современных технологий и архитектур; опыт автоматизации процессов; опыт управления крупными IT-проектами, проектами по большим данным, e-commerce, web-разработками; опыт работы с java, 1С и Битрикс; знание любой из конфигураций 1С УХ, ERP, УПП, УТ, Бухгалтерия; системное мышление, широкий профессиональный кругозор; стрессоустойчивость, работоспособность, сильные управленческие навыки; хорошие коммуникативные навыки и умение эффективно взаимодействовать в команде. Условия: Оформление в соответствии с ТК РБ, социальные гарантии Современный офис в г. Заславль Достойная оплата труда (оклад+премия)",
  "salary" : "от 12 000 Br на руки",
  "keywords" : [ "Управление персоналом", "Руководство коллективом", "Системное мышление", "Java", "1С-Битрикс", "Бюджетирование", "Управление проектами", "web-разработки" ]
}, {
  "url" : "https://rabota.by/vacancy/111113235?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Модульные строительные системы",
  "textContent" : "Компания \"CUBY Technologies\" занимается реализацией инвестиционного проекта, связанного с выпуском оборудования и комплектующих для модульного строительства быстровозводимых домов. В данный момент наша команда проектирует платформу, объединяющую ряд сервисов, которая автоматизирует сложные механизмы строительства и пользования недвижимостью. На первом этапе мы проектируем сложную нагруженную систему, которая позволит нашим заводам максимально автоматизировать процесс производства деталей для модульных домов - и координирует методологию их сборки. Конечная цель - это сервис для неквалифицированных рабочих с автоматической системой выдачи задач в процессе цикла производства и сборки здания. Наш продукт - это завод, который можно развернуть в любой точке мира. Кого мы ищем: Наша команда находится в поиске на постоянную основу в офис Middle Backend-разработчика Обязанности: Разработка серверных приложений; Проектирование и разработка баз данных; Обеспечение безопасности данных; Интеграция сторонних сервисов; Соблюдение сроков и управление проектами; Соблюдение стандартов; Масштабирование приложений. Стек технологий: Spring WebFlux, Keycloak, MongoDB, Java 8+, Docker, Project Reactor Условия: Официальное трудоустройство; Возможность принять участие в проекте, который формирует новые правила и законы строительства модульных домов на рынке США и Европы; Создание комфортных условий для развития знаний и навыков; Высокий уровень дохода, соразмерный профессионализму кандидата.",
  "keywords" : [ "java 8+,", "Project Reactor", "Docker", "Spring WebFlux", "MongoDB", "Keycloak" ],
  "address" : "Минск, улица Солтыса, 187"
}, {
  "url" : "https://rabota.by/vacancy/108607683?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО НитСофт",
  "textContent" : "NeatSoft - IT-компания, специализирующаяся на разработке веб- и мобильных приложений с 2016 года. Мы работаем с клиентами из различных стран мира и успешно реализовали проекты в странах СНГ и Западной Европы. Наши проекты включают как продуктовую разработку (например, logtime.me и mybase.pro), так и аутсорсинг разработки. Работаем с такими технологиями как: Angular; React; VueJS; NodeJS; NestJS; Yii2; Laravel; DevOps Tools; Flutter, Java. Мы находимся в постоянном развитии и ищем 1С Программиста в нашу дружную команду. Обязанности: Поддержка действующих механизмов в 1С. Интеграция с различными информационными системами, в т.ч. с использованием брокера сообщений Rabbit MQ. Оперативное решение проблем, инцидентов, связанных с функционированием системы. Создание и поддержка документации по работе с программным обеспечением 1С, включая инструкции пользователям и рекомендации по настройке. Оптимизация существующих решений, повышение производительности. Разработка и внедрение нового функционала на платформе 1С. Требования: Высшее образование; Опыт работы от 1 года; Опыт разработки конфигураций с нуля; Умение писать чистый, аккуратный, документированный код; Опыт работы с конфигурациями с большим объемом данных; Знание языка запросов 1С, БСП, основных механизмов 1С; Опыт интеграции 1С со сторонними сервисами (XML / JSON, SOAP / - REST, HTTP / WS). Будет плюсом: Навыки интеграции с использованием брокера сообщений Rabbit MQ; Опыт работы в финтех компаниях. Английский язык уровня B1 и выше. Ценные для нас навыки: Хорошо развитые коммуникативные и аналитические способности. Умение работать в команде и брать на себя ответственность. Мы предлагаем: Дружественную и уютную атмосферу, удобное расположение офиса. Комфортное рабочее место с чаем, кофе и печеньем, пицца вторниками. Нескучные задачи без бюрократии и формализма. Заработную плату, привязанную к курсу USD. Гибкий график работы с плавающим началом рабочего дня. Бонусы и премии по результатам работы и значимым событиям. Если вы заинтересованы в этой вакансии и соответствуете указанным требованиям, мы будем рады видеть вас в нашей команде!",
  "keywords" : [ "1С программирование", "1С: Предприятие", "Английский язык" ],
  "address" : "Минск, Грушевка, Михалово, Петровщина, улица Карла Либкнехта, 66"
}, {
  "url" : "https://rabota.by/vacancy/110792759?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО НитСофт",
  "textContent" : "NeatSoft - IT-компания, специализирующаяся на разработке веб- и мобильных приложений с 2016 года. Мы работаем с клиентами из различных стран мира и успешно реализовали проекты в странах СНГ и Западной Европы. Наши проекты включают как продуктовую разработку (например, logtime.me и mybase.pro), так и аутсорсинг разработки. Работаем с такими технологиями как: Angular; React; VueJS; NodeJS; NestJS; Yii2; Laravel; DevOps Tools; Flutter, Java. Мы находимся в постоянном развитии и ищем PHP-разработчика в нашу дружную команду. Ценные для нас навыки: Знания Yii2 или Laravel; Опыт работы с MongoDb, Mysql, PostgreSql; Опыт работы с Docker; Хорошее владение Linux; Умение работать с системами контроля версий Git; Понимание архитектуры REST. Если ты дочитал досюда и знаком с вышеупомянутыми навыками – ты нам подходишь, и мы готовы предложить: Дружественную уютную атмосферу, удобное расположение; Комфортное рабочее место (чай, кофе, печеньки); Нескучные задачи без бюрократии и формализма (мы за свободу действий  и мышления); Заработную плату, привязанную к курсу USD; Гибкий график работы с плавающим началом рабочего дня (основные часы работы команды с 10:00 до 18:00); Бонусы и премии по результатам работы и значимым событиям (рождение детей, свадьба).",
  "keywords" : [ "PostgreSQL", "Laravel", "SQL", "REST API", "Backend", "Git", "Yii2", "Docker", "Linux", "Web", "MySQL", "PHP", "MongoDB" ],
  "address" : "Минск, Грушевка, Михалово, Петровщина, улица Карла Либкнехта, 66"
}, {
  "url" : "https://rabota.by/vacancy/110894184?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО НитСофт",
  "textContent" : "NeatSoft - IT-компания, специализирующаяся на разработке веб- и мобильных приложений с 2016 года. Мы работаем с клиентами из различных стран мира и успешно реализовали проекты в странах СНГ и Западной Европы. Наши проекты включают как продуктовую разработку (например, logtime.me и mybase.pro), так и аутсорсинг разработки. Работаем с такими технологиями как: Angular; React; VueJS; NodeJS; NestJS; Yii2; Laravel; DevOps Tools; Flutter, Java. Мы находимся в постоянном развитии и ищем .NET разработчика в нашу друную команду. Что мы ожидаем: Хорошее знание основ платформы .NET. Знание SQL, базовый опыт работы с реляционной базой данных. (например: MS SQL Server, PostgreSQL и так далее). Понимание и умение использовать шаблонов проектирования и архитектурных паттернов. Умение работать с системой контроля версий (Git). Понимание архитектуры микросервисов. Будет Плюсом: Опыт работы коммерческой разработки под .Net от 1 года. Опыт работы с JS Frameworks (e.g. Angular, Vue, React). Опыт работы с высоконагруженными системами, решение вопросов производительности, стабильности и надежности. Опыт в написании unit и integration тестов. Ценные для нас навыки: Хорошо развитые коммуникативные и аналитические способности. Умение работать в команде и брать на себя ответственность. Английский язык уровня B2 и выше. Мы предлагаем: Дружественную и уютную атмосферу, удобное расположение офиса. Комфортное рабочее место с чаем, кофе и печеньем. Нескучные задачи без бюрократии и формализма. Заработную плату, привязанную к курсу USD. Гибкий график работы с плавающим началом рабочего дня. Бонусы и премии по результатам работы и значимым событиям. Если вы заинтересованы в этой вакансии и соответствуете указанным требованиям, мы будем рады видеть вас в нашей команде!",
  "keywords" : [ "RabbitMQ", "English", "MS SQL", "Git", "Docker", ".NET", "SOLID", "MSMQ", "Kubernetes", ".NET Core" ],
  "address" : "Минск, Грушевка, Михалово, Петровщина, улица Карла Либкнехта, 66"
}, {
  "url" : "https://rabota.by/vacancy/111217973?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО НитСофт",
  "textContent" : "NeatSoft - IT-компания, специализирующаяся на разработке веб- и мобильных приложений с 2016 года. Мы работаем с клиентами из различных стран мира и успешно реализовали проекты в странах СНГ и Западной Европы. Наши проекты включают как продуктовую разработку (например, logtime.me и mybase.pro), так и аутсорсинг разработки. Работаем с такими технологиями как: Angular; React; VueJS; NodeJS; NestJS; Yii2; Laravel; DevOps Tools; Flutter, Java. Мы находимся в постоянном развитии и ищем GoLang Developer в нашу дружную команду. Что мы ожидаем: Знание и опыт разработки на GoLang. Уверенное владение языком программирования Go. Опыт работы с фреймворками и библиотеками GoLang. Понимание основ асинхронного программирования и многопоточности. Опыт работы с системами контроля версий, такими как Git. Желание учиться и развиваться в области GoLang-разработки. Будет плюсом: Опыт коммерческой разработки на GoLang от 1 года. Знание и опыт работы с сетевыми протоколами и веб-серверами на основе GoLang. Опыт работы с базами данных, включая SQL и NoSQL. Знание и опыт работы с JSON/XML. Умение работать с REST API и другими веб-сервисами. Ценные для нас навыки: Хорошо развитые коммуникативные и аналитические способности. Умение работать в команде и брать на себя ответственность. Английский язык уровня B1 и выше. Мы предлагаем: Дружественную и уютную атмосферу, удобное расположение офиса. Комфортное рабочее место с чаем, кофе и печеньем. Нескучные задачи без бюрократии и формализма. Заработную плату, привязанную к курсу USD. Гибкий график работы с плавающим началом рабочего дня. Бонусы и премии по результатам работы и значимым событиям. Если вы заинтересованы в этой вакансии и соответствуете указанным требованиям, мы будем рады видеть вас в нашей команде!",
  "keywords" : [ "Git", "Go", "GoLand", "Английский — B1 — Средний", "Английский язык" ],
  "address" : "Минск, Грушевка, Михалово, Петровщина, улица Карла Либкнехта, 66"
}, {
  "url" : "https://rabota.by/vacancy/112155076?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО НитСофт",
  "textContent" : "NeatSoft - IT-компания, специализирующаяся на разработке веб- и мобильных приложений с 2016 года. Мы работаем с клиентами из различных стран мира и успешно реализовали проекты в странах СНГ и Западной Европы. Наши проекты включают как продуктовую разработку (например, logtime.me и mybase.pro), так и аутсорсинг разработки. Работаем с такими технологиями как: Angular; React; VueJS; NodeJS; NestJS; Yii2; Laravel; DevOps Tools; Flutter, Java, Python. Мы находимся в постоянном развитии и ищем Node.js developer для нашей команды. Что мы ожидаем: Отличное знание Node.js, понимание масштабирования и узких мест Отличное знание TypeScript Опыт работы с БД (SQL, noSQL) Умение писать unit-тесты (Jest) Знание принципов построения надежной архитектуры и паттернов проектирования Опыт работы по Scrum Будет плюсом: Опыт коммерческой разработки на Node.js от 1 года. Знание и опыт работы с Angular/React. Понимание принципов построения SPA. Опыт работы с GraphQL. Опыт работы с WebSocket. Ценные для нас навыки: Хорошо развитые коммуникативные и аналитические способности. Умение работать в команде (предлагать и обсуждать идеи, аргументировать свою позицию, слушать и понимать людей, договариваться). Английский язык уровня B2 и выше. Мы предлагаем: Дружественную и уютную атмосферу, удобное расположение офиса. Комфортное рабочее место с чаем, кофе и печеньем. Нескучные задачи без бюрократии и формализма. Заработную плату, привязанную к курсу USD. Гибкий график работы с плавающим началом рабочего дня. Бонусы и премии по результатам работы и значимым событиям. Если вы заинтересованы в этой вакансии и соответствуете указанным требованиям, мы будем рады видеть вас в нашей команде!",
  "keywords" : [ "TypeScript", "Backend", "Unit Testing", "PostgreSQL", "MySQL", "Node.js", "Scrum", "Английский — B1 — Средний", "SQL", "Английский язык" ],
  "address" : "Минск, Грушевка, Михалово, Петровщина, улица Карла Либкнехта, 66"
}, {
  "url" : "https://rabota.by/vacancy/112510299?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО ПлатформИО / ULTRALAB",
  "textContent" : "О нас: Platform.io - это продукт для рекламных сетей, позволяющий быстро выводить на рынок новые форматы рекламы. В 2018 на нем мы запустили сеть, позволяющую разместить рекламу в push-уведомлениях. В 2020 мы превратили ее в мультиформатную рекламную сеть. Наш фокус - нестандартные (инновационные рекламные каналы, основной из которых - пуш-уведомления. Сегодня мы в топе сетей по охвату аудитории в пушах. Мы помогаем: Рекламодателям - получать новых клиентов, эффективно расходуя рекламный бюджет. Площадкам - максимизировать прибыль со своего контента. Сегодня мы хотим усилить нашу команду Аналитиком-разработчиком, который любит тщательно исследовать данные, искать подводные камни пользовательских процессов и находить оптимальные решения любых проблем. Ожидаем от вас: Опыт работы на схожих позициях от 2-х лет. Уверенный математический фундамент (алгебра, статистика, теория вероятностей). Python, MySQL или опыт с любой другой реляционной БД), Druid/ClickHouse (или опыт с любой другой БД колоночного типа для больших объемов данных). Знание основных алгоритмов и метрик ML. Аналитик-разработчик / Data Analyst2Опыт работы с Airflow (или любым другим сервисом оркестровки). Опыт работы с BI системами (Apache Superset, Redash, Power BI в приоритете). Английский язык B1 нужен для понимания статей, чтения документации, общения со стейкхолдерами задач). Готовность к постоянному совершенствованию навыков, обучению. Будет плюсом: Опыт работы на схожих позициях в digital marketing сфере. Основы Java. Опыт работы с Data Warehouses и Data Lakes любого типа. Обязанности: Поиск закономерностей и точек роста бизнеса в данных. Формулирование и проверка продуктовых гипотез. Настройка ETL пайпланов. Выбор, внедрение и мониторинг метрик бизнеса. Выбор, обучение, тестирование и поддержка моделей оптимизации рекламных метрик Что мы предлагаем: Работайте удаленно из дома, из офиса в Минске; Мы компенсируем занятия спортом, медицинское обслуживание, языковые курсы, персональное развитие(курсы/митапы);",
  "keywords" : [ "PostgreSQL", "MySQL", "Clickhouse", "Python", "SQL" ]
}, {
  "url" : "https://rabota.by/vacancy/110681061?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Сампад",
  "textContent" : "ООО \"Сампад\" в связи с расширением приглашает в свою команду Системного Аналитика, которому интересно развиваться в направлении менторства/обучения менее опытных аналитиков. Несколько слов о нас: Сампад - это команда талантливых профессионалов в сфере разработки, тестирования и сервисной поддержки программных продуктов. С 2013 года мы успешно реализовали более 250 проектов для рынков США и Западной Европы, а также стран СНГ. Среди наших клиентов – стартапы и крупные международные компании из финансовой и страховой сфер, здравоохранения, туризма, ритейла, образования и т.д. Основные технологические направления - Python, Java, .Net, iOS, Android. Мы предлагаем: Позицию системного аналитика, который будет работать на коммерческом проекте крупных заказчиков, а также заниматься обучением менее опытных системных аналитиков в рамках нашей лаборатории. Проект 1: Платформа для продажи телекоммуникационного оборудования, которая имеет развернутый каталог с более чем 20 тыс. товаров, а также с возможностью заказать и оплатить товар. Проект 2: Проект направлен на расширение функциональности коробочного CRM решения, его адаптацию под нужды пользователей и интеграция с внутренним ПО компании и обеспечение консистентности данных при их миграции в/из CRM системы. Чего мы ждем от специалиста? Коммерческий опыт работы Системным аналитиком от 3-х лет; Наличие высшего образования; Наличие крепкой теоретической базы по системному анализу; Наличие опыта или интереса к менторству; Навык формирования базы знаний; Навык проведения собеседований; Навык проведения презентаций; Развитые лидерские качества; Грамотная речь; Самостоятельность и ответственность. В рамках проектной работы важно иметь: Опыт работы с требованиями (сбор, анализ, документирование и коммуникация требований); Понимание принципов работы с СУБД, опыт работы с SQL-запросами средней и повышенной сложности; Опыт постановки задач разработчикам программного обеспечения и контроль их исполнения; Опыт работы с брокерами сообщений (Kafka, Rabbit MQ); Понимание принципов ООП; Понимание и опыт работы с различными видами интеграций и информационных систем; Подготовка прототипов экранных форм; Опыт работы с BPMN и UML-схемами; Опыт использования различных методологий ведения проектов; Уверенное владение JIRA/Confluence Своим сотрудникам мы предоставляем: Современные проекты в сферах Fintech, Healthcare, Education, где есть возможность реализовать свой потенциал и поучаствовать в создании центра компетенций; Ежегодное профессиональное ревью с выявлением сильных и слабых сторон и разработкой плана профессионального развития; Сплоченное SA-коммьюнити; Конкурентная заработная плата; Атмосферу взаимоуважения и доверия, стимулирующую личное развитие, и помощь в реализации новых идей; Индивидуальный план развития и регулярные performance review; Новый комфортный офис с оборудованной кухней, велопарковкой, душем и лаунж-зоной в самом центре Минска по адресу Интернациональная 20А (8 минут пешком от станций Октябрьская, Немига и Купаловская); Гибкий и удобный режим работы в офисе или удаленно; Регулярные внутренние митапы и knowledge sharing внутри компании; Материальная поддержка и оплачиваемые выходные в дни значимых событий (свадьба, рождение ребенка и т.п.); Денежные бонусы за рекомендации специалистов в рамках реферальной программы; Корпоративное обучение английскому языку; 25 календарных дней отпуска; Отсутствие бюрократии и микроменеджмента. Заинтересовало? Тогда откликайся! Будем рады рассказать больше о компании на встрече с нами!",
  "keywords" : [ "RabbitMQ", "ООП", "BPMN", "Системный анализ", "СУБД", "UML", "Atlassian Jira", "Apache Kafka", "Системная интеграция", "Atlassian Confluence", "SQL" ]
}, {
  "url" : "https://rabota.by/vacancy/112350852?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Сампад",
  "textContent" : "We’re hiring a Java Developer to join our growing team! Project: Work on a cutting-edge American aviation project that makes a real impact. The project aims to improve aircraft uptime in the aviation industry by implementing a technology platform for managing maintenance and manuals. The platform provides real-time visibility of maintenance, operations, and regulatory data, an intuitive interface, and an intelligent database that leverages AI and machine learning. The project will involve integrating the platform into existing aviation systems and training personnel on its use. The expected outcome is an increase in aircraft uptime, reduced waiting times, improved efficiency, and reduced costs. What we’re looking for: Commercial development experience: 3+ years; Proficiency in Java 11 and Spring Boot; Experience with SQL Server or MariaDB (preferred), or other relational databases; Familiarity with Continuous Integration tools (e.g., Jenkins, Hudson); Understanding of OOP principles, design patterns, SOLID, and DRY principles; Proficient with Maven or Gradle, and Git; Solid understanding of the REST approach and hands-on experience with RESTful APIs; Experience with cloud platforms like AWS or Azure; Proficiency in working with Kubernetes (k8s); Experience in writing unit tests; English level B2 or above. Additional skills: Proficiency with JPA/Hibernate; Experience working with NoSQL databases; Familiarity with Apache Solr or Elasticsearch. We offer: Remote work or work in an office center of Minsk at Internatsionalnaya 20A; Work in a friendly and professional team with reasonable management; Internal meetups for our employees and knowledge sharing within the company; 25 days paid vacation. Working hours shifted closer to the USA working day (start working day approx at 10-11 am GMT+2). We'll be happy to tell you more about the company when you meet with us! We review resumes for up to 14 days. If you have not been contacted after 14 days, it means that you are not suitable for the vacancy at this time. However, you are always welcome to respond to our new offers, as there may be a vacancy that is perfect for you at any time!",
  "keywords" : [ "Java", "Azure", "k8s", "Spring Framework", "MariaDB", "SQL Server", "AWS", "Kubernetes", "Английский язык" ]
}, {
  "url" : "https://rabota.by/vacancy/110914687?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО Три Фаундэйшн",
  "textContent" : "We are searching for a brand new gamedev startup that will focus on publishing midcore & hardcore games for mobile. This is a great chance to join while the core team is being formed! You'll be responsible for making strategic decisions, building a team from scratch, and being at the forefront of a company! The company was founded by seasoned entrepreneurs with a proven track record of building successful businesses in the gamedev industry over the last 12 years. What will help you stand out: • 8+ years of experience, with a significant amount of it in building multiplayer online games off which at least 3 years of experience as Lead Developer, Head of Development, or CTO in a gaming company • Extensive experience in the development and deployment of online games, including expertise in network architecture, server-side programming, and player engagement strategies • Experience with cloud computing, DevOps, cybersecurity, and game engines (e.g., Unity, Unreal Engine) • Experience working with Amazon Gamelift, Google Firebase and / or Microsoft Playfab • Strong technical expertise and previous hands-on experience as a software engineer, preferably in large mobile products (iOS/Android native, C++/C#/Java/Scala) • English fluent. If joining a brand new studio and shaping its future sounds like the right challenge for you, we would love to hear from you!",
  "keywords" : [ "C#", "DevOps", "Amazon Gamelift", "C++", "Unreal Engine", "Unity", "mobile products", "Google Firebase" ]
}, {
  "url" : "https://rabota.by/vacancy/111590932?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО УайтСнейк",
  "textContent" : "WhiteSnake — активно развивающаяся IT-компания, специализирующаяся на разработке веб-приложений и IT-консалтинге. Мы фокусируемся на развитии в областях Python Backend разработки и Data Science Наш опыт в сочетании с простым и качественным кодом помогает нам реализовывать по-настоящему крутые и глобальные проекты для наших партнёров Мы ищем опытного AQA Engineer в нашу дружную команду Что для нас важно: Знание языка программирования Python Коммерческий опыт создания веб-приложений с использованием Python-фреймворка (Pytest/Selenium/WebDriver/Behave/Appium/Robot) от 1 года. Четкое понимание жизненного цикла проекта и места QA в этом цикле Опыт работы с CI\\CD системами Опыт ведения проектов с различными методологиями разработки ПО (SCRUM, Kanban) Опыт работы с SQL, NoSQL базами данных Опыт тестирования API Понимание принципов работы клиент-серверной архитектуры Опыт работы с VCS Уровень владения английским языком B1 и выше Будет плюсом: Знание других языков программирования (Java, JavaScript и др.) Опыт работы с тестированием мобильных приложений Навыки определения области покрытия тестирования и оценки качества тестового набора Опыт наставничества и обучения других членов команды Опыт работы со скриптовыми языками (powershell, bash) Условия работы и бонусы: Просторный офис А класса в нескольких шагах от метро Оформление по ТК РБ Уютная кухня, где Вас ждут свежие фрукты, чай, кофе, печенье и перекусы Широкий спектр бенефитов, включая частичную компенсацию расходов на спорт, транспорт и медицину Защищённая от инфляции заработная плата Оплачиваемые больничные согласно ТК РБ Молодой и дружный коллектив, где ценятся инновации и совместная работа Гибкий рабочий график, который поможет сохранить баланс между работой и личной жизнью Возможность изучать английский язык с нашим штатным преподавателем",
  "keywords" : [ "QA", "Тестирование API", "Pytest", "CI/CD", "Selenium IDE", "Автоматизированное тестирование", "Английский язык", "Python", "SQL" ],
  "address" : "Минск, проспект Дзержинского, 104"
}, {
  "url" : "https://rabota.by/vacancy/112368128?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО ФП-ТРЭЙД",
  "textContent" : "Мы ищем Lead/Senior Java разработчика. Занимаемся разработкой проектов на аутсорсе и развитием собственных продуктов. Обязанности: Анализ требований, проектирование решений совместно с командой. Разработка новой функциональности бэк части программных продуктов. Участие в построении архитектуры проектов в части бэкенд. Требования: Иметь реальный опыт разработки коммерческих продуктов с использованием Jаva от 5 лет. Глубокие знания и профессиональное владение технологиями Java. Знание и уверенное применение ООП, опыт в работе с веб-сервисами (SOAP, Rest). Опыт реализации интеграций с внешними системами через WEB сервисы и REST/SOAP API. Опыт работы с фреймворками. Опыт работы с системами контроля версий. Опыт работы с Jira, Conﬂuence, YouTrack. Создание и поддержание внутренней технической документации в актуальном состоянии. Опыт декомпозиции задач, определения трудоемкости и сроков разработки. Мы ожидаем: Нацеленность на реализацию качественных решений. Готовность взять на себя ответственность за техническую реализацию. Обладание системным мышлением, аналитическим складом ума и способность увидеть «систему», разложив её на составляющие, упорядочить их и увидеть взаимосвязи. Условия: Гибридный график работы. 4 sick days в год без справок. Отпуск 25 календарных дней. Гибкое начало рабочего для Мы ждем Ваших откликов:)",
  "keywords" : [ "Java", "Git", "Scrum", "Разработка ПО" ]
}, {
  "url" : "https://rabota.by/vacancy/112551270?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "ООО ФП-ТРЭЙД",
  "textContent" : "Мы в поисках Senior Frontend Developer: ищем коллегу с 5+ лет опыта разработки. Чем предстоит заниматься: Анализ требований, проектирование решений совместно с командой. Построение архитектуры проектов в части фронтенд, декомпозиция тасок, написание кода. Подготовка необходимой технической документации. Организация процесса сборки приложений. Что мы от Вас ждем: Коммерческий опыт разработки на Java Script/React от 5 лет. Знания и опыт в верстке HTML/CSS /SCSS. Понимание HTTP-протокола (авторизация, сессии, Cookie и т. д.) Опыт использования REST API. Опыт работы с Git. Опыт pull request и code review. Опыт работы в команде с бэкенд разработчиками, бизнес-аналитиками и QA. Понимание принципов методологии Agile и ее фреймворков: Scrum, Kanban. Будет плюсом: Опыт работы с Redux, Redux-Thunk, Reselect,toolkit, react-hook-form. Понимание и опыт работы с Jest, React-Testing-Library. Опыт проектирования REST API для взаимодействия фронта и бэка. Опыт построения эффективного процесса CI/CD. Понимание/опыт реализации проектов с микросервисной архитектурой. Опыт работы с законченными высоконагруженными продуктами. Условия: Зарплата по итогам собеседования. 4 sick days в год. Гибридный график работы. Ждем ваших резюме!",
  "keywords" : [ "REST API", "CSS", "Git", "Redux", "SCSS", "JavaScript", "HTML" ]
}, {
  "url" : "https://rabota.by/vacancy/110000094?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Программные решения плюс",
  "textContent" : "Компания приглашает мотивированных разработчиков, готовых решать серьезные задачи и разрабатывать системы с использованием современных технологий. Локация: Минск. Мы ожидаем от вас: Хороший уровень знаний JavaEE, глубокое понимание принципов ООП; Профильное образование (IT / технический); Аналитические способности, умение работать в команде, ответственность; Плюсом будет: Знание Spring Framework, Spring MVC, Spring Boot; Мы предлагаем: Доброжелательный коллектив, офис в современном бизнес-центре столицы; Интересные долгосрочные проекты, современный стек технологий; Возможность приобрести опыт работы с командой профессионалов, в течение 20-ти лет занимающихся созданием высоконагруженных систем; Офисный формат работы; Достойную заработную плату по результатам собеседования;",
  "keywords" : [ "Java EE", "ООП", "Spring Framework", "Английский — B2 — Средне-продвинутый" ],
  "address" : "Минск, Институт Культуры, улица Казинца, 11А"
}, {
  "url" : "https://rabota.by/vacancy/108753685?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "СИСТЕМНЫЕ ТЕХНОЛОГИИ",
  "textContent" : "Приглашаем в нашу команду рекрутера для привлечения IT-специалистов (PM, BA, UX/UI дизайнеры, QA Engineer, DevOps, разработчики: iOS, Android, Flutter, .Net, Java, С++, Frontend, Fullstack). Чем предстоит заниматься: Организовывать полный цикл поиска и подбора специалистов (от сбора требований по заявке на подбор до выхода специалиста на работу). Также включая оценку Soft Skills и формирование развернутых фидбеков по кандидатам (рекомендации для руководителей и обозначение возможных рисков). Выстраивать отношения с нанимающими менеджерами, обеспечивать прозрачность поиска и подбора. Курировать процесс адаптации новых сотрудников. Проводить Exit-интервью. Участвовать в оптимизации существующих процессов. Какие навыки пригодятся: Опыт работы ИТ-рекрутером от 1 года. Опыт оценки Soft Skills с формированием фидбека по кандидатам. Самостоятельность в организации процесса найма и адаптации сотрудников в компании. Умение мыслить в долгосрочной перспективе (быть нацеленным не только на фактическое закрытие вакансии, но и на долгосрочное сотрудничество специалиста с компанией). Хорошие коммуникативные навыки для взаимодействия с другими сотрудниками. Умение взаимодействовать с руководителями управлений. Умение аргументированно отстаивать свою точку зрения, предвидеть возможные риски и информировать заинтересованных лиц. Знание английского языка будет плюсом. Что вам даст работа в нашей компании? Работа в большой ИТ компании с грамотно выстроенными процессами, которые дают прозрачность работы. Сплоченный коллектив, который уже на протяжении нескольких лет работает над сложными задачами. На время адаптационного периода у вас будет ментор, который поможет вам быстро адаптироваться в задачах, команде и проекте. Расширенный социальный пакет, о котором мы расскажем вам на встрече :)",
  "keywords" : [ "Проведение собеседований", "Exit Interviews", "Подбор персонала", "Адаптация", "Рекрутинг", "Сорсинг", "Interviews" ],
  "address" : "Минск, улица Академика Купревича, 3"
}, {
  "url" : "https://rabota.by/vacancy/109616004?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "СИСТЕМНЫЕ ТЕХНОЛОГИИ",
  "textContent" : "Приглашаем в нашу команду Java разработчика для работы над проектами в сфере FinTech. Вас ожидает: Разработка и модернизация архитектуры, выбор, обоснование и согласование ключевых решений. Проектирование и модернизация ИТ-решений на базе микросервисной архитектуры. Проектирование и модернизация модели данных и структуры БД. Декомпозиция общей архитектуры до уровня отдельных компонентов, обоснование выбора решения задачи. Оценка сроков реализации задач. Проектирование форматов и интерфейсов взаимодействия со смежными системами и между компонентами системы. Какие навыки пригодятся? Опыт коммерческой разработки от 2 лет. Опыт работы с микросервисами. Опыт работы со Spring Framework (Core/AOP/REST/MVC/Data/Security). Опыт работы с базами данных (PostgreSQL, MongoDB и др.). Знание современных шаблонов проектирования и успешный опыт их применения. Глубокое понимание языка программирования Java. Понимание принципов SOLID. Будет плюсом: Опыт работы с Docker, Kubernetes. Что вам даст работа в нашей компании? Работа в большой ИТ компании с грамотно выстроенными процессами, которые дают прозрачность работы. Сплоченный коллектив, который уже на протяжении нескольких лет работает над сложными задачами. На время адаптационного периода у вас будет ментор, который поможет вам быстро адаптироваться в задачах, команде и проекте. Расширенный социальный пакет, о котором мы расскажем вам на встрече :)",
  "keywords" : [ "Java", "Микросервисы", "Работа с базами данных", "Spring Framework", "SOLID", "Шаблоны проектирования" ],
  "address" : "Минск, улица Академика Купревича, 3"
}, {
  "url" : "https://hh.ru/vacancy/107302343?query=java",
  "companyName" : "Т-Банк",
  "textContent" : "Мы расширяем команды и ищем разработчиков для развития нескольких сервисов: Т-Инвестиции. Мы — лидер среди брокеров по количеству активных клиентов. Делаем инвестиции удобными, технологичными и понятными; Т-Бизнес. Меняем подход к ведению бухгалтерии, обмену документами между организациями и работе с архивами — переводим все и вся в цифру; Т-Страхование. Развиваем платформу прямых продаж. Наша цель — предсказуемый, удобный процесс для бизнеса и клиента; Платежные технологии и процессинг. Занимаемся разработкой и поддержкой платежного шлюза банка. Задачи шлюза — определять тип платежей, наполнять их данными из других систем банка и проверять разрешенность операций. У нас много интересных и разнообразных задач, опытная команда и отличные возможности для роста. Откликайтесь на вакансию, чтобы узнать о проектах и выбрать подходящий для вас. Что нужно будет делать: Разрабатывать внешние и внутренние продукты Прорабатывать и реализовать интеграционные решения Что мы ждем от нашего кандидата: Опыт разработки на Java от 6 лет Опыт коммерческой разработки на Java 11+ или Kotlin Опыт коммерческой разработки с любым из фреймворков: Spring Boot, Quarkus, Micronaut или Vert.x Опыт коммерческой разработки с одним из контейнеризаторов: Kubernetes, Docker или OpenShift Опыт коммерческой разработки с одним из брокеров: Kafka, Rabbit MQ или Active MQ Опыт коммерческой разработки с PostgreSQL, MySQL или Oracle будет плюсом Опыт работы с системой контроля версий Мы предлагаем: Гибридный формат работы (офис находится в Минске, Беларусь) по ТК РБ 31 календарный день отпуска и до 5 sick days в году Медицинское страхование (со стоматологией и медикаментами) и страховку от несчастных случаев (+ льготное страхование для ваших близких) Золотую карту AllSports или частичную компенсацию затрат на спорт от стоимости абонемента Профессиональное развитие в университете Т-Апгрейд, возможность участвовать в митапах, тренингах и МК от Т-Банк, частичную компенсацию внешних обучающих программ / сертификаций Компенсацию такси или питания до 12 рублей в день Мощную технику на выбор (Windows / MacBook) Программу лояльности для сотрудников Т-Банк в Беларуси от партнеров (benefits.by) Достойную зарплату (с привязкой к USD) и годовой бонус Ежегодный пересмотр зарплаты",
  "keywords" : [ "RabbitMQ", "Java", "Hibernate", "Docker", "PostgreSQL", "MySQL", "Spring Framework", "Apache Kafka", "Spring Boot", "ORACLE", "Kubernetes", "Kotlin" ],
  "address" : "Минск, проспект Победителей, 110"
}, {
  "url" : "https://hh.ru/vacancy/107877851?query=java",
  "companyName" : "Т-Банк",
  "textContent" : "Ищем QA-инженеров, которые будут тестировать мобильные приложения. У нас много проектов и интересных задач — вам понравится В Т-Банк мы создаем и развиваем десятки высоконагруженных сервисов. А QA-команда делает так, чтобы все работало без сбоев 24/7. Каждый день мы проводим сотни тестов и проверяем десятки гипотез, чтобы создавать продукты, которые нравятся клиентам. Мы ищем QA-инженеров, которые будут тестировать мобильные приложения, которые разделяют наши главные ценности: высокое качество и безопасность продуктов. Среди проектов — внутренние и внешние платформы, обеспечивающие работу сервисов. Для iOS мы используем нативные средства разработки, Swift и тестовый фреймворк XCTest. Сборку iOS-приложений автоматизируем с помощью Fastlane. На Android используем Kotlin и фреймворки тестирования Espresso и UIAutomator, для мокирования — WireMock. Что нужно будет делать: Тестировать мобильные приложения на платформах iOS и Android; Составлять тестовую документацию, в том числе разрабатывать приемочные критерии; Сопровождать релизы; Анализировать функциональность на наличие слабых мест, выявлять дефекты и контролировать их исправление. Что мы ждем от нашего кандидата: Есть опыт работы мобильным тестировщиком от 2 лет; Знаете один из языков программирования: Java/Kotlin, JS/TS, Swift, Python, C#; Умеете работать с системами контроля версий; Умеете работать с REST API, HTTP/HTTPS и JSON; Умеете использовать снифферы трафика: Charles, Fiddler и другие; Есть опыт использования mock-сервисов при тестировании функциональности; Опыт работы с XCTest, UIAutomator; Allure, JUnit, Maven/Gradle и понимание процессов CI/CD будут плюсом. Мы предлагаем: Возможность работы в аккредитованной ИТ-компании; Комфортную для тебя заработную плату (обсудим ее на собеседовании); Полис ДМС со стоматологией и страховка от несчастных случаев для тебя, а также льготные условия страхования для близких; Компенсация спорта и фитнеса по системе AllSports (золотая карта); Компенсация питания и такси; Мощную технику на выбор (MAC/WIN); Профессиональное развитие. Проводим митапы, тренинги и мастер-классы, дадим доступ к огромной технической библиотеке; Оплата конференций, курсов и много чего еще.",
  "keywords" : [ "Linux", "Atlassian Jira", "iOS", "Функциональное тестирование", "Android" ],
  "address" : "Минск, проспект Победителей, 110"
}, {
  "url" : "https://hh.ru/vacancy/107877858?query=java",
  "companyName" : "Т-Банк",
  "textContent" : "Ищем QA-инженеров, которые будут тестировать backend. У нас много проектов и интересных задач — вам понравится. В Т-Банк мы создаем и развиваем десятки высоконагруженных сервисов. А QA-команда делает так, чтобы все работало без сбоев 24/7. Каждый день мы проводим сотни тестов и проверяем десятки гипотез, чтобы создавать продукты, которые нравятся клиентам. Мы ищем QA-backend-инженеров, которые разделяют наши главные ценности: высокое качество и безопасность продуктов. Среди проектов — внутренние и внешние платформы, обеспечивающие работу сервисов. Мы тестируем приложения в связке с брокерами сообщений: Kafka, MQ, а также с базами данных: Oracle, PostgreSQL, Ignite. А еще тестируем API продуктов и сервисов, используя Postman, Swagger и автотесты. Что нужно будет делать: Проводить функциональное и автоматизированное тестирование. В том числе анализировать и тестировать требования; Работать в продуктовой команде; Разрабатывать тестовую документацию и приемочные критерии, готовить тестовые данные; Сопровождать релизы. Что мы ждем от нашего кандидата: Знаете теорию тестирования, есть опыт работы в тестировании от 2 лет; Знаете тест-дизайн: умеете применять основные техники, составлять чек-листы и тест-планы под задачи; Знаете один из языков программирования: Java, Kotlin или Go; Знаете SQL (джойны, группировки); Умеете работать с API (rest/soap); Умеете работать с системами логирования: отчетами, алертами и дашбордами; Разбираетесь в Gitlab, работаете с пайплайнами и логами. Мы предлагаем: Возможность работы в аккредитованной ИТ-компании; Комфортную для тебя заработную плату (обсудим ее на собеседовании); Полис ДМС со стоматологией и страховка от несчастных случаев для тебя, а также льготные условия страхования для близких; Компенсация спорта и фитнеса по системе AllSports (золотая карта); Компенсация питания и такси; Мощную технику на выбор (MAC/WIN); Профессиональное развитие. Проводим митапы, тренинги и мастер-классы, дадим доступ к огромной технической библиотеке; Оплата конференций, курсов и много чего еще.",
  "keywords" : [ ],
  "address" : "Минск, проспект Победителей, 110"
}, {
  "url" : "https://hh.ru/vacancy/107877890?query=java",
  "companyName" : "Т-Банк",
  "textContent" : "Ищем тимлидов для развития проектов: — мобильный банк для физлиц, бизнеса и инвестиций; — нефинансовые сервисы внутри банка с помощью кросс-платформенных решений; — машинное обучение в продуктах и внутренние процессы компании, вкладываемся в долгосрочные исследования. Развиваем сервис телефонного ассистента Олега для защиты от спамеров и мошенников; — высоконагруженная и отказоустойчивая система Т-Инвестиций, которая управляет активами пользователей, принимает запросы на операции с активами, обрабатывает информацию от биржи; — развитие ИТ в России: делимся опытом и приглашаем выступать экспертов из других компаний; — масштабируем существующие и создаем новые продукты на международном рынке. Вам предстоит: управление командой разработки (аналитики, разработчики, QA-инженеры), участие и принятие решений в найме определение стека разработки для новых сервисов найм сотрудников обсуждение требований и участие в планировании развития продукта проектирование архитектуры решений проработка архитектуры со смежными подразделениями Что ждем от кандидата: опыт работы в роли TeamLead команды разработки > 1 года опыт управления полноценной командой (аналитика-разработка-тестирование-delivery от аналитики до production) хорошее знание используемого стека разработки (нужно пройти собеседования по соответствующим секциям найма : .NET, Java, Python, Go, Frontend) опыт построения решений в микросервисной архитектуре опыт в проектировании систем (хорошая оценка в секции Дизайна) Мы предлагаем: Работу в офисе в Минске. График работы — гибридный Оформление по ТК РБ Платформу обучения и развития «Т‑Банк Апгрейд». Курсы, тренинги, вебинары и базы знаний. Поддержку менторов и наставников, помощь в поиске точек роста и карьерном развитии Заботу о здоровье. Оформим полис ДМС со стоматологией и страховку от несчастных случаев. Компенсацию обедов и транспорта После окончания испытательного срока — частичную компенсацию затрат на спорт и 5 sick days в год 31 календарный день отпуска в год Программу лояльности для сотрудников от партнеров Достойную зарплату — обсудим ее на собеседовании",
  "keywords" : [ "Разработка", "Teamleading" ]
}, {
  "url" : "https://hh.ru/vacancy/109228550?query=java",
  "companyName" : "Т-Банк",
  "textContent" : "Мы расширяем команды и ищем разработчиков для развития нескольких сервисов: Т-Инвестиции. Мы — лидер среди брокеров по количеству активных клиентов. Делаем инвестиции удобными, технологичными и понятными; Т-Бизнес. Меняем подход к ведению бухгалтерии, обмену документами между организациями и работе с архивами — переводим все и вся в цифру; Т-Страхование. Развиваем платформу прямых продаж. Наша цель — предсказуемый, удобный процесс для бизнеса и клиента; Платежные технологии и процессинг. Занимаемся разработкой и поддержкой платежного шлюза банка. Задачи шлюза — определять тип платежей, наполнять их данными из других систем банка и проверять разрешенность операций. У нас много интересных и разнообразных задач, опытная команда и отличные возможности для роста. Откликайтесь на вакансию, чтобы узнать о проектах и выбрать подходящий для вас. Что нужно будет делать: Разрабатывать внешние и внутренние продукты Прорабатывать и реализовать интеграционные решения Что мы ждем от нашего кандидата: Опыт разработки на Java/Kotlin от 3 лет Опыт коммерческой разработки на Java 11+ или Kotlin Опыт коммерческой разработки с любым из фреймворков: Spring Boot, Quarkus, Micronaut или Vert.x Опыт коммерческой разработки с одним из контейнеризаторов: Kubernetes, Docker или OpenShift Опыт коммерческой разработки с одним из брокеров: Kafka, Rabbit MQ или Active MQ Опыт коммерческой разработки с PostgreSQL, MySQL или Oracle будет плюсом Опыт работы с системой контроля версий Мы предлагаем: Гибридный формат работы (офис находится в Минске, Беларусь) по ТК РБ 31 календарный день отпуска и до 5 sick days в году Медицинское страхование (со стоматологией и медикаментами) и страховку от несчастных случаев (+ льготное страхование для ваших близких) Золотую карту AllSports или частичную компенсацию затрат на спорт от стоимости абонемента Профессиональное развитие в университете Т-Апгрейд, возможность участвовать в митапах, тренингах и МК от Т-Банк, частичную компенсацию внешних обучающих программ / сертификаций Компенсацию такси или питания до 12 рублей в день Мощную технику на выбор (Windows / MacBook) Программу лояльности для сотрудников Т-Банк в Беларуси от партнеров (benefits.by) Достойную зарплату (с привязкой к USD) и годовой бонус Ежегодный пересмотр зарплаты",
  "keywords" : [ "RabbitMQ", "Java", "Docker", "PostgreSQL", "Spring Framework", "Spring Boot", "Kubernetes", "Kotlin" ],
  "address" : "Минск, проспект Победителей, 110"
}, {
  "url" : "https://rabota.by/vacancy/111764881?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "УП Е-Вижн",
  "textContent" : "О вакансии: В команду Web разработки ищем Senior PHP Разработчика. Среди наших проектов - b2c и b2b магазины, информационные сайты известных брендов: AENO, Canyon, Lorgar, Prestigio, а также разработанные нашей командой CMS и CRM системы для управления контентом, каталогом, продажами и маркетингом. Ключевые обязанности: Разработка и поддержка высоконагруженных проектов; Участие в разработке архитектуры; Участие в Design Review и Code Review; Обзор и улучшение инструментов автоматизации для CI/CD. Требования: Опыт работы на PHP от 5 лет; Работа с Laravel 8+; Знание PHP 8.0 и выше; Опыт работы с PostgreSQL / MySQL (движки БД, индексы, оптимизация запросов); Опыт работы с Redis; Опыт работы с Elasticsearch; Уверенное знание и понимание принципов SOLID и паттернов проектирования; Знание принципов микросервисной архитектуры; Понимание и опыт работы с CI/CD; Опыт написания модульных тестов; Знание и умение настраивать NGINX; Опыт настройки логирования и мониторинга сложных систем. Будет плюсом: Опыт работы с крупными и сложными проектами; Уверенное знание SQL, сложных запросов, знание оптимизации SQL-запросов; Опыт работы с другими языками программирования (Java, C#) и NodeJS; Опыт разработки на Vue.js/JS; Особенности проекта: основной сервер на PHP, работа с базами данных RDBMS/NoSQL, брокер сообщений Rabbit MQ, движок Elasticsearch. Мы предлагаем: интересные и разнообразные задачи; динамичную работу в международной компании; широкие возможности для профессионального развития и роста; стабильность, социальное обеспечение и гарантии; конкурентоспособную заработную плату. Оставляй отклик! Будем рады тебе в нашей команде.",
  "keywords" : [ ],
  "address" : "Минск, Каменная Горка, улица Притыцкого, 156"
}, {
  "url" : "https://rabota.by/vacancy/112339997?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Хайэнд Системс",
  "textContent" : "Welcome to the forefront of financial technology innovation at HES FinTech! Our vision is to bridge the gap between traditional and modern lending methods, empowering clients with cutting-edge financial solutions. At HES FinTech, we are committed to transforming the way financial institutions operate and interact with their customers. We are currently seeking an experienced Lead Java Developer to join us in shaping the future of lending at HES FinTech. Responsibilities: - Maintaining ongoing development - Refactoring of current projects and suggesting ideas for project optimization - Providing technical leadership for the development team - Conducting code reviews - Mentoring and team development - Communication with a customer - Supplying and supporting deliveries to customers - Being able to travel on business trips, acting as a technical specialist Requirements: Experience - 5+ years of development/engineering experience, preferably in the fintech industry Technical Skills - Strong Java programming skills with expertise in Spring, Spring Boot, Hibernate - Proficiency in development practices including unit testing, CI/CD, refactoring, and clean code - Good knowledge of Camunda BPM for business process management - Understanding of web protocols and technologies (HTTP, TCP, SSL, WebSockets) with principles of cryptography for securing sensitive data - Understanding of principles of building REST API with knowledge of OpenAPI for API documentation generation - Working knowledge of relational databases (Postgres) - Familiarity with Docker and containerization concepts - Expertise in multi-threading development and Synchronization - Experience with cloud technologies, particularly AWS, for deployment and scalability Soft Skills - Good communication skills and the ability to guide the team through challenges faced by less experienced developers - Experience in team motivation and mentoring Language Proficiency - Good technical English verbal/writing skills (B2) Nice to have - Experience in developing scalable platforms using Kubernetes - Working knowledge of client-side web technologies (React) - Understanding of development methodologies (both agile and non-agile) Perks & Benefits: - Flexible working hours and remote work opportunities - Continuous learning and professional development opportunities - 50% reimbursement of medical insurance - Office in the very center of Minsk Join us at HES FinTech and be part of shaping the future of financial technology!",
  "keywords" : [ ]
}, {
  "url" : "https://rabota.by/vacancy/112707544?query=java&hhtmFrom=vacancy_search_list",
  "companyName" : "Хайэнд Системс",
  "textContent" : "Welcome to the forefront of financial technology innovation at HES FinTech ⚡ HES offers comprehensive lending software solutions tailored for banks, financial institutions, and fintech startups. We are currently looking for an experienced Java Developer to join HES team. Requirements: Confident knowledge of Java 17+ Experience in developing web applications; Understanding of principles of building REST API; Knowledge of web protocols and technologies (HTTP, TCP, SSL) Understanding of principles of relational database; Expertise in multi-threading development, synchronization patterns; 2+ years of experience in Java; Ability to communicate in English Nice to have: Understanding of development methodologies (both agile and non-agile); Experience in using jQuery, HTML5, CSS in website development; Experience in using Spring MVC and Spring Security; Understanding of principles of cryptography; Ability to communicate in English We offer: Physical office in Minsk, remote work opportunity Flexible working hours Continuous learning and professional development opportunities 50% reimbursement of medical insurance Our team is our treasure. It's truly comfortable to work with us :) Join the HES Fintech team and contribute to reshaping the financial technology landscape!",
  "keywords" : [ ]
}, {
  "url" : "https://hh.ru/vacancy/111578046?query=java",
  "companyName" : "Яндекс",
  "textContent" : "Реклама — сложный технический продукт с большим количеством интеграций с внешними системами. Над развитием рекламного SDK трудятся более 20 мобильных разработчиков. У нас большое количество задач: от новых дизайнов Backend-Driven UI и повышения эффективности форматов до архитектурных оптимизаций и улучшения инфраструктуры. Мы работаем над развитием рекламного IOS SDK (https://ads.yandex.com/monetization), который позволяет показывать семь форматов рекламы, и общего мобильного бэкенда. Подробнее о продукте: https://halved-magazine-c13.notion.site/SDK-9ac6cd9141794e0d93e1122eccde7a14 SDK написан на Swift и позволяет показывать шесть форматов рекламы: Banner, Native, Interstitial, Rewarded, App Open и In-Stream. Чтобы получить как можно больший охват, мы не торопимся поднимать iOS-таргет, сейчас у нас iOS 13. Для показа рекламы используем Backend-Driven UI, что позволяет нам проводить A/B-тестирование новых дизайнов и катить их в прод без релиза новой версии SDK. Для обеспечения стабильности SDK мы покрываем весь код Unit-тестами и покрываем фичи авто/UI-тестами. Также мы собираем свои креши, благодаря чему можем быстро среагировать на их рост и, например, как можно раньше отключить проблемную фичу или эксп. Мы предоставляем множество способов интеграции с рекламным SDK. Интегрируемся в сторонние платформы медиации и развиваем свою собственную. Развиваем плагины для Unity и Flutter. Медиационная платформа позволяет через один API Yandex SDK показывать рекламу от разных рекламных систем. Партнёру надо всего лишь подключить несколько дополнительных зависимостей, после чего разные рекламные сети будут бороться за то, чтобы показать пользователю самую дорогую рекламу. С внедрением Backend-Driven UI значительная часть работы команды сосредоточена в мобильном бэкенде. Здесь мы получаем ответ от рекламной системы, преобразуем его в объектную модель и строим вёрстку с помощью DivKit DSL. Бэкенд написан на Koltin & Java. За стабильностью бэкенда следим через дашборды и алёрты. Все изменения проверяем через Diff-тесты и UI-тесты. Какие задачи вас ждут: Улучшить схему работы с Backend-Driven UI Backend-Driven UI имеет ограниченную функциональность, что не всегда позволяет реализовать все наши идеи. Наша задача — расширить его текущие возможности и сделать его гибче для работы на бэкенде. Повысить эффективность рекламных форматов Вам предстоит реализовать и запустить через A/B-тестирование новые форматы, сделать отображения текущих дизайнов «богаче» за счёт добавления новых ассетов, перейти от ручного выбора дизайна и его наполнения к выбору через ML. Ускорить загрузку и отображение рекламных форматов Нужно будет выделить наиболее проблемные срезы скорости загрузки рекламы, найти возможности для ускорения и реализовать их. Цель — быть как минимум не хуже конкурентов. Реализовать новые способы интеграции Предстоит перейти со схемы дублирования запросов в медиации на Open Bidding — схему с предварительным серверным подбором рекламы. Нужно повысить эффективность Open Bidding доработками в SDK и бэкенде, реализовать новый кросс-платформенный плагин для SDK, поддержать новые рекламные сети в медиацию через реализацию адаптера. Повысить стабильность SDK и рантайма бэкенда Нужно довести автоматизацию UI-тестов до 90%, улучшить сбор крешей SDK, исправить найденные баги и креши, настроить рантайм-алёрты на продуктовые и технические срезы рекламного SDK. Мы ждем, что вы: Разрабатывали мобильные приложения или SDK для iOS Имеете опыт проработки крупных фич, понимаете, для чего делается фича и как она повлияет на конечного пользователя и метрики продукта Готовы много исследовать для поиска решения Готовы работать не только с iOS + Swift, но и с нашим мобильным бэкендом и плагинами Что мы предлагаем: оформлении по ТК РБ офисный или гибридный формат работы (1-2 дня в неделю удалённо) в офисе в Минске гибкий график, ориентация на результат, а не на часы работы; расширенный ДМС с первого месяца: стоматология, обследования, вызов врача на дом, оплата 80% стоимости полиса для супругов и детей корпоративные бонусы: компенсация оплаты питания в офисе, тренажёрные залы, скидки от партнёров и многое другое; корпоративная жилищная программа; корпоративное обучение, образовательные программы Яндекса;",
  "keywords" : [ "Swift", "iOS" ]
}, {
  "url" : "https://hh.ru/vacancy/86726805?query=java",
  "companyName" : "Яндекс",
  "textContent" : "Вертикали — это бизнес-юнит Яндекса, в который входят несколько крупных продуктов, объединённых одним вектором: развитием классифайдов (досок объявлений) в важных для жизни областях. Внутри мы создали буткемп Java-разработки, который поможет на старте выбрать именно ту команду, которая вам подходит. В рамках этой программы вы проведёте по две недели в трёх разных командах, чтобы лучше понять их процессы и подходы к разработке, и приземлитесь в приоритетную для вас. Немного о нас Путешествия – сервис, который помогает пользователям самостоятельно организовать себе отдых или командировку под ключ. Недвижимость помогает не только купить, продать, снять квартиру или коммерческую недвижимость, но и предоставляет достоверную информацию об объектах. Аренда — удобный городской сервис, где специалисты помогают собственникам быстро сдать в аренду квартиры, а арендаторам — найти новый дом. Какие задачи вас ждут Активное развитие по-настоящему масштабного бизнеса, понятного каждому, кто хоть раз ездил в отпуск или снимал (приобретал) жильё Проектирование, разработка и масштабирование микросервисов Решение продуктовых и инфраструктурных задач Создание и поддержка программного обеспечения от написания до выкладки в продакшн Обеспечение стабильной работы компонентов и оперативное решение проблем Мы ждём, что вы Имеете более трёх лет опыта коммерческой разработки на Java или готовы перейти с другого языка программирования Знаете классические алгоритмы и структуры данных Разрабатывали сложные веб-приложения или системы обработки данных Умеете проектировать системы Будет плюсом, если вы Создавали и разрабатывали проекты с нуля Разрабатывали высоконагруженные системы Что мы предлагаем Возможность работы в Москве (БЦ «Аврора», ст. М. «Павелецкая»), Санкт-Петербурге (БЦ «Бенуа», Калининский район), Екатеринбурге (БЦ «Палладиум») или Минске (БЦ Rubin Plaza) в офисном или гибридном формате Объёмный полис ДМС со стоматологией, коррекцией зрения, регулярным чекапом и помощью при критических заболеваниях (онкологии, болезнях сердца), а также с компенсацией психотерапевтической помощи ДМС также можно купить и для близких родственников — компания оплатит 80% Стараемся сократить регулярные расходы сотрудников: у нас сотни вариантов корпоративных скидок во всех областях жизни, компенсация оплаты питания в офисе и многие другие сопутствующие бенефиты",
  "keywords" : [ "Java", "PostgreSQL", "Logbrocker", "Spring Framework", "Kotlin", "GRPC" ]
} ]